{
  "rxqgrm": {
    "title": "GME is currently up 30% AH",
    "selftext": "As the title says GME has a decent jump after hours.\n\nAny ideas?\n\n  \n\n\n  \nMy first post was removed for being too short so here are some quotes from famous people as per goog  \n\n\nQuotes by Famous People\n\n1. The greatest glory in living lies not in never falling, but in rising every time we fall. *-Nelson Mandela*\n2. The way to get started is to quit talking and begin doing. *-Walt Disney*\n3. Your time is limited, so don't waste it living someone else's life. Don't be trapped by dogma – which is living with the results of other people's thinking. *-Steve Jobs*\n4. If life were predictable it would cease to be life, and be without flavor. *-Eleanor Roosevelt*\n5. If you look at what you have in life, you'll always have more. If you look at what you don't have in life, you'll never have enough. *-Oprah Winfrey*\n6. If you set your goals ridiculously high and it's a failure, you will fail above everyone else's success. *-James Cameron*\n7. Life is what happens when you're busy making other plans. *-John Lennon*",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/rxqgrm/gme_is_currently_up_30_ah/",
    "score": 5043,
    "author": "jtmn",
    "created_utc": 1641507155,
    "num_comments": 179
  },  "rygaqb": {
    "title": "YOLOd into tech options (GOOG, AMZN) on the day before Fed Minutes. At Dollar General now shopping crayons for Lunch and Dinner.",
    "selftext": "",
    "url": "https://i.redd.it/peua727gmba81.jpg",
    "score": 383,
    "author": "Ok-Sample7393",
    "created_utc": 1641585448,
    "num_comments": 54
  },  "rzzos5": {
    "title": "Is it different this time? A wider perspective.",
    "selftext": "While most of us believe stock market is extremely overvalued with many mini bubbles popping up everywhere, I just wanted to look at this a bit differently by introducing a historical perspective in terms of the companies that make up today's markets, technology, the wealth creation and generation and most importantly the flow of money into goods and services.\n\nI wasn't old enough to grasp the dot-com crash back in early 2000's and while I do remember '08 crash pretty well, it took me many years to understand the underlying drivers of it. Over the years I tried to expand my knowledge of the markets and always tried to look at things from an historical perspective especially at those periods when markets were down/flat/didn't go anywhere for years or decades. With that perspective, what I want to try here is to use the benefit of hindsight, but not to state the obvious, but rather, state how things turned out in reality vs expectations at the time.\n\nListening to Warren Buffett's older speeches, one of the things he mentions often was that how American society thought they would be taken over by Japan in terms of technological advancement back in the late 70's and early 80's and that there was not enough optimism with respect to American innovation that could prevail its leadership going into the following decades. While obviously not the only factor, this lack of optimism was apparently evident in markets and there were many years when not much was happening.\n\nIt is actually fascinating to observe that over the coming years, the exact opposite has happened. Introduction of computer in the 60's in the west coast - perhaps much earlier than most of the world - the creation of Silicon Valley and emergence of big-tech are more than just happenstance. I am not an American. While i will not go too further deep into this topic here, my personal view is this all goes back to foundations of the country and the fact that there is no cultural baggage/deeply embedded subconscious that prevents things from happening on this side world. Perhaps the big reason for this is the change in behavior/consciousness of people who emigrated here and were able to drop the burdens of the past.\n\nIf you think about the wealth currently possessed in our world, most of it was perhaps created/generated in the last 50-100 years (perhaps even 20-30 years). You might have been born somewhere with rich history (as I was), your forefathers and the empires that they have built could have ruled the world for hundreds or thousands of years and conquered every corner of the world, but none of that matters now. It's as if millions of years of history is almost irrelevant at this point because you were either able to adapt things in the past few decades or you were not. What I am obviously talking about here is the new creation of wealth as the existing wealth matters less and less each day. One of the reasons for this is obviously the fact that the world has not seen a \"reset\" since World War 2. It is perhaps the first time in history when we had such prolonged peace.\n\nLet's think for a second the implications of globalization in this peace period. This is perhaps the first time in history where the world is so connected that even the products we use on a daily basis are the same. Imagine the flow of goods and services 50 years ago or even 25 years ago. Were you able to access goods and services overseas this easily? Where would your disposable income be spent on? Even 25 years ago local markets did matter for the most part. I'd watch local TV, buy local newspaper, only a handful people had cellphones, internet was still nascent, most of the appliances in your home were already a commodity. If you had disposable income, most of the money would be circulated within the local economy and the most expensive things would be the house you'd buy (that obviously does not change today) and a car which would benefit a few countries but not a single one (perhaps Germany for the most part). So all in all, there was no single country that the money was flowing into. This was not possible by design.\n\nI am not saying all this goes away now. But thinking for a second, isn't this really the first time that a significant portion of disposable income, wherever you are in the world, flows into one single country? And for economies in which this does not happen, do they really matter to the global wealth in grand scheme of things?\n\nTake Europe or Middle East for instance, amazing blend of many cultures, languages. The entire world once was ruled from Mesopotamia, then Ancient Egypt, Ancient Greece, Rome and so on. Are they relevant anymore? What does a beloved country of Italy contribute to world economy these days? France? Spain? UK? South East Asia? - amazing corners of the world, billions of lovely people. Do they matter from a wealth creation and flow of money perspective? Of course they do, but to what extent if you think about end products: goods and services. What do they actually produce that the entire world consumes/needs? Of course Middle East has oil. But oil is a raw material and the goods and services used by this wealth creation does not necessarily change - the cars they buy, the planes they fly, the services they use are not locally produced. Take Saudi Arabia, a total GDP about $800 billion with all the oil. Apple generated $366 billion revenues in the last twelve months.\n\nLet's expand upon this.\n\nLet's assume you wake up in the corner of the world and don't have survival problem. What you do or spend your time is not significantly different than us here in the US. Your homepage is google for everything, you use whatsapp to talk to your friends, you are on instagram, your business uses outlook/microsoft, your phone is samsung/apple/android, you log into youtube on a daily basis, you prefer to watch netflix over local TV. (Sure, China is different from this aspect but it is also the reason why they have been outpacing everywhere else in terms of economic growth. They were not stupid about this and realized the effects of globalization early on).\n\nNow, you might be thinking - dude that is only such a small portion of the world. Millions of people don't even have access to any of those. I am well aware of that and while it is correct for the most part, from an \"overall wealth creation perspective\", billions of people actually don't matter all. It may sound so harsh, but think about the many countries of the world with millions of population and realize that their total GDP is less than the cash sitting idle on Berkshire Hathaway balance sheet.\n\nOr think of this perspective: What would happen if their disposable income was magically 10x tomorrow? What goods and services would they spend their money on? Is it really the local goods and services that would benefit from the overall increase in GDP - of course to a great extent - or is it really a handful of companies in the world that would actually benefit disproportionately from this wealth increase when that happens? If everybody in India could afford iPhones would they buy something else instead? Or would they be able to produce a competing good or a service locally that the entire world would consume? Would the money really flow elsewhere?\n\nOr are they really late in the game anyway, as we already argued that in the wealth creation game only the most recent period matters.\n\nSince the dot-com bubble era, I'd argue that a lot of things have changed. It is interesting because dot-com bubble was the classic innovation pattern - people knew internet was the next big thing but it was not exactly clear who the winners in the next decades would be. 20 years since, we know who the winners are. We know what business models work, what business models can scale, have network effects and become profitable and so on. Horses vs cars was another classical example. You did not have to be a genius to realize cars would take over horses but time was harsh to many car companies in that there was no one single winner. It was by design of the product it became commoditized. Same can be argued for air travel. Internet however is different. While new business models emerge, consolidation and monopolistic effects are far more real - it's a world where big becomes bigger as it employs smartest people, outbids competition, and constantly innovates.\n\nOf course there is no guarantee this will go on like this. After all, if you look at top 10 companies in the S&amp;P 500 for each of the past several decades, you will see interesting results. How will the next big thing overthrow the existing giants when big always get bigger, especially when they benefit from the overall wealth increase in every corner of the world? Perhaps a new technology or maybe a catastrophe can trigger this. While I'd never want to guess the future, I am inclined to think as long as the status-quo peace continues, certain companies in the world  - as they keep their innovative pace - will continue to dominate.\n\nIs the market expensive? It sure is. But what will happen tomorrow if GOOG, AAPL, AMZN drop by 20%? Wouldn't people rush to put their entire wealth the next day? Sure multiples can contract. But is a 25bps/50bps move in rates going to destroy these companies? Would it make them worth less? Yes discounted cash flows should be lower and they may be growing 15% instead of 20%. But 5 years from now, are we going to see something similar to dot-com bubble where things don't recover?\n\nBut where else can the money go when your disposable income will be spent on that next iPhone, or half your time is spent on instagram/whatsapp/youtube/google, your businesses will still use Microsoft and its products and that will probably not change anytime soon. These are important as indices are market-cap weighted indices. So we would need a correction in big-tech more than anything else. And even if they do change, from which corner of the world is the next big thing going to emerge? \n\nNone of this is against the argument that the markets will not correct. However, I do not think the examples of dot-com era or 08' are justified. I think something \"bigger\" than 25bps increase in rates is needed for US markets to crash and stay at those levels for longer periods of time. This is again based on my reasoning that there is a wider fundamental shift in how we live and consume in comparison to past. And I did not even go into the demographic change here which is a totally different animal on its own.\n\nWould love to hear your thoughts. Thanks for reading.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/rzzos5/is_it_different_this_time_a_wider_perspective/",
    "score": 155,
    "author": "Henkss",
    "created_utc": 1641757429,
    "num_comments": 106
  },  "s4vnhw": {
    "title": "15k to 134k in a Day $tsla $Goog Puts",
    "selftext": "",
    "url": "https://i.redd.it/db3i7o9ddxb81.jpg",
    "score": 228,
    "author": "mtannous84",
    "created_utc": 1642284464,
    "num_comments": 40
  },  "sakb7p": {
    "title": "1974 - 2022 - Economy cycle analyzed.",
    "selftext": "Please take this post with a HUGE grain of salt. I am not saying we are going to go down in a straight line. We will likely bounce here and there but yes, I am calling a  major correction/recession.\n\nSpent 2 hours on this to show how fked we are - rates may be eyeballed as I referenced bar graphs\n\n**TLDR: Fed's basically BRRRR'd and left the overnight/interest rates at rock bottom lows (opps?) creating the biggest asset bubble we have ever seen in the entire history of mankind and mind-numbing inflation.**\n\n[SPY monthly chart - with commentary](https://invst.ly/x6shz)\n\n[SPY monthly - 1974 - Jan 2022 \\(48 years\\)](https://preview.redd.it/j80ngysj5dd81.jpg?width=1858&amp;format=pjpg&amp;auto=webp&amp;s=1bc040dd32a9b4ee7b5ef6730f0f24fb09cdf550)\n\nEV bubble:  TSLA and EV is probably the biggest bubble from what I can tell and Elon managed to sell the top. EV cars is like gas cars back then but never commanded a huge P/E. Cars are utility, goes A-B. When people see through that self driving tech is a decade away (prob due to city infrastructure to support self-driving and political red tape \\[nobody is rushing to have a self-driving car\\]), we can see some downside or relatively flatness or bearish on it.\n\nReal estate - bubble.... everywhere... Cheap money borrowed from the Feds. Canada's YOY RE prices has gone up 27%. There is no supply issue because we had this supply issue pre-pandemic but we never popped 27% in a single year or even close to it. People are balls deep in mortgage payments, and those who got in late is even more screwed.\n\nmetaVerse - a pandemic by product - too early to tell how to monetize this space. You can tell companies have been doing this, CS GO - skins, Diablo 3 - marketplace. These have not taken off in any dramatic way so we can gauge consumer sentiment to spend money in a virtual reality.\n\nAI innovations- this would be deflation.\n\nSPY top holdings are BIG TECH. Big tech was the major theme of the pandemic hedge which ended up being great winners. Re-opening is a negative for all these companies and the pandemic is basically over after this year.\n\nThe thing trading at 35k right now. This that have no value, is speculation. Speculation ends up being a bubble. EVEN if this thing is the next best thing, we are too early. All this cheap money finding new ideas to generate an ungodly P/L is basically, a matter bubble.\n\nWarren Buffett - ATH cash holdings. Going to wait out for the market to kick out the froth.\n\nChina - Imposing tons of new regulations to soften their markets, whether it be RE market (tax on developers), big tech (listing and fines, all regulations), ensuring the COMMON prosperity can continue (most China markets are/were already inflated before this initiative was introduced). China is basically a step ahead of the US Feds in controlling their economic cycles.\n\nRead this, [https://www.investopedia.com/articles/stocks/10/5-steps-of-a-bubble.asp](https://www.investopedia.com/articles/stocks/10/5-steps-of-a-bubble.asp), then reflect on life around you, then read it again. Tell me with a straight face we aren't in the biggest asset bubble humans have ever seen.\n\n&amp;#x200B;\n\n&gt;SPY Top 10 Holdings (27.37% of Total Assets)Name Symbol % AssetsApple Inc AAPL 5.90%Microsoft Corp MSFT 5.60%Amazon.com Inc AMZN 4.05%Facebook Inc A FB 2.29%Alphabet Inc A GOOGL 2.02%Alphabet Inc Class C GOOG 1.96%Berkshire Hathaway Inc Class B BRK.B 1.45%Tesla Inc TSLA 1.44%NVIDIA Corp NVDA 1.37%JPMorgan Chase &amp; Co JPM 1.29%",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sakb7p/1974_2022_economy_cycle_analyzed/",
    "score": 25,
    "author": "1xtimer",
    "created_utc": 1642909535,
    "num_comments": 23
  },  "sd9k59": {
    "title": "Vampire Fangs' Next Target Are Fat &amp; Juicy FAANG Stocks",
    "selftext": "For the past 3 years, vampire short sellers have decimated cannabis and many MEME stocks. They've taken the spirit and dollars from investors like a vampire drains blood from its victims.\n\nSooner or later, those stocks that have been sold short will see a short squeeze rally. As a result, the vampires will have to return to their coffins to contemplate their next moves.\n\nThese relentless vampire attacks come as a result of ultrasophisticated algorithm programs that nickel &amp; dime a stock to death with naked short sales until the proverbial rug is removed from under the feet of a stock allowing it to go into free-fall.\n\nNow that most of the blood from the cannabis sector and some MEME stocks have been sucked nearly completely dry, vampire short sellers have their eyes set on new - much fatter - targets. Namely, FAANG stocks +1 ($MSFT). These naked vampire short sellers successfully punctured their fangs into Amazon and Netflix. After they are done emaciating Amazon and Netflix, they will (at the very least) attempt to repeat their success with an attack on Apple, Facebook/Metaverse and Google. Why? As the famous bank robber Willie Sutton once responded when asked why he robbed banks, Sutton replied, \"Because that's where the money is.\"\n\nF - Facebook/Metaverse ($FB)\n\nA - Apple ($AAPL)\n\nA - Amazon ($AMZN) **💥**\n\nN - Netflix ($NFLX) **💥**\n\nG - Google/Alphabet ($GOOG)\n\n*Plus 1: Microsoft ($MSFT)*\n\n$AMZN: Vampire short sellers have already gotten their teeth tightly clenched on Amazon which, just yesterday, closed below the **\"Death Cross\"** \\- that's when a stock's 50-day moving average crosses and closes below its 200-day moving average.\n\nhttps://preview.redd.it/98gyemf242e81.png?width=1481&amp;format=png&amp;auto=webp&amp;s=e362ba523fab7b1ace0e32ab8cb45acb0b9967b0\n\n&amp;#x200B;\n\n$NFLX: Vampire short sellers have pushed Netflix **below** its **200-day** moving average. It is also approaching **\"Death Cross.\"**\n\nhttps://preview.redd.it/0nrigpnh82e81.png?width=1475&amp;format=png&amp;auto=webp&amp;s=ab0b3ddc92f424d47773dc5c73b1dabc0f44f093\n\nOf course, all of these stocks will ultimately survive the onslaught, but there will be pain and many bulls will bail at tremendous losses.\n\nBy the way, none of this would happen if the S.E.C. would simply enforce their rules against naked short selling.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sd9k59/vampire_fangs_next_target_are_fat_juicy_faang/",
    "score": 4,
    "author": "GroundbreakingLynx14",
    "created_utc": 1643213605,
    "num_comments": 13
  },  "si3tx2": {
    "title": "Stock forecast after earning for AMZN, GOOG, FB, SNAP and SPOT",
    "selftext": "I would like to hear professional WSB analysts on what they think will be the stock price change after the earning call.\n\nThe most accurate predictions get a one hour break from their job behind the Wendy's dumpster. It's just a 20 hour job so quit whining about it.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/si3tx2/stock_forecast_after_earning_for_amzn_goog_fb/",
    "score": 23,
    "author": "InternetOfficer",
    "created_utc": 1643745145,
    "num_comments": 105
  },  "sibkct": {
    "title": "Help me calculate my January bags (Goog, Nvda, Soxl options)",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sibkct/help_me_calculate_my_january_bags_goog_nvda_soxl/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1643765065,
    "num_comments": 0
  },  "sjqm38": {
    "title": "GOOG NOW OR LATER?",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sjqm38/goog_now_or_later/",
    "score": 1,
    "author": "Existing-Material164",
    "created_utc": 1643913375,
    "num_comments": 0
  },  "sjqj1y": {
    "title": "GOOG NOW OR GOOG LATER?",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sjqj1y/goog_now_or_goog_later/",
    "score": 1,
    "author": "Existing-Material164",
    "created_utc": 1643913165,
    "num_comments": 1
  },  "sjqfxm": {
    "title": "GOOG NOW OR GOOG LATER?",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sjqfxm/goog_now_or_goog_later/",
    "score": 1,
    "author": "Existing-Material164",
    "created_utc": 1643912966,
    "num_comments": 2
  },  "sjd55y": {
    "title": "Most of you won't make any money from this dip.",
    "selftext": "Y'all say to buy the dip, but when stocks are down you're too scared to pull the trigger.\n\nThen when stocks go up you're too scared to buy because you think it's going to crash.\n\nWell guess what? Now is the time to be buying. Netflix drops from the 600s to the 300s and you don't buy. Tesla enters the 700s and you don't buy. Amd went under 100 and you didn't buy.\n\nDude stop telling me the market is rigged. You're just too scared to buy and hold onto anything. Just don't buy garbage companies like wish and you'll be fine. \n\nThe problem is you guys feel this illogical need to own stocks that will like 2x expectations every quarter, which leads to these insane swings like FB and Netflix. In the real world, not every quarter and not every year is a home run. I think a lot of companies are on sale. I think a lot will bounce back. And I think a lot of you are about to miss the coming bull run over the next few months because you have paper hands like Meet Klevin.\n\nEdit:\n\nMy positions include basically all shares. I have AMD, NVDA, GOOG, NNDM (very small position), SPXL, and I have 4 SPY $500 Calls for June. I consider the only \"bet\" I am making to be the calls and possibly the NNDM. Aside from that, I can just forget about my portfolio for 5 years and know it's going to be up. I did a lot of my buying within the past few trading days. I am holding.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sjd55y/most_of_you_wont_make_any_money_from_this_dip/",
    "score": 892,
    "author": "BeardlessPete",
    "created_utc": 1643873462,
    "num_comments": 363
  },  "sj6b6v": {
    "title": "goog options",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sj6b6v/goog_options/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1643852281,
    "num_comments": 1
  },  "skliy2": {
    "title": "You Bears Are The Biggest Bitches I Ever Met, Part II",
    "selftext": "Yo, granny's back bitches.\n\nSo yesterday when the market went red cause the Zuck got cucked, my original post was bombarded with bear comments saying how wrong I was and how you f\\*gs are shoving dicks into my mouth cause I'm holding SPY and QQQ call positions that are **ITM** and doesn't even expire till **NEXT YEAR**.\n\nAll I'm going to say in response is this:\n\n\"*aww, did you wait until a wed day befowe acting cocky? Did it make you fweel special? Did you think the bear mawket is here becwause an alien CEO didn't beat estimates?\"*\n\nYeah, didn't think so.\n\nLook, you bears need to learn how to read the room. Take a look at this graph right here:\n\n[https://insight.factset.com/sp-500-earnings-season-update-november-5-2021](https://insight.factset.com/sp-500-earnings-season-update-november-5-2021)\n\nyeah, thats right. 92% of information technology companies beat estimates last quarter. What part of this screams bear market to you? Hmmm? When you look at this chart, what make you think tech stocks are honestly going to 0?\n\nLike how does your logic even work? Is it something like this?\n\n&amp;#x200B;\n\n&gt;\\*MSFT beats earnings and raises guidance  \n&gt;  \n&gt;Bears: doesn't count  \n&gt;  \n&gt;\\*AAPL crushes earnings and raises guidance  \n&gt;  \n&gt;Bears: I didn't see that  \n&gt;  \n&gt;\\*AMD crushes expectations and raise guidance  \n&gt;  \n&gt;Bears: I'm gonna pretend that didn't happen.  \n&gt;  \n&gt;\\*GOOG reports stellar earnings and issues 20:1 split  \n&gt;  \n&gt;Bears: FAAAAKE NEWS  \n&gt;  \n&gt;\\*FB beats revenue but misses EPS by 17 cents with guidance just below lower range for next quarter  \n&gt;  \n&gt;Bears: we ride at dawn, bitches!!\n\nAnyways, like I said before, since you are all clearly a bunch of mentally handicapped dotes, I'm willing to bet 90% of you **FUCKING DOUBLED DOWN** on your short term puts instead of cashing out like you should have done. Now looking at the charts, its clear you are getting sodomized by the delta while vega gang skull fucks you to death with the IV crush all the while theta gang sits in the corner, films the whole thing while touching himself.\n\nHonestly, if you bears are willing give up so much wealth, so quickly, you might as well join those communists on r/antiwork.\n\nI mean, what are you waiting for? You're already poor, starving, radical, the only thing left for you is to try to seize the means of production.\n\nTo wrap this up, I better see some hefty loss porn next week you hoes.\n\nGranny out.\n\n*\\*hops on mobility scooter*\n\nOh wait, I forgot\n\n*\\*spits on your face again*\n\n*\\*hops back on scooter and zooms back to retirement home.*\n\n**Edit 1:** The fact that I'm getting awards but only sitting on 4 upvotes really shows me how triggered you bears are. How does it feel to have your worldview be shaken so much by a post that took this internet troll 5min to make? ",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/skliy2/you_bears_are_the_biggest_bitches_i_ever_met_part/",
    "score": 1220,
    "author": "GushingGranny1",
    "created_utc": 1644001734,
    "num_comments": 207
  },  "sjzc84": {
    "title": "+280k GOOG PYPL FB SNAP",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/sjzc84/280k_goog_pypl_fb_snap/",
    "score": 1,
    "author": "LETSGETSCHWIFTY",
    "created_utc": 1643935004,
    "num_comments": 1
  },  "smshab": {
    "title": "There's an APPS for that! Why Digital Turbine should crush earnings tomorrow",
    "selftext": "Hello fellow primates and crayon-eaters. It is I, SECmydick here with my first ever DD. I have been lurking on WSB for years and have decided that now that things can't get much worse for my portfolio, I may as well make a ~~shitty~~ well-researched DD for you guys.\n\nHere's the highlights for you retards that can't read very well (all of us):\n\n* Profitable! (means they make more money than they spend, you're welcome)\n* Growing at fuckin' 337% YOY (that's year over year for you smooth brains)\n* Muthafuckin' [GOOGLE PARTNERSHIP](https://ir.digitalturbine.com/news-events/press-releases/detail/627/digital-turbine-announces-strategic-partnership-with-google)\n* And the best part.... **Cramer doesn't like it.**\n\nDisclaimer: long only 75 shares bc I am poor.\n\nDigital Turbine is probably one of the most misunderstood stocks on Wall Street. In fact, Cramer literally doesn't even know what they do. In his \"[lightning round](https://www.cnbc.com/2022/01/25/cramers-lightning-round-i-still-believe-in-cleveland-cliffs-.html)\" bullshit two weeks ago, he said:\n\n&gt;Digital Turbine: “It’s another one of those *creative video situations*. I got like 70 of them. At least it makes money. But there’s just too many of them.\n\nI don't know how much coke he's been doing, but APPS is an end-to-end, one-stop advertising and monetizing platform. They recently acquired [Appreciate](https://www.appreciate.mobi/#!/home#smart-dsp), [AdColony](https://www.adcolony.com/) and [Fyber](https://www.fyber.com/) so they're literally in every step of advertising now. Buy side, sell side, and in between.\n\nOh yeah, and they report earnings tomorrow (Tuesday) after close. Look at similar ad-centered companies like GOOG and SNAP to get an idea of how APPS might do... just sayin'.\n\nFor you 🌈🐻s... their logo is a freakin' rainbow. So you should go long.\n\nNot financial advice. This is my first DD. Buy at your own risk.\n\n**TL;DR - GOOG do good, SNAP do good, APPS probably do good**",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/smshab/theres_an_apps_for_that_why_digital_turbine/",
    "score": 49,
    "author": "SECmydick",
    "created_utc": 1644246710,
    "num_comments": 54
  },  "soltcb": {
    "title": "600Gbit/s up to 28.8Tbit/s - welcome to the future (NOK)",
    "selftext": "Good evening to all BANGers and NOK enthusiasts.\nI found some interesting technical news and I think it’s a new record.\nCorrect me if I’m wrong.\nNOK has a processor built on 7nm and because of this chip this speed was possible.\n3, 2, 1 … „nok never moves“ … comments off 😉\nDoesn’t matter, the technology rocks. 🚀🚀🚀\n\n[record in fiber optic network](https://www-heise-de.translate.goog/amp/news/Rekord-im-Glasfasernetz-600-Gbit-s-ueber-eine-Farbe-und-781-km-uebertragen-6362176.html?_x_tr_sl=auto&amp;_x_tr_tl=en&amp;_x_tr_hl=en)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/soltcb/600gbits_up_to_288tbits_welcome_to_the_future_nok/",
    "score": 36,
    "author": "RealRagnarLotbrok",
    "created_utc": 1644435212,
    "num_comments": 17
  },  "so19al": {
    "title": "Why only retards are selling the (near) bottom on $FB and are about to get metacucked 🙊",
    "selftext": "I posted this in a thread with some baggie autist 🐻🌈 pumping the puts he bought too late, but it actually became a nice 🐂 case. So take those 🖍️🖍 out of your nose, and strap in for a treat.\n\n1. $50 billion in cash **after** their $19 billion buyback, and yes the Zucc cucked himself by cumming too early, but hol' up\n2. It has a P/E of 16, a 4:1 asset/liability ratio, 65% YoY **increase** in cash flow, and currently trades at 15x FCF. $AAPL, $MSFT, $AMZN, $GOOG, and $TSLA have a P/E of 25-188 (lol), higher debt ratios, lower margins (FB gross margin is 80%), and trade at 27-272x FCF (guess who's at 272)\n3. Weekly (and daily) RSI are the most oversold they've been since the post-IPO dump, and the weekly is curling to put in a bottom \n4. It bounced off the May 2018 and Feb 2020 high today, delicious\n5. The VWAP is $220.78, so easily in reach\n6. Option flows are primarily being driven by Jan 2023 calls being sold, but IV is also in the 83rd percentile, so expect those to be closed out as IV decreases\n7. The current level also shows a successful test of the -2.618 Fib retrace from the September 2021 dump, with the -3 at $201. For reference, it peaked at 3 Fibs on the nose from the March 2020 crash\n8. The weekly 200 &amp; monthly 50 MA sit right at $230, so closing successfully above that willtake it to $266 and eventually $290 to attempt a gap fill\n9. The aforementioned MAs just happen to be right above the 2018/2020 trend, at $228.56\n\nThis is a great spot to dip a toe in, with a stop below $200. If we get a weekly then monthly close over $230, the party is back on.\n\n**TL;DR:** The Metadump can easily become a Metapump if we clear $230 🚀🌕. If this works out, you can send me donations. If it craters, I'll obviously delete my rambling 😜\n\n**Bonus**: Zucc can buy SPOT &amp; PTON for $45 billion (Black Mirror, anyone?), and still have enough for a super-yacht bigger than Jeff Amazon's + 300 000 metric **fucktons** of cocaine to make these hoes dance. Oh and he'll get $5 billion in cash minus transaction costs from the acquisitions, and be back at $50 billion in cash in a year",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/so19al/why_only_retards_are_selling_the_near_bottom_on/",
    "score": 189,
    "author": "Liquicity",
    "created_utc": 1644371269,
    "num_comments": 299
  },  "ssdtet": {
    "title": "The fed will boost stocks, Russia won't invade, and you won't make any money regardless of what happens.",
    "selftext": "Edit: One of you degenerates reported me and I got a message from Reddit's mental health team at Reddit Care Resources lol. /Edit.\n\nThe fed will likely announce an emergency rate hike of basically nothing. Maybe 0.5%. This will signal to the world that Jpow still isn't going to do what it takes to deal with inflation and we're going to continue to not address the problems and that means the bull run continues. \n\nAdditionally, for some reason you all think Russia is going to invade Ukraine. This 99% won't happen. Putin is just mad because NATO said they wouldn't expand and then they farted in his face and expanded. He couldn't do anything about it for years because Russia's economy was in shambles. So now that he finally has Russia sorted out, he's showing force. \n\nNow then, you're all getting scared from watching the news and you can't form your own opinions about anything. This is why you won't make money on the fed meeting or Russia, regardless of the outcome.\n\nLet's say Russia invades Ukraine after the fed announces a 6% rate hike. Ok, then what? You're going to sit around for weeks and watch the market bottom and reverse only to scream that it still has lower to go? \n\nYou're still going to be holding cash 5 years from now when SPY goes to like 1000. Heck, you probably clicked on this very post because you want some random redditor to give you an opinion because you can't come up with one on your own\n\nIMO, Russia does not invade Ukraine. Fed does not hike interest rates as much as they need to. We see SPY 500 by this year.\n\n\nNote: do not tag me for some dumb ban bet because I said \"SPY 500 by this year.\" I'm not making a bet, I'm making an opinion. Ban bets are for people who don't have any money left to bet in the markets, so they gamble their time on this sub like those squid monsters playing dice in The Pirates of the Caribbean movie.\n\nPositions: SPY, AMD, GOOG.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ssdtet/the_fed_will_boost_stocks_russia_wont_invade_and/",
    "score": 2659,
    "author": "BeardlessPete",
    "created_utc": 1644854043,
    "num_comments": 445
  },  "ss30fa": {
    "title": "How’s 2022 going with everyone? Here is mine a nutshell! And why I’ll go all in $NVDA",
    "selftext": "Back in mid December 2021 after the fed meeting the market had a rally, all my heavey tech based positions (all in blue chip tech, with no investments in ballooned uniform companies) recovered from the minor dip of November caused by omicron, from the meeting my takeaway was that the market will get oversold early 2022. I’ve then asked advice from a friend a trust with over 30 years of trading and his feedback was that worse case scenario is a 10-15% correction early 2022. I really wanted to liquidate and sit on cash to buy the real dip and avoid loosing my 20% gain from 2021. In the matter of 2 weeks early January I lost that 20% gain and lost 15% of my overall portfolio, out of dispersion I liquidated 30% of my overall positions and started betting on semis( due to the shortages a real opportunity is here) prior to their earnings with the 30% of my overall portfolio, this then did not go as planned and here’s how it went. \n\nASML: lost 3 % on the 30% which is roughly 1.5% gain of overall portfolio\nAMD: Made 13% on 20% of overall portfolio, roughly 2.5% \nGOOG: thought would have a solid quarter so 10% of portfolio was invested sold at 9% uptrend with .9% gain \nFB: with 13.5 % of overall portfolio invested through buying its dips took a hit at earnings, devastating to my overall portfolio with a 6% net loss on overall portfolio. \nQCOMM: invested 10% of portfolio and lost 2% post earnings. \n\nHere’s where shit starts ( continued on earnings plays ) \n\nI shorted Zillow and it rallied.. (shorted more at peak of rally) \nbought CLF and it tanked..\n\nNext moves: \n\nNVDA 30% of overall portfolio\n\nThis is not financial advice, but to get insight from fellas who want to make money. \n\nDisclaimer: I’ll try to reply to all serious comments and will ignore shit posts",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ss30fa/hows_2022_going_with_everyone_here_is_mine_a/",
    "score": 40,
    "author": "Comprehensive_Two696",
    "created_utc": 1644816921,
    "num_comments": 63
  },  "suyuqx": {
    "title": "Remember kids: The war will be over tomorrow",
    "selftext": "This succubus of market only exists to lull you into bear traps and bull traps.  This market is more bipolar than your ex.\n\nWho are we kidding. you don't have an ex. you haven't left your mother's basement. This market is more bipolar than your imaginary ex.\n\nWe expect a short bull run spurt in the late evening tomorrow as GOOG needs to be above 2700 and Amazon needs to be 3180.\n\nWhen they said you will get sucked, this is not what you had in mind, did you?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/suyuqx/remember_kids_the_war_will_be_over_tomorrow/",
    "score": 29,
    "author": "InternetOfficer",
    "created_utc": 1645130745,
    "num_comments": 9
  },  "suahfn": {
    "title": "We are about to become Star Men.",
    "selftext": "The rockets are full of jet fuel and Adderall and if you aren't strapped in yet, you need to be.\n\nThe two main bear arguments are slowly dying: (1) that Russia invades and (2) Powell is going to jack interest rates and crash the market.\n\nHere's the thing. Russia is already withdrawing from the border and Powell won't increase rates seriously until wayyy into the future. Additionally, covid has been cancelled and we're opening back up, which is a super elevating factor.\n\nSPY always fills the gap, and right now we have a straight shot to 479 and beyond. Now is the time to be buying.\n\nNow yes, eventually the bull market must end. Either Jpow will not act on interest rates as much as he should and we see hyper inflation, or he does his job and boosts interest rates to the point we get a recession. But that won't happen until much later in the year. For now, we are 100% going to moon.\n\nThe play is this: money in the market for the next few months, spy is your best bet because it has a big gap to fill and it's a safe bet. Then, lock in your gains and wait for the crash. You can buy puts on the way down OR have cash. Either way, you'll be in a good place when the new market cycle starts. The market must eventually crash because the fed has locked us into a lose-lose situation, but if you're betting on it happening in March you're going to miss out.\n\nDisclaimer and positions: I could be wrong about all of this. The stock market is nothing more than people making educated bets. I think these bets are low risk and we will moon. Positions in order of size SPY, GOOG, PLTR. All shares.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/suahfn/we_are_about_to_become_star_men/",
    "score": 14,
    "author": "BeardlessPete",
    "created_utc": 1645056272,
    "num_comments": 34
  },  "svj6ta": {
    "title": "Alex Karp May Look Like A 🤡, But He Is Actually Just Dumb: How To Know When PLTR Will 🚀🚀🚀😎 And When To Buy In.",
    "selftext": "Alex Karp shit the bed. There is no denying it and no way to sugar coat that truth. Anyone who believed in the larger mission of Palantir or the future of AI got burned badly by the clown car of monkeys that are disguised as PLTR executives.\n\nKarp had an army of loyal investors just like Elon Musk and Tesla. That is more than enough for any CEO to patiently build an amazing company and transform the future.\n\nInstead of doing that, Karp voted to give himself 100% of revenue as a bonus and dumped that steaming pile of dilution all over retail supporters who were holding the stock. Karp has all the voting rights, so of course he voted to give all the PLTR growth to himself.\n\nNo one trusts the executive team at this point, and bagholders won’t see stock price appreciation until PLTR leadership resigns or does something drastic.  Why should anyone hold this stock long term when insiders dump it at the first chance they get? \n\nThe only thing Karp can do now, short of resignation, is show investors that he actually likes the company - and the stock - by buying a few shares. Karp could take $200,000,000 of the $500,000,000 he made through dilution and buy the dip on his own company rather than wait to be issued shares for free.\n\nKarp has all the voting power, so of course he can always just vote himself infinity shares. This is why the PLTR executives are a clown car of retarded monkeys when it comes to building the future. If anyone at that company had one ounce of foresight, they would realize that looting the shareholders is a losing strategy long term. Karp may have won round 1, but shareholders will not be lured in so easily in future iterations of the bagholder game.\n\nIf Karp bought the dip at these high prices, it would show current bagholders that there is a floor to the share price and, at the very least, that Karp is sharing the pain alongside his investors. \n\nIn fact, this is the exact strategy Elon Musk used with Tesla. He didn’t dump shares the moment his options vested. Elon took out loans to exercise his options and held those shares for years. Elon waited until every retail investor who believed in the company during the tough times had 12 months to cash out at 10X their investment before he took profits.\n\nThe fact that Elon Musk was willing to share the pain along side the retail shareholders meant that he really did believe in the long term future of his company and it wasn't just a get-rich swindle. Yes, it sucked to see Tesla dip on good news, but holding was easy because I knew that Elon lost more of his wealth as a percent than me every time Tesla stock crashed.\n\nJust be real: Karp doesn’t need $500,000,000 cash on top of his annual cash salary of $3,000,000 on top of his insane share compensation. He is just a greedy 🤡.\n\nOther than an extraordinary move like the one I outlined above, there is nothing that will really restore investor confidence. As things stand, Karp said he would not stop diluting at a rate of at least 10% a year...that means PLTR's 35% growth ends up being 25% growth for shareholders after Karp takes his cut. \n\nI totally believe he will invent another reason to vote himself 100% of revenue as well. That means you are getting less than half of the CAGR that is currently offered by GOOG: a company that is also in the AI game, is already massively profitable, and has an executive team that has proven they can grow wealthy without burning their shareholders.\n\nSo, how do I make money off of this dumpster fire of a company known as Palantir? Easy: wait until PLTR hits $2/share. At this point, Karp will have to stop the dilution or risk getting delisted. Once Karp makes a u-turn, then PLTR will be investable.\n\nTL;DR\n\nIf AI actually worked, PLTR would have shorted itself.\n\nP.S.\n\nI made over 100% on this stock by buying at $9/share, selling a few covered calls, and cashing out  at $18/share when Karp said on CNBC that he would not stop the dilution and the share price would have to go up in spite of the additional shares. I am writing this DD for all the current bagholders who think that a company that endlessly dilutes their investors is a long term opportunity.\n\n&amp;#x200B;\n\n[https://imgur.com/a/MULpP8I](https://imgur.com/a/MULpP8I)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/svj6ta/alex_karp_may_look_like_a_but_he_is_actually_just/",
    "score": 166,
    "author": "GME_200K",
    "created_utc": 1645194308,
    "num_comments": 91
  },  "szp6dd": {
    "title": "We are in Tech Bubble 2.0, but it's actually the everything bubble",
    "selftext": "It is probably evident that there has been slaughter left and right for meme stocks, tech, and anything growth related. I am not here to rant on why tesla is obviously over-valued and how fundamentals don't mean shit to some of these stocks (I have Tesla calls, don't punish me).  \n\n\n#  1 Timeline\n\nAnytime between now and the market crashes, cool, isn't that what every stupid bear ever said. Let's just buy a shit ton of leaps and pray. No. It is much easier than that. The play i am trying to explain is a 6 month to 1 year timeframe. This gives the market enough time to slowly bleed and adjust to interest rate hikes, war nonsense, inflation, and balance sheet reduction.  \n\n\n# 2 Catalysts\n\n Everyone says \"But stonks only go up\", \"These are down %50-%70 from ATH\". I am not looking at companies like $PYPL, $SQ which have fundamentals and make money. I am looking at companies that have no free cash flow, bad technicals, and make no money. Some of these have already came down a lot, but they have a long ways to go. With interest rate hikes and balance sheet reduction it will be extremely difficult for overvalued companies to get bonds and loans to increase their production or operations. How might this affect bigger companies that are not neccessarily overvalued, rather, blue chip growth stocks like GOOG and AAPL. They will certainly go down in the next 6 months to 1 year but will recover and hit more ATH in the near future. So stop buying puts on big tech and wondering why they won't react as bad as some others.   \n\n\n# 3 The Play\n\n**Lucid Motors, Rivian, Draft Kings, Beyond Meat are all trash can water and belong behind Wendy's with the rest of you retards buying OTM 0DTE on margin**  \n\n\nHow the hell is LCID a 20 billion dollar company, Rivian twice that size, and how is Beyond Meat still a public company.   \n\n\nTo the people who say they made bank 2020-2021 on these, congrats your calls printed but we are moving on with this rotation. There will not be anymore meme relevance or squeezes for these stocks. Look at how much they have already came down from ATH. There is so much more room to go down, it is obvious these can EASILY decrease %50 more. Remember when [Pets.com](https://Pets.com) was public and going crazy in 1999? Yeah it got delisted after the first bubble pop. THIS IS EXACLTY what is going to happen to some of these companies this year, and people cannot fathom how it will happen, because it will happen when we are not ready for it  \n\n\n# 4 The bubble\n\n It is clear stocks are in a massive bubble based on their Price to Sale (P/S valuation). \n\nWarren Buffett  stated that his favorite means of valuing stock was the stock market capitalization to GDP ratio.\n\nBelow is a chart for this metric. As you can see, the stock market today is as overvalued relative to the economy as it was at the peak of the 1999 Tech Mania.  \n\n\nhttps://preview.redd.it/k0pvdtigpmj81.png?width=460&amp;format=png&amp;auto=webp&amp;s=376c74db877985f3878fab9ad2081981abc07816\n\n So stocks are overvalued based on the most reliable corporate data point (revenues) and they are also overvalued relative to the economy. Scratch that, they're not overvalued... they're **trading at 1999-Tech Bubble insanity levels**. \n\nThis time the FED has created a **bubble in everything**. A \"risk-free rate\" of return against which ALL risk assets are valued. \n\n&amp;#x200B;\n\nComparing to 1999 tech bubble, 2008 housing market bubble, this will be considered the 2022 Digitial Currency/EV bubble. Look at the 10-20 year charts for any automotive company. It is not pretty. So what makes Rivian and LCID worth more than GM or Toyota? Nothing, since its a bubble. I will rule out Tesla on this one since we know damn well they make money, have an incredible CEO, and produce something tangible unlike these others. Tesla is still overvalued and it will go down with the digital currency/ev crash, but most likely not as hard as other competitors.   \n\n\n# 5 Short Bull thesis counterargument\n\n*\"What if it takes 3 more years to crash these sectors? Look at Tesla in 2016, 2017, 2018 retard, you thought it was overvalued then, look how high it is now.\"*   \nGood point, but that's what a bubble is, and the government allowed companies to become overvalued by constantly printing money and rising inflation since before the pandemic so stocks could only go up and create this bubble we are currently in.   \n\n\n*\"How can you be so sure these will keep dropping?\"*  \nA stock can never hit 0 but can become pennies. Look at WISH, CLOV, and those aren't even penny stocks yet, or delisted, but a lot lower from what their overvalued price was WITHOUT interest rate hikes, and balance sheet reduction. We can be sure many of these will be delisted or go to single digits. I will explain which ones below  \n\n\n6 Positions  \nMostly playing monthly to year puts to reduce Theta decay and try to let them expire when the market will most likely feel the change the most. Trying to not go so far OTM in case we see more short-term bull runs, as often these occur in bear markets as well. Tesla is more of a gamble since 250 seems incredibly unlikely, but so did most of the stocks in 2000 (DELL $60 to $2)  \n\n\n**4-6 months out:**\n\nRIVN June 17 2022 40P  \nLCID June 17 2022 20P  \nBYND June 17 40P\n\n**Longer dates**  \n\n\nLCID Jan 20 2023 10P, 12.5P   \nLICD Jan 19 2024 10P  \nRIVN Jan 20 2023 30P  \nRIVN Jan 19 2024 30P  \nTSLA Jan 19 2024 250P  \nBYND Jan 20 2023, 30P",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/szp6dd/we_are_in_tech_bubble_20_but_its_actually_the/",
    "score": 1059,
    "author": "BigTechEqualsValue",
    "created_utc": 1645643182,
    "num_comments": 295
  },  "szjvw8": {
    "title": "GOOG split",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/szjvw8/goog_split/",
    "score": 1,
    "author": "mightybeanslover",
    "created_utc": 1645629514,
    "num_comments": 1
  },  "t1czqv": {
    "title": "GOOGLE free money glitch via a hidden symbol",
    "selftext": "I was researching and performing technical analysis yesterday mroning and came across a hidden symbol for Google.\n\nusually when people search for Google they type GOOG in ticker box. But did you know that Google has one more Symbol? GOOGL?\n\nyes, with extra L! Don't believe me? Type it in your ticker box and find out. \n\nWhat will blow your mind is that both GOOG and GOOGL always moves in Sync. If one goes up, the other goes up as well. Always!\n\nSo what I plan to do is to Short GOOG and Long GOOGL at the same exact price. When they have reached peak I will sell GOOGL and when they are bottom I will buy GOOG.\n\n\nUnfortunately my account got illegally shut down by my broker due to Martin (my name is not even Martin, lol)  and I have applied for a new one at a more honest broker. Once I get the new account, I will try it out and let you know how it goes.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/t1czqv/google_free_money_glitch_via_a_hidden_symbol/",
    "score": 28,
    "author": "InternetOfficer",
    "created_utc": 1645819236,
    "num_comments": 39
  },  "t1la82": {
    "title": "Short GOOG, subpar product. Tried to use voice search for \"ghost of Kiev.\"",
    "selftext": "",
    "url": "https://i.redd.it/5upp39nt63k81.jpg",
    "score": 0,
    "author": "basskev",
    "created_utc": 1645841689,
    "num_comments": 7
  },  "t5841q": {
    "title": "Fuck your Calls. Fuck your puts",
    "selftext": "First of all, if nothing yields more than inflation, what do you do? You sell calls and puts. That's what institutions are doing.\n\nAMZN has been hedged to 3450-3075 for more than a year. Institutions are selling calls and also selling puts. Ever noticed that stocks rally and crash but return to median value on Fri expiry?\n\nThis is called 'Pinning'.\n\nMost of the stocks including TSLA, AMZN, GOOG are pinned. When nothing else returns more than 7%, institutions resort to pinning and selling calls/puts.\n\nBears and bulls are getting fucked at the same time.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/t5841q/fuck_your_calls_fuck_your_puts/",
    "score": 546,
    "author": "InternetOfficer",
    "created_utc": 1646249533,
    "num_comments": 173
  },  "t5f7dg": {
    "title": "Russia will exempt IT companies from income tax for 3 years, employees get preferential mortgages and deferment from the army",
    "selftext": "From a Russian news media outlet's Telegram channel, translated by google translate. Russian efforts to help combat sanctions include:\n\n\"New measures are being introduced to support the Russian economy. In particular, IT companies will be exempted from income tax for 3 years, and employees will be provided with preferential mortgages and deferment from the army.\"\n\n&amp;#x200B;\n\n[screen cap](https://preview.redd.it/ji2ucwxmi2l81.png?width=541&amp;format=png&amp;auto=webp&amp;s=b53ba8f42308cbf753d8293148d9c4a9d2ab7f27)\n\n&amp;#x200B;\n\nScreen shotted from [https://t-me.translate.goog/s/yamal\\_reg?\\_x\\_tr\\_sl=ru&amp;\\_x\\_tr\\_tl=en&amp;\\_x\\_tr\\_hl=en&amp;\\_x\\_tr\\_pto=op,sc](https://t-me.translate.goog/s/yamal_reg?_x_tr_sl=ru&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=op,sc)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/t5f7dg/russia_will_exempt_it_companies_from_income_tax/",
    "score": 2148,
    "author": "aausch",
    "created_utc": 1646269484,
    "num_comments": 464
  },  "tpmhic": {
    "title": "Palantir X Google Partnership 🤫🤫🤫$PLTR $GOOG",
    "selftext": "",
    "url": "https://i.redd.it/kuig86125yp81.jpg",
    "score": 1,
    "author": "Tonyx90x",
    "created_utc": 1648395648,
    "num_comments": 2
  },  "tpe8l8": {
    "title": "Russian oligarch who owns Spartak Moscow claims that he lost 99% of his fortune",
    "selftext": "From the name \"**Leonid Fedun\",**  to his haircut, to his 99% loss -- this man is wsb material: [https://www-gsp-ro.translate.goog/gsp-special/stiri-extrasport/leonid-fedun-spartak-moscova-pierdere-avere-658877.html?\\_x\\_tr\\_sl=auto&amp;\\_x\\_tr\\_tl=en&amp;\\_x\\_tr\\_hl=en&amp;\\_x\\_tr\\_pto=wapp](https://www-gsp-ro.translate.goog/gsp-special/stiri-extrasport/leonid-fedun-spartak-moscova-pierdere-avere-658877.html?_x_tr_sl=auto&amp;_x_tr_tl=en&amp;_x_tr_hl=en&amp;_x_tr_pto=wapp)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/tpe8l8/russian_oligarch_who_owns_spartak_moscow_claims/",
    "score": 411,
    "author": "actuallyhim",
    "created_utc": 1648362957,
    "num_comments": 111
  },  "tquy1y": {
    "title": "Justice Department backs antitrust bill targeting Apple, Amazon, Google",
    "selftext": "WASHINGTON — The Justice Department Monday endorsed legislation forbidding large digital platforms such as Amazon and Google from favoring their own products and services over competitors’, marking the Biden administration’s first full-throated support of the antitrust measure.\n\n“The Department views the rise of dominant platforms as presenting a threat to open markets and competition, with risks for consumers, businesses, innovation, resiliency, global competitiveness, and our democracy,” says a letter to bipartisan leaders of the Senate Judiciary Committee, signed by Peter Hyun, the Justice Department’s acting assistant attorney general for legislative affairs.\n\nThe letter, obtained by The Wall Street Journal, expresses support for the American Innovation and Choice Online Act, which the Senate’s judiciary panel approved in January in a bipartisan vote, as well as similar legislation moving through the House.  \n\nAmazon.com Inc. AMZN, +2.56%,  Alphabet Inc.’s GOOGL, -0.15%   GOOG, +0.30% Google, Apple Inc.  AAPL, +0.50% and others oppose the proposed legislation, saying it would make it harder to offer popular services. The bills’ opponents also say it is fair for e-marketplaces, search engines and app stores to profit off their creations’ popularity.\n\nThe department’s letter throws its weight behind a different view: that the platforms’ dominant position gives them unchecked power to influence the fate of other businesses, and that restricting the platforms’ conduct would carry significant benefits.\n\n“Discriminatory conduct by dominant platforms can sap the rewards from other innovators and entrepreneurs, reducing the incentives for entrepreneurship and innovation,” the letter says.\n\n[Read more](https://www.wsj.com/articles/doj-backs-antitrust-bill-targeting-amazon-google-apple-11648519385?mod=mktw&amp;mod=article_inline&amp;adobe_mc=MCMID%3D06728681253105368730235018188473878888%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1648541656)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/tquy1y/justice_department_backs_antitrust_bill_targeting/",
    "score": 49,
    "author": "MoonrakerRocket",
    "created_utc": 1648541693,
    "num_comments": 11
  },  "tvfy39": {
    "title": "After losing 22k earlier this year I’m thinking about putting my last 11k into both $AMZN and $GOOG option leaps because of the stock splits that are coming up. What are y’all thoughts?? Would it be dumb doing this? I really believe in both companies for the long term.",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/tvfy39/after_losing_22k_earlier_this_year_im_thinking/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1649010246,
    "num_comments": 1
  },  "tw2gv5": {
    "title": "GOOG / GOOGL",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/tw2gv5/goog_googl/",
    "score": 0,
    "author": "vss_getdeals",
    "created_utc": 1649080139,
    "num_comments": 2
  },  "tzc06j": {
    "title": "GOOG JAN 20 2023 C @ 2850",
    "selftext": "",
    "url": "https://i.redd.it/41io7aqj2ds81.jpg",
    "score": 49,
    "author": "usvientrepreneur",
    "created_utc": 1649448104,
    "num_comments": 11
  },  "u26d5z": {
    "title": "Where One Falls, Another Rises. DWAC To The Future - The Information Bubble Of A Lifetime",
    "selftext": "&amp;#x200B;\n\n# Not financial advice. Manage risk.\n\nGoing to do another full DD since the last one I did was in December and we've learned a lot since then to say the very least\n\nIf you're going to click off or say something because of FUD I encourage you to read the FUD section first before responding to save us all some time of reading your old debunked information.\n\n# The Basics\n\nTrump Media and Technology Group (TMTG) is a company aimed at\n\n* Social Media (like Facebook and Twitter etc.) - TruthSocial\n* Streaming Services (like Netflix, Hulu, Disney+, and Discovery+ etc.) - TMTG+\n* Alternative news (like Fox, OANN, newsmax etc.) - MxM app (Don  junior's new app, merger unconfirmed)\n* Possibly other general webservices (like Stripe, Amazon Web Services, etc.), not going to talk much about this in this DD, something to watch for in the future. See agreement with Rumble\n\nAgreement with Rumble (~~32~~  45m+) users for a youtube alternative and hosting services for Truthsocial etc. and it is speculated there may be other aspects of the company.\n\n# SPAC Structure\n\n$DWAC is in a definitive merger agreement with TMTG to take it public. After the merger is complete DWAC shares will be worth roughly 37.21 M / 193.4M (shares post merger) **\\~19.2% (dilution factor of about 5.2 or around 80.8% dilution)** of the company. This means currently at \\~$48 a share the current marketcap is priced in at \\~9.6B . Shares will automatically be converted to the stock ticker symbol $TMTG.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9ej6aby395t81.jpg?width=729&amp;format=pjpg&amp;auto=webp&amp;s=7736963bc0de81800eff4a846aa61929a8fa8a64\n\nThe PIPE funding is the largest in history and will provide them with about $1B plus $300M from DWAC's trust. We'll talk more about the PIPE and potential investors later\n\n# Basic Sector Understanding\n\nCompared to its competitors Truthsocial has massive upside potential. For starters, TWTR IPO'd with zero profit for a marketcap, adjusted for inflation, of 30-40B . From our math from before, this translates into a \\~3x-5x the current share price of \\~$48, $162-216 a share.\n\nNow let's take a look at the competitors\n\nIn October 2021 right before the TMTG announcement\n\nFB Marketcap: 910B\n\nTWTR Marketcap: 50B\n\nPINS Marketcap: 34B\n\nSNAP Marketcap: 85B\n\nNFLX Marketcap: 295B\n\nPresent day\n\nFB Marketcap: 528B\n\nTWTR Marketcap: 26B\n\nPINS Marketcap: 14.5B\n\nSNAP: 46B\n\nNFLX 150B\n\nThis translates into\n\nFB: -42%\n\nTWTR: -52%\n\nPINS: -57%\n\nSNAP: -54%\n\nNFLX - 49%\n\nCompare this to the Nasdaq\n\nQQQ only -11.5% since Oct 20th, 2021\n\nWhat this means is these companies should of only collectively lost\n\nFB: 105B; TWTR: 6B; PINS: 4B; SNAP: 10B; NFLX: 34B\n\nInstead they have lost\n\nFB: 382B; TWTR: 24B; PINS 20B; SNAP: 39B; NFLX 145B\n\nThis a net difference of\n\nFB: 277B; TWTR: 18B; PINS: 16B; SNAP: 29B; NFLX: 111B\n\nFor a grand total of $451B loss in only just under 5 months.\n\nWhere is this money going?\n\nDWAC + 14B\n\nAAPL + 105B at a time when it should be tracking -11.5% benchmark (loss 280B) so a net offset +385B\n\nThere's a lot of nuance to this because there are more companies that are not publicly traded or hard to track because they are apart of GOOG or DIS etc. (to be honest even the AAPL is a hard one to compare)\n\nI'm guessing about $500-600B in related market competitors marketcap has disappeared in net ahead of their indexes since the threat of TMTG's competition has presented itself.\n\nMy latest reasoning for a lag in this flow of capital is liquidity issues and requirements that this smart money cannot dump into DWAC. It's too small a float, even post merger. It's also probably outside of their requirements and perceived risk tolerance since it's a SPAC and hasn't filed an S4 yet.\n\n# Comparing The Fundamentals To Their Sector Competitors\n\nI'm going to start with TMTG+ streaming services **(headed by the producer of America's Got Talent and Deal or No Deal)** since it's a much more simplistic model to users paying the company directly for its services.\n\nNetflix - 214 Million Paid Subscribers (this one has lost some serious marketcap since my last DD, comparable to above numbers for the other sector competitors)\n\nDisney+ - 118 Million Paid Subscribers\n\nHulu - 44 Million Paid Subscribers\n\nDiscovery+ - 15 Million Paid subscribers\n\nNetflix has 167B marketcap compared to 222 Million Paid Subscribes. This translates to about $752 in market cap per subscriber.\n\nLet's say TMTG+ achieves only 23M subscribers with only $600 per sub in marketcap . This alone would justify the current share price based off 14B marketcap.\n\nLet's say TMTG+ achieves only 50M subscribers at only $600 per sub in marketcap. This alone would justify a \\~2x increase in the share price based on a 30B marketcap.\n\nTranslating this aspect of the business you can roughly translate **every 10M TMTG+ subs to an additional $31 in share price.**\n\n&amp;#x200B;\n\nLet's move forward to the Social Media aspect\n\nFacebook - Dec 2021 - 2.89 B Monthly Active Users , 917 B marketcap, $317 per monthly user in marketcap. - Mar 2022 -  2.89 B Monthly Active Users , 582 B marketcap, $182 per monthly user in marketcap.\n\nYoutube - 2 B Monthly Active Users (MAU), 500B marketcap, $250 per monthly user in marketcap.\n\nTiktok \\~1B users, \\~400B marketcap, \\~$400/user\n\nSnapchat \\~347MAU \\~ 58B marketcap \\~ $167/user (down from 264 since Dec)\n\nTwitter - 330M MAU, $30.5B marketcap, \\~$92  user marketcap. (down from 100 since Dec)\n\nYou can see that some companies are more valuable than others because of success of monetization. some companies are valued a lot higher per user. Giving these a market cap weighted average is about \\~$275 users/ marketcap (give or take a bit, the markets have been volatile)\n\nI'm going to say TS, given its much higher APRU is going to actually be above average on this list. I said 100 per user back in Dec but given the latest info I'll get into I'm going to put this at 193 for now\n\nThis would mean 100M users would translate into 19.3B in marketcap. So **for about 100M users you can add an additional $100 to the share price.**\n\nLet's talk about the news aspect of the business model.\n\nFox has a marketcap of 22.5B, lets say it achieves 25% of Fox's audience. That's an additional 5B in marketcap or **an additional $26 a share for every 25% of Fox's audience size from news. Or about $25 for every 500,000 viewers.** Also keep in mind Trump's rallies even now are getting a few million live viewers when you count all of his rallies across Rumble, Youtube, RSBN, OAN etc.\n\nDon Junior is bringing an app to market called MxM which is an aggregator app to compete with Apple and Google news it's getting independent funding and may merge with TMTG in the future. Do a quick search on that.\n\nWho knows what other business venture and revenue will be brought in.\n\n# Key Performance Indicators\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qb8ie84595t81.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=6f99d561af3dd32b979dfbadd759c1e60c3f9cbb\n\nHere's a chart of projected revenue from the corporate slide deck you can find the SEC filings\n\nThese numbers are understated to be over delivered, clearly.\n\nTS got 1.5B views in the first 24 hrs -Washington examiner (just on apple products, there are only 1.8B apple products.)\n\nFrom the user feedback on Truthsocial so far, it has been demonstrated that users with way less followers are getting way more engagement. Maybe even by a factor of 10x less followers getting 10 x more engagement. This is huge for ARPU (average revenue per user)\n\nTracking Trump's followers from people in the app suggests the App just hit 1 million users in the first month despite being in a highly limited access period where people are getting mostly wait listed. Trump has \\~700k followers using assumption that 70% of people are following Trump. Truth social is currently only available on the Apple App store and in the US for those on the waitlist. This should be opening very soon for web browser, android, and non-us as the infrastructure scales.\n\nExtrapolating this growth rate has been done in a few ways\n\nThe current linear growth rate is something like 20M/yr even in this limited period. Which is astounding\n\nHowever this rate has been increasing rapidly partly due to increase in infrastructure\n\nUsing a very aggressive approach (see the methodology in my post history)  Extrapolating Trump's Follower's Growth Report 3-21\n\n13262e\\^(0.175\\*365.25)\n\nIt says Truth would surpass Facebook in only 71 Days. (assuming 100% following of users.. obviously less days when you use the 70% following Trump assumptions)\n\nLets be a little more conservative and use the polynomial\n\n671.52x\\^2+7553.7x+9074.4\n\nThat says\n\n92M per a year, and that's with obvious near increases back to reverse of rate comparisons saying this will be even higher in the near term.\n\nUsing the 80% assumption this is 131M per year, a number which should easily increase before then (a new faster equation)\n\nAlso noting that this is for the first year. It would increase to a rate of 363M/yr by the second. 814M/yr by the third. And surpass Facebook around the Fourth or Fifth\n\nOf course we'll need more time and data to come in to build further confidence in these models, confidence and data which I believe will shock the markets and potentially serve as a major catalyst.\n\nThe big opening was said to be before end of Q1 so I'm guessing that will be a big uptick in growth allowability in the next few weeks\n\nFor some comparisons\n\nPath to 1M users\n\nTumblr 27 months\n\nTwitter 24 months\n\nPinterest 20 months\n\nFacebook 10 months\n\nDropbox 7 months\n\nSpotify 5 months\n\nInstagram 3 months\n\nTruthsocial 1 month\n\nI have not yet been able to find any service or platform to exceed these rate assuming they weren't using existing infrastructure such as AWS, which TS is not. It using Rumble's infrastructure\n\n# Lets talk about Profit Margins\n\nTruthsocial is actually much likelier to have a much higher profit margin than Twitter because of severely reduced operating expenses, and why TMTG will probably be trading at more comparable ratios to Facebook not because of success of monetization but because of success of low operating expenses.\n\nFirst let me give you a peak into the burning dumpster fire that is Twitter's balance sheet\n\nStarting on page 43 of Twitter's Annual Report from 2020 [https://s22.q4cdn.com/826641620/files/doc\\_financials/2020/ar/FiscalYR2020\\_Twitter\\_Annual\\_Report.pdf](https://s22.q4cdn.com/826641620/files/doc_financials/2020/ar/FiscalYR2020_Twitter_Annual_Report.pdf)\n\nWe can see Twitter pulled in 3.2 B from Advertising Services, 508M from Data licensing for a total of 3.7B in revenue\n\n1.37B Cost revenue\n\n873M in 'Research and development'\n\n888M in 'Sales and marketing'\n\n562M in 'general and administrative'\n\nTwitter netted negative 1.1B in profit after setting aside 1B for taxes.\n\nLet's break this down again\n\nTwitter pulled in $3.7B but twitter spent\n\n37% on cost of revenue: servers, buildings, upkeep etc.\n\n23% on Research and development: software engineers, sociologists, artists, focus groups (market research) (I believe moderators is in here as well)\n\n24% on Sales and marketing: sales employees for ads and marketing for userbase and available ad space.\n\n15% of general and administrative: executives, legal, finance, info tech, hr, consulting, moderators (in both categories probably), customer service etc.\n\n3% on interest and other: interest on debt financing, operations etc.\n\n29% on taxes.\n\nYes these numbers add to 131% of revenue or in other words a 31% net income loss.\n\nWhy is Twitter so expensive to run, why is this dumpster fire losing all of this money?\n\nLets go back in time to Twitter in 2011-2013 - Here's the same report from that time period. [https://s22.q4cdn.com/826641620/files/doc\\_financials/ar/Twitter-Inc-2013-Annual-Report.pdf](https://s22.q4cdn.com/826641620/files/doc_financials/ar/Twitter-Inc-2013-Annual-Report.pdf)\n\nPage 57\n\nGoing to compare to Twitters Monthly active users (MAU) [https://www.statista.com/statistics/282087/number-of-monthly-active-twitter-users/#:\\~:text=As%20of%20the%20first%20quarter,daily%20active%20users%20(mDAU)](https://www.statista.com/statistics/282087/number-of-monthly-active-twitter-users/#:~:text=As%20of%20the%20first%20quarter,daily%20active%20users%20(mDAU)).\n\n2013: \\~225M monthly active users (MAU)\n\nCost of Revenue : 266 M (\\~330M inflation adjusted)\n\nResearch and Development.(R&amp;D): 593M (\\~740M inflation adjusted)Sales and Marketing 316M (\\~400M inflation adjusted)General and Administrative 124M (\\~160M inflation adjusted)\n\n2011: \\~100M MAU\n\nCost of Revenue: 62M (\\~85M inflation adjusted)\n\nR&amp;D: 80M (\\~110M inflation adjusted)\n\nSales and marketing 26M (\\~36M inflation adjusted)\n\nGeneral and administrative 233M (\\~310M inflation adjusted)\n\nOk so lets do some ratios with inflation adjusted numbers compared to users\n\n2020: \\~330M MAU\n\nCost of revenue: \\~$4.15 per monthly active user\n\nR&amp;D: \\~$2.65 per monthly active user\n\nSales and marketing: $2.7 per monthly active user\n\nGeneral and admin: $1.7 per monthly active user\n\n2013: \\~225M monthly active users (MAU) (numbers below adjusted for inflation)\n\nCost of revenue: \\~$1.47 per monthly active user\n\nR&amp;D: \\~$3.29 per monthly active user\n\nSales and marketing: \\~$1.78 per monthly active user\n\nGeneral and admin: \\~$0.71 per monthly active user\n\n2011: \\~100M monthly active users (MAU) (numbers below adjusted for inflation)\n\nCost of revenue: \\~$0.85 per monthly active user\n\nR&amp;D: \\~$1.10 per monthly active user\n\nSales and marketing: \\~$0.36 per monthly active user\n\nGeneral and admin: \\~$0.85 per monthly active user\n\nSo what's alarming about this trend is that twitter is becoming very expensive to operate on a per MAU basis.\n\nLet's recap\n\nCost of revenue went from $0.85 in 2011 per user to $4.15/user in 2020 (inflation adjusted) **388% increase**\n\nR&amp;D went from $1.10/user in 2011 to $2.65/user in 2020 (inflation adjusted) **141% increase**\n\nSales and marketing went from $0.36/user in 2011 to $2.70/user in 2020 (inflation adjusted) **650% increase**\n\nAnd general and admin from $0.85/user in 2011 to $1.70/user in 2020 (inflation adjusted) **100% increase**\n\nLet's see how Facebook does from their annual reports [https://d18rn0p25nwr6d.cloudfront.net/CIK-0001326801/14039b47-2e2f-4054-9dc5-71bcc7cf01ce.pdf](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001326801/14039b47-2e2f-4054-9dc5-71bcc7cf01ce.pdf)\n\nPage 64\n\n2021: FB 2.91B MAU (2,910M monthly active users)\n\n(CoR) Cost of revenue: 22.6B - $7.76/user\n\nR&amp;D: 24.6B - $8.45/user\n\n(M&amp;S) Marketing and sales: 14B - $4.81/user\n\n(G&amp;A) General and Admin: 9.8B - $3.37/user\n\nLet's compare to an earlier time [https://s21.q4cdn.com/399680738/files/doc\\_financials/annual\\_reports/FB\\_2012\\_10K.pdf](https://s21.q4cdn.com/399680738/files/doc_financials/annual_reports/FB_2012_10K.pdf)\n\nPage 58 and [https://www.businessofapps.com/data/facebook-statistics/](https://www.businessofapps.com/data/facebook-statistics/) (for MAU half way down)\n\n2012: \\~1B MAU (inflation adjusted)\n\nCoR: 1364M (\\~1730M) - \\~$1.73 per user\n\nR&amp;D: 1399M (\\~1800M) - \\~$1.80/user\n\nM&amp;S: 896M (\\~1150M) - \\~$1.15/user\n\nG&amp;A: 892M (\\~1140M) - \\~$1.14/user\n\n2010: \\~500M MAU\n\nCoR: 493M (\\~650M) - \\~$1.30/user\n\nR&amp;D: 144M (\\~154M) - \\~$0.31/user\n\nM&amp;S: 167M (\\~225M) - \\~$0.45/user\n\nG&amp;A: 138M (\\~190M) - $0.38/user\n\nAs you can see, much like twitter, Facebook also suffers from huge inflated costs over the years of running their business.\n\nI suspect this has a lot to do with financing of their servers through amortization payments.\n\nBut also trying to scale their business with the technology that was available 10+ years ago and not being able to change their business model because it was bad PR to fire off tens of thousands people and replace them with future technology, they've essentially been forced to grow with their existing business modeling scaling up which you can see results in worse and eventually negative margins.\n\nNow we are talking about a brand new company with no existing dogmatic or scalability issues\n\nThey have already touted using AI in place of manual moderation\n\nTheir infrastructure that is based by Rumble has been touting as being 8x cheaper than AWS, a huge expense on these legacy media companies.\n\nFacebook has 45,000 employees (1 employee for every \\~65,000 users)\n\nTwitter has 5,500 employees (1 employee for every \\~60,000 users)\n\nFacebook has much greater success of monetization than Twitter\n\nTruthsocial will likely have similar success of monetization like Twitter except it will have substantially higher margins than both via means of reduced expenditures (cheaper servers) and utilizing AI in place of many employees. This also brings down the cost of office space etc. with remote work and fewer headcount.\n\nThis is one of the things they fear more than even the political ramifications is becoming obsolete in superior utilization of technology which they have can kicked to avoid a PR nightmare.\n\nIt would be much harder and more expensive to program an AI to be biased towards political ideas instead of more hard set rules of logic. It would require constant upkeep to keep up with flip flopping rules and exemptions etc. An AI would be a much more solid long lasting algorithm if it was free from these ever changing agendas.\n\nIn other words being woke will be obsolete by superior unbiased artificial intelligence. Also selection of ad space being removed from political and PR expense etc. nonsense. The free market will bid up ad-space and engagement to increase naturally from a more exciting and free environment free from biased and expensive bureaucratic moderation and selection.\n\n# Lets Talk Share Price\n\nSo currently the markets are priced at \\~72 a share would would translate to something like\n\n40M TS users ($40) + 8M TMTG+ subs ($25) + 4% of Fox's audience ($4.16), \\~ $69\n\nYou can see this is a bit comical for what's being priced in for a someone who is as well known as DJT who had over 150M followers online and over 71M votes in his 2nd run for president. We've all seen the portfolio trackers and many others get banned off TWTR lately. Pelosi tracker is back up on Truthsocial already\n\nHere's a potential scenario\n\n300M TS users (\\~1/10th of facebook) ($300) + 25M TMTG+ subs ($77.5) + 50% Fox Audience ($52) = $429.5 and still have massive room for improvement\n\nMore scenarios\n\n600M TS users (\\~1/5th of facebook) ($600) + 40M TMTG+ subs ($124) + 50% Fox Audience ($52) = $776 a share and still have massive room for improvement\n\nA total blow out of just one of the aspects\n\n1B TS users (\\~1/3rd of facebook) ($1000) + 40M TMTG+ subs ($124)  + 100% Fox Audience ($104)  = **$1228 a share**\n\nAnother example\n\n300M TS users (\\~1/10th of facebook) ($300) + 60M TMTG+ subs ($186) + 100% Fox Audience ($104) ($52) = $590 and still have massive room for improvement\n\nImagine in these scenarios it will be trading for much more aggressive ratios **so**\n\n# DWAC 1000\n\nwith much additional upside after on fundamentals is not a mathematical challenge.\n\n1.5B TS users (\\~1/2 of facebook) ($1500) + 100M TMTG+ subs ($310)  + 100% Fox Audience ($104)  = \\~**$2000 a share**\n\n3B TS users (\\~1/2 of facebook) ($3000) + 100M TMTG+ subs ($310)  + 100% Fox Audience ($104)  = \\~**$3414 a share**\n\n3B TS users (\\~entire market) ($3000) + 250M (entire market) TMTG+ subs ($775)  + Above Fox Audience ($400)  = \\~**$4200 a share** along way to go to get there\n\n# Who else is bullish\n\nKevin O'Leary from shark tank has said this is \"going to work\" search of O'Leary DWAC.\n\nSpeculated Possible/Likely of the 36 PIPE investors to be disclosed (another catalyst): Lutnick, Thiel, Musk, Schnatter, Chamath, White, McMahon, Salman,, Steve Wynnn, Bernard Marcus, Roger Penske, Carln Icahn, Rex Tillerson, Lindell . More info about these people in my post history and why, at least in some cases like Lutnick, Musk, and Thiel there is a lot of info to suggest this is probably true\n\n# Short Interest and Gamma Ramp\n\nThere's been reported to be about 4-5M Shares shorted on this low 28.7M float. A recipe for disaster for shorts. Is also on the reghso FTD list\n\n\\~4M in SI and \\~1M in FTD. At least. It's also been hypothesized that the market markers are only holding \\~4-5M shares based on Liquidity Pool (LP) Theory Math (see post history) this would mean the Short to Liquidity Pool ratio is over 100%, reported SI is 13.4%, Days to Cover Ratio \\~2, basically no shares left to borrow (100% utilization), cost to borrow is \\~70% but has been seen usually above 100% and has gone as high as &gt;300% at some points.\n\nThere is massive gamma ramping in danger of happening on call options and float evaporation potential. I won't get into it more here and now, check post history and google search maxpain dwac\n\n# FUD\n\n**Addressing common FUD - Understanding actual risk and nonsensical Fear Uncertainty and Doubt**\n\nI know many reading this will get very emotional both long and short and will look for any reason to make this sound bigger or smaller or impossible or dumb. There's also many people who do not want this to happen for their own personal benefits. So here's some common things that are said and a general counter to it.\n\n**FUD:** \"People won't want to advertise there\"\n\n**Counter**: According to CNN facebook was never at risk of this. This rhetoric never had much grounds in reality\n\n&gt;Facebook generated $69.7 billion from advertising in 2019, more than 98% of its total revenue for the year. And most of those ad dollars don't come from companies like Starbucks ([SBUX](https://money.cnn.com/quote/quote.html?symb=SBUX&amp;source=story_quote_link)) and Coca Cola so much as the sprawling list of small and medium-sized businesses who use Facebook to attract customers and build their brands.when COO Sheryl Sandberg said the top 100 advertisers represented \"less than 20%\" of total ad revenue.📷The Facebook ad boycott is starting to rattle investors\"Facebook has an enormous number of advertiser clients,\" said Nicole Perrin, an analyst at eMarketer. \"They're definitely pretty reliant on the long tail of small business advertisers.\"\n\n&amp;#x200B;\n\n&gt;Even as Facebook confronts by far the largest advertiser boycott in its history, the sheer number of advertisers on its platform may insulate the company from too much financial fallout. At the same time, it remains an open question whether many big and small advertisers can afford to stay away from the powerful platform it built for very long\n\n&amp;#x200B;\n\n&gt;\"I think it's relatively unlikely that small businesses \\[and\\] small brands will join the boycott, because they're the ones most reliant on Facebook for access to their customers,\" Perrin said.\n\nCNN's website  slash 2020/06/30/tech/facebook-ad-business-boycott/index.html\n\n**Counter:** There will be direct monetization outside of ads (see TMTG+ section) also Companies will have to go where people are advertising with their attention and dollars. It's easy for companies to dissociate from where their ads are located when the free market forces their hand. \"Our ads are located in places that do not represent our beliefs as a company, we are solely interested in providing business to our customers despite their personal identities\" \"\n\n**FUD:** \"\\*The merger might fail or get blocked resulting in this going bad.\"\\*\n\n**Counter**: SPACs don't fail for the reasons described or eluded to by the outlets. [u/independence\\_hall](https://www.reddit.com/u/independence_hall/) has a great post \"The SEC and FINRA DO NOT have the legal authority or power to block the DWAC/TMTG merger\" please see his post history and read it. He did the leg work and debunked this. It's almost a zero chance of happening. See posts  \\*\\*\"\\*\\*An update to my SEC/FINRA inquiry post and possible S-4 timeline \" and \" The SEC and FINRA DO NOT have the legal authority or power to block the DWAC/TMTG merger. Another COMPLETE breakdown of the SEC/FINRA inquiry, and how the SEC ALREADY APPROVED A SPAC MERGER in the past that was sanctioned by the SEC for lying to its investors.\"\n\n**FUD**: The roll out has been slow and unsuccessful\n\n**Counter:** Actually no it has been record breaking and see the part of the DD above about growth rate projections. Anyone who doesn't understand this is comparing to AWS or existing infrastructure rollouts. I have not yet had one person point me to a valid example of a new platform or service rolling out faster at its inception with its own infrastructure. Also this platform was said be rolled out by end of Q1. It is not end of Q1 yet. TS got 1.5B views in the first 24 hrs -washington examiner (just on apple products, there are only 1.8B apple products.)\n\n**FUD:** They Have Offices in Wuhan\n\n**Counter:** So do: IBM, Deloitte, EY, Huawei, PwC, HSBC, Walmart, Fedex, Hewlet Packard, Pfizer, Apple, Uber, Starbucks, Procter and Gamble, Cummins, Morgan Stanley, Siems, Byte Dance, KFC, Motorola, Nissan, Alibaba, NIO,\n\n**FUD:** \"Trump doesn't know what he's doing he can't even open email\"\n\n**Counter:** Trump just got over a billion in PIPE funding (largest in SPAC history). There's plenty of well paid people with the right background on the company. Trump is largely here for traction, which is the primary issue all social media companies face.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gga6xbf895t81.jpg?width=1361&amp;format=pjpg&amp;auto=webp&amp;s=a9ac72e87543a5f39f77664c4a134d5e3dda3cf5\n\nThere's also an agreement with Rumble to use their services\n\nAlso Lmao, linkedIn etc. FUD is nonsense, these guys are under NDA and are in the top 1 percentile of talent, networks not bound to these nonsense companies are not the sole arbiters of resources\n\n**FUD:** \"This will be GAB/Parler 2.0 failure\"\n\n**Counter:** TMTG+ and the other services are nothing like the markets that these are in. Secondly Parler was becoming massively successful very quickly before it was pulled from the app store and AWS violated contract removing it. Parler is back now. TMTG is safe . Also it's likely Apple and TMTG have a deal since it seems everything is an Apple exclusive at first and their marketcap has been doing well (see that section in the above DD)\n\n&gt;**What Happened:** According to a [Variety](https://www.benzinga.com/)report citing data from the analytics firm **Conviva**, **World Wrestling Entertainment, Inc.'s** (NYSE:[WWE](https://www.benzinga.com/stock/WWE#NYSE)) **WrestleMania 38** drew a combined 2.2 billion impressions across all social media platforms in its April 9-10 presentation, whereas the **NFL’s Super Bowl LVI** brought in 1.8 billion impressions on Feb. 13.\n\n[https://youtu.be/5NsrwH9I9vE?t=41](https://youtu.be/5NsrwH9I9vE?t=41)\n\n[https://youtu.be/vVeVcVBW\\_CE?t=1291](https://youtu.be/vVeVcVBW_CE?t=1291)\n\n[https://youtu.be/vVeVcVBW\\_CE?t=309](https://youtu.be/vVeVcVBW_CE?t=309)\n\n[https://youtu.be/5NsrwH9I9vE?t=86](https://youtu.be/5NsrwH9I9vE?t=86)\n\n&gt;Everyone wants to know what is on Truthsocial, it is the digital platform for the entire reformed republican party with the midterms coming up. It is highly relevant in the culture war and the reimplantation of fair meritocracy based content (that is aside from politics) the removal of shadow banning, bots, and algorithmic manipulation. There has never been an agreed centralized effort for everyone to regroup. It doesn't become relevant until traction is there.\n\n&amp;#x200B;\n\n# Rumble Reports added 9M users QoQ , 22% QoQ\n\n**FUD:** \"Trump steaks\"\n\n**Counter:** Trump steaks and the other very few things like 'From the Desk' that were unsuccessful account for a very small percentage of his ventures. Those are also very different products in very different markets. Investigate this further if you still think it's relevant, you'll be surprised the actual facts and not what low effort FUDs would have you believe.\n\n*The master has failed more times than the novice has tried.*\n\n**FUD:** \"Myself and other have moral/ethical dilemmas because of our ideology\"\n\n**Counter:** I'm not here to argue with you to try to show you why everything is wrong, it's a simple observation that at minimum hundreds of millions of people disagree with you and there is a massive market for it and a demand.\n\n**FUD:** \"Open source\" \"Bad security\" \"Software licensing\"\n\n**Counter:** Source is released and posted, security is fine. Android and Linux are OS as are many projects. There's billions in funding, tech people have already solved this issues for many other services. The issue is Traction. That's where Trump comes in. Rumor of Thiel involvement (he was raising money for campaigning with DJT junior recently)  I wouldn't be surprised if Palantir is involved in some way for security.\n\nI'll add a lot more to this since I'm sure there will be plenty more to come.\n\n**FUD**\n\nDrop in downloads etc.\n\n**Counter**\n\nIt's in load test phase, and still the fastest growing platform in history. Do your own research, fake news would have you buy Twitter right now while it's about to get clapped.\n\n**Conclusion**\n\nThere's a lot of upside and demand that isn't priced in IMHO\n\nI have shares, warrants, and calls and I believe full launch may cause a massive surge in price expectations once more hard data rolls in (in the coming weeks), if not then by the time the revenue rolls in.  The risks are often nonsensical or overstated by people with strong opposing political ideology and lack of financial and technological understandings.\n\n# TL;DR\n\n# Inverse Cramer\n\n&amp;#x200B;\n\n# Not financial advice. Manage risk.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/iqnesxavf5t81.png?width=427&amp;format=png&amp;auto=webp&amp;s=1ab89e9be2db6c9750d3289edfc72092db4f12b3\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vqovk4hi27t81.png?width=600&amp;format=png&amp;auto=webp&amp;s=ff119d23e0b49de4ae9178b1949c7ba7e01eb92b",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/u26d5z/where_one_falls_another_rises_dwac_to_the_future/",
    "score": 1,
    "author": "BigMoneyBiscuits",
    "created_utc": 1649789352,
    "num_comments": 166
  },  "u1mjgq": {
    "title": "goog or googl?",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/u1mjgq/goog_or_googl/",
    "score": 1,
    "author": "mlaaa81",
    "created_utc": 1649724900,
    "num_comments": 1
  },  "u50di9": {
    "title": "goog to da moon🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/u50di9/goog_to_da_moon/",
    "score": 1,
    "author": "Appropriate_Ad_916",
    "created_utc": 1650123519,
    "num_comments": 0
  },  "u50d01": {
    "title": "goog to da moon🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/u50d01/goog_to_da_moon/",
    "score": 1,
    "author": "Appropriate_Ad_916",
    "created_utc": 1650123474,
    "num_comments": 0
  },  "u7z2up": {
    "title": "What are your thoughts on GOOG earnings on April 26th?",
    "selftext": "Google has beaten the EPS past 4 quarters for each earning report. It's currently trading pretty low in the 2570 range. What do we think about April 29 2700$ calls?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/u7z2up/what_are_your_thoughts_on_goog_earnings_on_april/",
    "score": 19,
    "author": "FG204",
    "created_utc": 1650468476,
    "num_comments": 18
  },  "u9l57m": {
    "title": "Markets are oversold right now?",
    "selftext": "Ok, so yesterday I made a post about the indicies are heading towards their pre-pandemic levels (i.e S&amp;P500 below 3400, Nasdaq below 10000) in another sub and I still hold this opinion that we're probably gonna see these levels in a couple of months. However I think the markets are oversold currently because Nasdaq dropped almost 1000 points in a week and at this rate we will see those pre-pandemic levels only within a month or 2 at max. But then what happens? I mean, recession in next year is quite possible but this means that the markets should continue to drop throughout the year. But it can't continue to drop at this pace otherwise it will down a lot more than the pre-pandemic levels, at this rate we might be going back to 2015-16 levels this just seems absurd. I think markets are overreacting and oversold right now and I'm considering an entry for a short term position in a good company like $GOOG or $KO. Thoughts?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/u9l57m/markets_are_oversold_right_now/",
    "score": 3,
    "author": "coolguyxtremist",
    "created_utc": 1650651687,
    "num_comments": 38
  },  "uaej8u": {
    "title": "Breakdown of GOOG business model and how each line drives future growth",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/mhi0ehrpccv81.jpg",
    "score": 6,
    "author": "[deleted]",
    "created_utc": 1650747066,
    "num_comments": 3
  },  "uaa6eo": {
    "title": "Now is probably the time to start buying GOOG on margin",
    "selftext": "Lets talk about Big Tech for a moment.\n\nSpecifically Meta, Microsoft, Amazon, and Google.\n\nMeta is down the most of them all. It definitely has the most potential to rebound (for anyone looking to play OTM LEAPS) but is also the riskiest because there's basically no floor. If their AR/VR pivot continues to flop and the market remains bearish it FB can easily keep drilling down.\n\nNext MSFT. Great company for the long term, although shares are a little pricey right now and their P/E ratio is too high for my liking. I'll pass for the time being.\n\nAmazon - I have no idea how to trade this one tbh. Obviously AWS is a money printer and it will carry the company even if the retail division fails. However it's very possible that AMZN could fill the COVID gap and you could be bagholding for a while.\n\nFinally, Google. GOOG is probably the strongest company in the world right now. It has its fingers in just about everything- ads, cloud, hardware, AI. Calls are risky because of theta crush if the market stays flat for a while, but buying shares right now should be very safe and it probably the most attractive risk/reward trade right now. In almost no scenario short of a major major market crash do we see GOOG dip below 2000 again.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uaa6eo/now_is_probably_the_time_to_start_buying_goog_on/",
    "score": 41,
    "author": "lowkey-zealous",
    "created_utc": 1650734236,
    "num_comments": 115
  },  "ub4joj": {
    "title": "There's rot in the market. It's not FAANG anymore, it's MAGGAT (MSFT, AAPL, GOOG, GOOGL, AMZN, TSLA). And sorry for the misuse of the meme.",
    "selftext": "",
    "url": "https://i.redd.it/shd5jxo6mjv81.jpg",
    "score": 117,
    "author": "quiethandle",
    "created_utc": 1650834958,
    "num_comments": 56
  },  "ub4i1s": {
    "title": "There's rot in the market. It's not FAANG anymore, it's MAGGOT (MSFT, AAPL, GOOG, GOOGL, AMZN, TSLA). And sorry for the misuse of the meme.",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/jzefrxjkljv81.jpg",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1650834827,
    "num_comments": 1
  },  "uai6yn": {
    "title": "Breakdown of GOOG business model and how each line drives future growth",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/7p2vgi8uadv81.jpg",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1650758483,
    "num_comments": 1
  },  "ubw04x": {
    "title": "Official earnings play for big tech. FB will be up and GOOG will be down",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/97qw2fkftqv81.jpg",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1650922079,
    "num_comments": 1
  },  "ubu6zq": {
    "title": "QQQ",
    "selftext": "Holy shit my tits are jacked!  Today may have started red but if you're not buying this dip, you are truly retarded!  \n\nI don't give a fuck if you're worried about higher interest rates or not, right HERE and NOW is the once in a lifetime oppurtinity to buy that sweet, tasty dip like you've just won a LIFETIME supply of TENDIES! \n\nAllow me to present my DD:\n\nEver since the second half of 2020, inflation fears have been slowly factoring into stock valuations, and starting in november it's absolutely been making people PANIC!  \n\nTECH and BONDS are especially hit hard when inflation is high, as we are all aware given how far we've seen them come down.  \n\nThe fed raising interest rates by .5% or .25% in early may could stoke the sell off, but I DON'T CARE and niether should you.\n\nI'm making my money THIS WEEK, because we've got some mammoth weighted QQQ stocks reporting this week.  \n\nTo name a few:\nAAPL (12.51% of QQQ) THURSDAY\nMSFT (10.15% of QQQ) TUESDAY\nGOOG/GOOGL (7.54% of QQQ) TUESDAY\nAMZN (7.28% of QQQ) THURSDAY\nTOTAL (37.48% of QQQ)\n\n🚨DID YOU CATCH THAT🚨\n\n37.48% of QQQ is reporting THIS WEEK!\n\nThese are the companies that are thriving and can pull the weight of whatever ETF they're in.   they will provide TEMPORARY relief from the shit storm that has been 2022, and considering that the IV levels right now have only been reached a handful of times in the last 2 decades, A GIGANTIC U-TURN in QQQ is probable.  Also, we are approaching some significant support levels when looking at QQQ.  This is the perfect storm for a reversal to a LEGENDARY RALLY!  (At least until the FOMC meeting)\n\nI'm down about 99% since november so do your own DD.  \n\nOh and if you're feeling extra retarded and love this DD, consider that ARKK is basically QQQ on steriods and also it's cheaper so you can load up on more of those delicious FD's🚀🚀🚀\n\nMy position: ARKK 29 APR 22 $70 C",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ubu6zq/qqq/",
    "score": 10,
    "author": "TheBigSnort",
    "created_utc": 1650917352,
    "num_comments": 20
  },  "ubu1av": {
    "title": "Let's see who the true market genius is on this board.",
    "selftext": "What are your 6 predictions for tech earnings this week?\n\nPlease post your prediction for each stock after hours:  UP, FLAT, DOWN.\n\nLet's see who the true market genius is on this board.\n\n&amp;#x200B;\n\nTues:  GOOG (down)  MSFT (flat)\n\nWed:  FB (up).    PYPL (flat/up)\n\nThurs: AMZN (down)  AAPL (up)  INTC (down)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ubu1av/lets_see_who_the_true_market_genius_is_on_this/",
    "score": 2,
    "author": "profligateclarity",
    "created_utc": 1650916955,
    "num_comments": 36
  },  "ucogyl": {
    "title": "4-26-22 Spy, Apple, QQQ Daily Ta",
    "selftext": "  \n\nThe stock market is like being on the titantic as a time traveler… you KNOW its going to crash but theres nothing you can do about it. The bulls only how was for the watch tower (msft and google) to direct us around the ice berg. Except they were drunk af and steered us even more directly into it. Now our only hopes are to prepare the life boats (apple, and amazon). If those 100 year old life boats don’t keep us afloat we will see the bottom of the ocean (SPY sub 400) very soon. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/nj1vl1lh8yv81.png?width=749&amp;format=png&amp;auto=webp&amp;s=d83c8f9a2fabaa6de3ee8a3755979a2e5ceab250\n\n&amp;#x200B;\n\nhttps://preview.redd.it/movo7y0i8yv81.png?width=731&amp;format=png&amp;auto=webp&amp;s=ff53bfa31bae242893133a7d9465c54a77618bc8\n\nAs you can see we are in a MASSIVE bear channel and we are testing lows we haven’t seen since beginning on March. I actually am a little surprised by today. Though my pre-market analysis did mention that Monday had the potential to have been a bear market dead cat bounce and that we would continue to drill. Well drill they did and drill I don’t think they will stop…\n\nI am actually impressed they were able to get this to -2.90% today that’s hell impressive. We are actually at the bottom of our bear channel on the daily now. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/a2fmzkki8yv81.png?width=975&amp;format=png&amp;auto=webp&amp;s=97aff8d962f90d8e85659333b545a5b279f3231c\n\nHowever, with MSFT beating earnings but market not responding very well and Google getting wrecked right now missing their earnings there is VERY little hope that SPY will have the green pre-market it needs\n\n&amp;#x200B;\n\nhttps://preview.redd.it/yqzgbu5j8yv81.png?width=444&amp;format=png&amp;auto=webp&amp;s=67b2e674e7782e249dbe4ff099641e30271fd3a8\n\nhttps://preview.redd.it/gersvb0k8yv81.png?width=430&amp;format=png&amp;auto=webp&amp;s=a0b530d66436229c42cf83367549c40ce5d83417\n\nAs you can see the only two bull saviors are the bears best friends. QQQ is currently down -1.4% and Spy down -0.56%. I would be shocked to wake up with green especially since it doesn’t seem like the MSFT or Goog guidance calls really did anything good. \n\nDaily wise we are going to need to see resistance broken at 416 à 420 (the major resistance point) and eventually see bulls push for an EOW test of the daily 8ema at 431.83. \n\nDaily wise the bears tomorrow will look to break through two key supports. First one is at 415.5 (we are already below that now after hours) and then 410. If we break 410 that is the lowest low from the current bear market we are in.   \n   \n \n\nWe very well MAY see a new lower low. Based off the most recent lows of 420 à 410 à 400 is the most natural point we may hit. That also puts us at the lower support line of the huge orange channel we are in. \n\nThe current market environment is not good. I know there are quite a few who look at January and see the massive rally we had or even the massive rally we had in March when we bottomed at 415. But history does not repeat the pass. I mean this week MIGHT be the best time ever to load on some LEAPS but we also very well may see 350-380 end of year. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/r0s7wxwk8yv81.png?width=975&amp;format=png&amp;auto=webp&amp;s=c66f604b05607fc0ffbe0d43fd4d8b81b9d6abc0\n\nIf you look at the weekly chart and draw a line through the “average” price point from 2018 to 2020 it lines up perfectly with the Weekly 200ema which is sitting right at 360.57 right now. I don’t know if the markets got the balls to do it but damnit we just might fing do it. We just might break down over this next month and see 360. That would essentially negate everything that happened in 2020/2021 and rest the market back on the 2018/2019 bull path. Which is arguable a more normalize bull path and normal market behavior path. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/e94n3pel8yv81.png?width=975&amp;format=png&amp;auto=webp&amp;s=7e56a8409189bfd5e4b1500f31d93b3b680d1d18\n\nHere is zoomed out a little more. I thought January was going to take us to this point but they rallied us. We will see if the markets let this happen of if they rally us again. This may be a SLOW drawn out process where we just bounce up and down the whole way there. \n\nTo be honest until Friday comes and we see Markets react tomorrow intraday and Thursday after hours once Apple and Amazon release we are a little bit in limbo here. Friday will be very interesting time to assess the Weekly and daily update chart. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/vze1omyl8yv81.png?width=975&amp;format=png&amp;auto=webp&amp;s=fd5ec74baae1438cb0818ba396ee6916b2a9f58a\n\nApple got absolutely destroyed today and its getting wrecked even more after hours right now down 1.21%. I have pretty low hopes in a rally tomorrow BUT we may hit that rubber band point at some point tomorrow. But this is the first candle closed BELOW the 200ema on apple since March. In January it broke below the 200ema for a candle and in march the next candle it rebounded back above. I am not sure if it will this time or not. On a low side Apple could very well see 145 if this channel is correct. We will see how markets react tomorrow to know for sure. And even more importantly end of week we will see where Apple is at. If we close a full candle below the 200ema I think 140 is in play and especially if earnings are bad Thursday night. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/lhlkn1hm8yv81.png?width=677&amp;format=png&amp;auto=webp&amp;s=093bba2eb0195bc0537164901f545b2a63993f73\n\n&amp;#x200B;\n\nhttps://preview.redd.it/a2xw41ym8yv81.png?width=708&amp;format=png&amp;auto=webp&amp;s=99cbf86619cab6221060c0709121e480a83f8b4d\n\nQQQ actually had an incredibly bearish finish today. It broke and closed below its lowest point from the January and March dips. And is currently sitting well below that at 313. Currently based off the channel its in 313 is the low but overall sub 300 is possible for QQQ. 270 is its weekly 200ema and much like SPY its very possible we could attempt to see that this year. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/zopcxcfn8yv81.png?width=975&amp;format=png&amp;auto=webp&amp;s=d3748c788573950b22ab64c9928244a9527a49a1\n\nBelieve it or not the VIX is actually still lower than it was in January and February when QQQ/ SPY was at these levels. The VIX was at 37 around those times and we only closed at 33.51 today. 31.5 was a massive hurdle it felt like of the VIX to get over though. At some point this is going to recoil and unwind and whenever that does is when we will get the massive bull run I am just not sure when that will happen. \n\nThe thing is we need something to drop that VIX level and its very possible we will NOT see that until after the FOMC meeting next week. Arguably looking at the VIX candles now vs the last three months the run up in the VIX is way more extreme then it was any of the other times. Even January was a nice steady climb. The VIX just did a massive move up the last 4 trading days. Yes yesterday did fall some but all of that and some were made up for today. 35 to 36.5 are the next VIX levels which I would be shocked not to see after all these after hours BS. \n\nThe one thing that I will caveat all of everything I just said in this post and about how bearish I am is that the VIX is our guide. With the VIX at the current level it is at, yes it CAN go higher to say 40, BUT it is VERY unlikely we will see that kind of level without some sort of nuclear war fall out, 2nd pandemic, feds gonna do a hike of 150bps sort of thing the VIX is going to unwind very soon here. And when it does SPY is going to sky rocket. We may have to wait till next week after FOMC but its gonna happen. Its just a matter of time. The question is how long will people wait? \n\nThe other thing to think about it how we are not approaching “fire sale” territory where algos, joe blow, and everyone else is going to see the markets and say well damn this is the buying opportunity of my life time… I missed the one in January I wont miss this one sort of mentality is gonna start popping up soon. \n\n10% challenge-\n\n4/26/2022 Put 1dte 21%\n\n4/26/2022 Put 1dte 5%\n\n4/26/2022 Call 1dte 3%\n\n4/26/2022 Put 1dte 15%\n\n4/26/2022 Put 1dte 15%\n\n4/26/2022 Call 1dte -8%\n\n4/26/2022 Put 1dte 25%\n\n4/26/2022 Put 1dte -8% \n\nOverall today was a great day. I had two small -8% losses that I am not worried about otherwise had some nice wins with some bigger 15-25% profits. I had quite the losses to make up for after Monday getting burned on a put so I was happy to see that I made it back over that and I am officially net green for the week day trade wise. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ma2ta32o8yv81.png?width=472&amp;format=png&amp;auto=webp&amp;s=04ea7a0a09c28bb742b938176997056d61c6bec3\n\nCurrently running with these Lottos right now… seeing that MSFT has made a MASSIVE recovery even since I posted this now being up 5% so who knows whats going to happen tomorrow now. Apple and Spy are recovering too. It will be very interesting morning tomorrow for sure and an even more interesting day. Google is still getting wrecked right now. \n\nMy hyperwheel is not doing so hot and cant wait for markets to bull run again. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/v7dgxzmo8yv81.png?width=872&amp;format=png&amp;auto=webp&amp;s=d0e2ded4ff025ad1ada3a0afb4d9b7ceeec03158",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ucogyl/42622_spy_apple_qqq_daily_ta/",
    "score": 25,
    "author": "DaddyDersch",
    "created_utc": 1651011961,
    "num_comments": 30
  },  "ucgdsg": {
    "title": "GOOG to the moon.",
    "selftext": "",
    "url": "https://i.redd.it/61981l2lfwv81.jpg",
    "score": 30,
    "author": "ThatKidFromNepal",
    "created_utc": 1650990063,
    "num_comments": 45
  },  "uc1tmd": {
    "title": "Earnings play ideas: Puts on $GOOG and $GOOGL for Tuesday 📉 and calls on $FB for Wednesday 📈",
    "selftext": "",
    "url": "https://i.redd.it/arjyygiw7sv81.jpg",
    "score": 218,
    "author": "QuirkyAverageJoe",
    "created_utc": 1650939052,
    "num_comments": 106
  },  "uewroo": {
    "title": "47.6% of Berkshire's $300+ billion portfolio is in one single stock. Buffett is the next Cathie Wood.",
    "selftext": "I was shocked to see that the Oracle of Omaha pilled in 47.6% of Berkshire Hathaway's portfolio in Apple. I hate to see all these \"experts\" hide behind few mega cap stocks like AAPL, GOOG, AMZN, TSLA, NFLX, FB and act like they are gods.\n\nAfter small and mid cap destruction that started in November 2021, I can't hide my happiness that market is coming to destroy the big boys like Bill Ackman (NFLX), Musk (TSLA), Zuckerberg (FB), Bezos (AMZN) and very soon Buffett (AAPL).\n\nThey are not smarter than us. They do not diversify.\n\nLet SPY burn - muahahaha!\n\nhttps://preview.redd.it/zbytpa5bijw81.png?width=1093&amp;format=png&amp;auto=webp&amp;s=55496be62ec3590cb0f6be65478a0e1373145428",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uewroo/476_of_berkshires_300_billion_portfolio_is_in_one/",
    "score": 42,
    "author": "SilbergleitJunior",
    "created_utc": 1651269828,
    "num_comments": 179
  },  "ugezp3": {
    "title": "GOOG Stock Theory",
    "selftext": "So hear me out on this first post. Google is splitting it's stock 20-1 on July 15th. This may have already been said elsewhere but I think this will reduce the share price enough to make it affordable for average Jane's like myself and many others to the point that we will see a greater number of share purchases and a subsequent price increase. Additionally, the lower share price will make GOOG eligible to join the DOW. If that happens, then every index fund or mutual fund that invests in the DOW will have to buy GOOG to maintain their fund tracking.... sounds like potential for huge gains if this happens. Thoughts?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ugezp3/goog_stock_theory/",
    "score": 26,
    "author": "LiliyaSkye",
    "created_utc": 1651456729,
    "num_comments": 41
  },  "uh63j0": {
    "title": "GOOG &amp; AMZN - upcoming 1:20 stock split",
    "selftext": "[deleted]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uh63j0/goog_amzn_upcoming_120_stock_split/",
    "score": 27,
    "author": "[deleted]",
    "created_utc": 1651544987,
    "num_comments": 34
  },  "uj9ut9": {
    "title": "NLST beat GOOG in Claim 16",
    "selftext": "for intervening rights.  Damages will now date back to 2014.  This is freaking crazy as the technology exists in ALL of Google’s servers and Netlist is barely a billion dollar company.  This could get crazy!!!\n\nhttps://news.bloomberglaw.com/ip-law/google-fails-to-escape-netlist-suit-over-memory-server-patents",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uj9ut9/nlst_beat_goog_in_claim_16/",
    "score": 140,
    "author": "CreativeSuit1220",
    "created_utc": 1651792198,
    "num_comments": 66
  },  "uj9scr": {
    "title": "NLST beats GOOG in intervening rights on Claim 16. Damages will go back to 2014….",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uj9scr/nlst_beats_goog_in_intervening_rights_on_claim_16/",
    "score": 1,
    "author": "CreativeSuit1220",
    "created_utc": 1651791988,
    "num_comments": 1
  },  "uilgez": {
    "title": "$FB, $AMZN $MSFT $GOOG go UP at the same time, during Market Hours | $FB, $AMZN $MSFT $GOOG had a Flash Crash at the same time, After Hours.",
    "selftext": "",
    "url": "https://i.redd.it/os7h112w3kx81.jpg",
    "score": 1,
    "author": "Fedwardd",
    "created_utc": 1651712544,
    "num_comments": 2
  },  "ujkfzz": {
    "title": "Would GOOG be a good buy? Google bought Raxium (AR)",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ujkfzz/would_goog_be_a_good_buy_google_bought_raxium_ar/",
    "score": 1,
    "author": "dukeofbrats",
    "created_utc": 1651833147,
    "num_comments": 2
  },  "ukhxkm": {
    "title": "Tesla gets criticism that it's a good company with an overpriced stock. What if the reverse is true? A shitty company with an overperforming stock. Do you seriously think Tesla's cars are more important than $GOOG?",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ukhxkm/tesla_gets_criticism_that_its_a_good_company_with/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1651943929,
    "num_comments": 48
  },  "ukhr14": {
    "title": "Tesla gets criticism that it's a good company with an overpriced stock. What if the reverse is true? A shitty company with an overperforming stock. Do you seriously think Tesla's cars are more important than $GOOG?",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/az0tg2za63y81.png",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1651943389,
    "num_comments": 1
  },  "ukhq25": {
    "title": "Tesla gets criticism that it's a good company with an overpriced stock. What if the reverse is true? A shitty company with an overperforming stock. Do you seriously think Tesla's cars are more important than $GOOG?",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/iw2l814163y81.png",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1651943309,
    "num_comments": 2
  },  "ukhnmf": {
    "title": "Tesla gets criticism that it's a good company with an overpriced stock. What if the reverse is true? A shitty company with an overperforming stock. Do you seriously think Tesla's cars are more important than $GOOG?",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/1ws9oie753y81.png",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1651943109,
    "num_comments": 3
  },  "ungj17": {
    "title": "SPY, MSFT, FB, AAPL, AMZN, TSLA, DIS and GOOG Option Chains for this week",
    "selftext": "[deleted]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ungj17/spy_msft_fb_aapl_amzn_tsla_dis_and_goog_option/",
    "score": 2,
    "author": "[deleted]",
    "created_utc": 1652293793,
    "num_comments": 5
  },  "uo6xn5": {
    "title": "Goog",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/junnzwu233z81.jpg",
    "score": 0,
    "author": "[deleted]",
    "created_utc": 1652378151,
    "num_comments": 4
  },  "uu37a4": {
    "title": "Buy Puts SP500 Overvalued 20%-25%+",
    "selftext": "I did the definitive work here and per my calculation the stock market is overvalued currently about 23%. If you need to see work, get your own crayons.\n\nInflation is not enough to correct this and increasing interest rates to combat inflation only puts downward pressure on stocks.\n\nThis is the facts of life.\n\n&amp;#x200B;\n\nInvestment strategy to capitalize on current market conditions:\n\nPuts SPY\n\nLong DIS and GOOG",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uu37a4/buy_puts_sp500_overvalued_2025/",
    "score": 9,
    "author": "aka0007",
    "created_utc": 1653068053,
    "num_comments": 46
  },  "uttqtx": {
    "title": "Here is a list of the spectacular returns of some major companies, I still don't understand Bear Market.",
    "selftext": " **2022 Returns**\n\n[$TWTR](https://twitter.com/search?q=%24TWTR&amp;src=cashtag_click): -15%\n\n[$AAPL](https://twitter.com/search?q=%24AAPL&amp;src=cashtag_click): -20%\n\n[$GOOG](https://twitter.com/search?q=%24GOOG&amp;src=cashtag_click): -23%\n\n[$MSFT](https://twitter.com/search?q=%24MSFT&amp;src=cashtag_click): -24%\n\n[$ADBE](https://twitter.com/search?q=%24ADBE&amp;src=cashtag_click): -30%\n\n[$TSLA](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click): -33%\n\n[$AMD](https://twitter.com/search?q=%24AMD&amp;src=cashtag_click): -33%\n\n[$AMZN](https://twitter.com/search?q=%24AMZN&amp;src=cashtag_click): -36%\n\n[$CRM](https://twitter.com/search?q=%24CRM&amp;src=cashtag_click): -38%\n\n[$NVDA](https://twitter.com/search?q=%24NVDA&amp;src=cashtag_click): -42%\n\n[$FB](https://twitter.com/search?q=%24FB&amp;src=cashtag_click): -43%\n\n[$MRNA](https://twitter.com/search?q=%24MRNA&amp;src=cashtag_click): -46%\n\n[$SQ](https://twitter.com/search?q=%24SQ&amp;src=cashtag_click): -49%\n\n[$SNAP](https://twitter.com/search?q=%24SNAP&amp;src=cashtag_click): -52%\n\n[$ZM](https://twitter.com/search?q=%24ZM&amp;src=cashtag_click): -54%\n\n[$SPOT](https://twitter.com/search?q=%24SPOT&amp;src=cashtag_click): -55%\n\n[$TEAM](https://twitter.com/search?q=%24TEAM&amp;src=cashtag_click): -57%\n\n[$PYPL](https://twitter.com/search?q=%24PYPL&amp;src=cashtag_click): -59%\n\n[$SNOW](https://twitter.com/search?q=%24SNOW&amp;src=cashtag_click): -59%\n\n[$ETSY](https://twitter.com/search?q=%24ETSY&amp;src=cashtag_click): -64%\n\n[$NFLX](https://twitter.com/search?q=%24NFLX&amp;src=cashtag_click): -71%\n\n[$SHOP](https://twitter.com/search?q=%24SHOP&amp;src=cashtag_click): -74%\n\n[$W](https://twitter.com/search?q=%24W&amp;src=cashtag_click): -75%",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uttqtx/here_is_a_list_of_the_spectacular_returns_of_some/",
    "score": 37,
    "author": "LahomaMcninch",
    "created_utc": 1653048587,
    "num_comments": 41
  },  "uupvg9": {
    "title": "GOOG/L - Competition and Transparency in Digital Advertising Act",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uupvg9/googl_competition_and_transparency_in_digital/",
    "score": 1,
    "author": "Bukkakecat",
    "created_utc": 1653148208,
    "num_comments": 2
  },  "uvxbfc": {
    "title": "Don't be fooled...we going RED",
    "selftext": "Yes the pre market is green.  Yes that's happened dozens of times just to get pummeled from 9:45 until 4:00.\n\nHere's the problem.  One thing that is certain and undeniable is that when the mega caps tank, the market tanks.  See: Netflix, Amazon, fb, tsla demise.  When those stocks lose support it shakes the entire market and we bleed out in impressive fashion. \n\nThe death of nflx, fb, amzn and tsla got us to where we are.  The death of aapl, goog, and msft will get us to where we're heading.  Spy 360....the 200 MA.  \n\nAll 3 sank Friday below the bottom of a key trendline and closed directly below that line for the first time.  All 3.  Right below.  First time.\n\nNow spy is above its trendline but you can bet your ass its not going anywhere without those 3.  All 3 are butted up against the bottom of their trendline line in the premarket.   Watch them carefully.   Maybe its possible they just undercut the line and they soar today.  I highly doubt it.   They are the last of the megas holding up and they're charts are breaking down but have a long way to go.  Amzn, fb, and Netflix hit pre covid levels already as has damn near every other stock except the aforementioned 3 holding this shit pile up. \n\nWe need them up substantially early...like 1.5% to 2% and to hold for any chance of a rally.  They fade to red and short anything became it'll all follow suit bigly.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uvxbfc/dont_be_fooledwe_going_red/",
    "score": 90,
    "author": "Miserable-Cucumber70",
    "created_utc": 1653302442,
    "num_comments": 112
  },  "uwsyhm": {
    "title": "DEATH STAR OF DAVID WATCHLIST... WHO'S NEXT??",
    "selftext": "[Based on an earlier post trying to mislead you about the \"Super Always Accurate Death Cross\" \\(real name\\) TA pattern](https://www.reddit.com/r/wallstreetbets/comments/uwqdaq/death_cross_watchlist_whos_next/), I am going to educate you about the superior signal called the Death Star of David.\n\nIt is said, the best time to buy is when there's blood on the street.\n\nHow much \"red\" will investors see before its time to resurrect the following blue-chip stocks that have entered and remain under the Death Star of David?\n\n&amp;#x200B;\n\n|Blue-Chip|Date of \"DEATH STAR OF DAVID\"|\n|:-|:-|\n|**MSFT**|**3/15/22**|\n|**GOOG**|**3/4/22**|\n|**AMZN**|**1/25/22**|\n|**FB**|**12/10/21**|\n|**NVDA**|**4/20/22**|\n| **JPM**|**1/27/22**|\n|**MA**|**4/13/22**|\n|**HD**|**3/18/22**|\n|**VZ**|**2/17/21**|\n\n*Death Star of David: When a stock's 51-day moving average crosses under its 201-day moving average. It is considered one of the bellwether indicators watched by institutional investors.*\n\nThe following stocks are at risk of entering the ominous \"Death Star of David.\"\n\n# $TSLA\n\n[$TSLA](https://i.imgur.com/t2HkLU8.png)\n\n# $AAPL\n\n[$AAPL ](https://i.imgur.com/Dc2S6a2.png)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uwsyhm/death_star_of_david_watchlist_whos_next/",
    "score": 11,
    "author": "praiseheatdeath",
    "created_utc": 1653404814,
    "num_comments": 13
  },  "uwqdaq": {
    "title": "DEATH CROSS WATCHLIST... WHO'S NEXT??",
    "selftext": "It is said, the best time to buy is when there's blood on the street.\n\nHow much \"red\" will investors see before its time to resurrect the following blue-chip stocks that have entered and remain under the Death Cross?\n\n&amp;#x200B;\n\n|Blue-Chip|Date of \"DEATH CROSS\"|\n|:-|:-|\n|**MSFT**|**3/15/22**|\n|**GOOG**|**3/4/22**|\n|**AMZN**|**1/25/22**|\n|**FB**|**12/10/21**|\n|**NVDA**|**4/20/22**|\n| **JPM**|**1/27/22**|\n|**MA**|**4/13/22**|\n|**HD**|**3/18/22**|\n|**VZ**|**2/17/21**|\n\n*Death Cross: When a stock's 50-day moving average crosses under its 200-day moving average. It is considered one of the bellwether indicators watched by institutional investors.*\n\nThe following stocks are at risk of entering the ominous \"Death Cross.\"\n\n# $TSLA\n\n[$TSLA](https://preview.redd.it/1xc3az4d9f191.png?width=1508&amp;format=png&amp;auto=webp&amp;s=d01892203db1918e9684deb7da3afecec503574f)\n\n# $AAPL\n\n[$AAPL ](https://preview.redd.it/j8c4exit8f191.png?width=1511&amp;format=png&amp;auto=webp&amp;s=f6f66c78adc0875d4d1551bb5618573cbf760b94)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/uwqdaq/death_cross_watchlist_whos_next/",
    "score": 16,
    "author": "GroundbreakingLynx14",
    "created_utc": 1653397491,
    "num_comments": 6
  },  "v4wf5o": {
    "title": "Preface: Amazon recently had a 20:1 stock split this past Friday (taking affect on Monday). Google has its upcoming 20:1 split slated for mid-July.",
    "selftext": "&amp;#x200B;\n\nDo you see any potential in the recent Amazon split and upcoming Google 20:1? Are these Blue Chips, stocks that our dads wished they invested in before the price was to high for the average investor, going to be more attractive now that they are \"affordable\". I know that splits are have no intrinsic value, it doesn't mean that they are actually \"cheaper\" but it does have a phycological affect on average traders who don't have millions to invest. I'm more inclined to purchase Amazon and Google at $100+ and own \"more\" whole shares, than spend limited capital on a few or have fractional share (I'm with TD, so I don't have the ability to purchase fractional shares yet.)\n\n&amp;#x200B;\n\nRight now my strategy was to purchase Amazon option calls before the split, that expire next Friday (Jun 10), with expectations that the price will go up next week. I also purchased Google calls well in advance anticipating the price will go up in the weeks prior to the split. These calls expire the day of the split and some in August.  What are some of you all doing, if anything?\n\nOpen Positions: \n\nAMZN: \n\n4x 10 JUN  22 2560 (128 post split)\n\n2x 10 JUN 22 2650 (132.5 post split, I realize I might have liquidity issues with this one)\n\n4x 10 JUN 22 2780 (139 post split)\n\nGOOG:\n\n4x 15 JUL 22 2700\n\n1x 19 AUG 22 2800\n\n6x 19 AUG 22 3200",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/v4wf5o/preface_amazon_recently_had_a_201_stock_split/",
    "score": 80,
    "author": "SavvyJones",
    "created_utc": 1654371609,
    "num_comments": 107
  },  "v8t72v": {
    "title": "GOOG 1/20/23 2850 C - Down 62% but I’m holding!#YOLOUPDATE",
    "selftext": "",
    "url": "https://i.redd.it/ayaslwxfdo491.jpg",
    "score": 25,
    "author": "usvientrepreneur",
    "created_utc": 1654815121,
    "num_comments": 37
  },  "vaoptj": {
    "title": "Weekly Risk Ranges for TSLA, AAPL, SPY, QQQ, IWM, GOOG, MSFT, AMZN",
    "selftext": "# Weekly Risk Ranges\n\n|Ticker|Low|High|\n|:-|:-|:-|\n|TSLA|637.94|755.44|\n|AAPL|130.83|143.43|\n|SPY|376.31|403.09|\n|QQQ|277|300.68|\n|IWM|171.76|185.42|\n|GOOG|2129.85|2327.25|\n|MSFT|242.09|263.89|\n|AMZN|103.64|115.66|\n\n&amp;#x200B;\n\n# If this looks foreign to you, let me explain how I go about getting this. I first go to the options chain for the ticker and then I look at the options expiring next week at the money. I take the Ask on both the call and put side and add them together. This is my expected move from the current stock price. I then add and subtract the expected move from the stock price to come up with the higher and lower risk ranges. These ranges basically tell you if we're overbought or oversold. If we hit these risk ranges early in the week, it could make for a good trade in the opposite direction. Often times, major macro events can cause us to significantly fall above or below these expectations so do use with caution when approaching major macro news. Lastly, keep in mind that you don't want to do this with low volume stocks because the difference between the bid and ask can be wide.\n\n📷",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vaoptj/weekly_risk_ranges_for_tsla_aapl_spy_qqq_iwm_goog/",
    "score": 26,
    "author": "Guysmarket",
    "created_utc": 1655048807,
    "num_comments": 16
  },  "vaonbw": {
    "title": "Weekly Risk Ranges for TSLA, AAPL, SPY, QQQ, IWM, GOOG, MSFT, AMZN",
    "selftext": "[deleted]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vaonbw/weekly_risk_ranges_for_tsla_aapl_spy_qqq_iwm_goog/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1655048602,
    "num_comments": 1
  },  "vaomc9": {
    "title": "Weekly Risk Ranges for TSLA, AAPL, SPY, QQQ, IWM, GOOG, MSFT, AMD, AMZN",
    "selftext": "[deleted]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vaomc9/weekly_risk_ranges_for_tsla_aapl_spy_qqq_iwm_goog/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1655048522,
    "num_comments": 1
  },  "vaobyh": {
    "title": "Weekly Risk Ranges for TSLA, AAPL, SPY, QQQ, IWM, GOOG, AMD, MSFT, AMZN",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vaobyh/weekly_risk_ranges_for_tsla_aapl_spy_qqq_iwm_goog/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1655047676,
    "num_comments": 2
  },  "vgp0dh": {
    "title": "u/hoopmbb6279 asked me to post my positions and prove that my account is up about 50% in the last few weeks from $26k to $40k",
    "selftext": "In another post someone commented that everyone is losing money right now. I claimed that I was up around 50% in the last few weeks. u/hoopmbb6279 joked that making $0.50 on your last $1 isn't that hard. I responded that I've gone from about $26k to about $40k, and he asked me to prove it. So here we are.\n\nFirst of all, it turns out I was slightly wrong. I thought I had gone from $32k to $26k (IRA contribution) then up to $40k, which is where I got the +50% number. It turns out I went from $32k to $35k on some calls, then IRA contribution down to $29k, then up to $40k. So, similar but different.\n\n&amp;#x200B;\n\n[Here's the current value of the account](https://preview.redd.it/07xeih2bns691.png?width=702&amp;format=png&amp;auto=webp&amp;s=bae985cdb034aa90fbbd2071cf96d4b3b05cb419)\n\n&amp;#x200B;\n\n[And here's the chart over the past month](https://preview.redd.it/z4pashgins691.png?width=436&amp;format=png&amp;auto=webp&amp;s=fa9af36117539630810a634810d5e3c1a11e8606)\n\nSo you can see, the account had basically nothing it in, about $300. Lucky for me, my wife's boyfriend gave me my allowance for the year all up front so I stuck the $32k in this account. I made a little money at the end of May, made my IRA contribution a week later, and then have made about $11k in the last two weeks.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5p5zk8jcps691.png?width=712&amp;format=png&amp;auto=webp&amp;s=5104d72c38732a62b53796d7387a1374c6f5b3eb\n\n[First thing I did was buy $ULTA call ahead of earnings. If I held it overnight I would have made like $5k instead of $1,700 but oh well.](https://preview.redd.it/u8sxd37eps691.png?width=730&amp;format=png&amp;auto=webp&amp;s=a06da44739ab08f03329c4e06786fdda48ddd1fc)\n\n&amp;#x200B;\n\n[I then played some $HPE and $HPQ calls for their earnings. Eventually sold everything for about $2k](https://preview.redd.it/f7rhhhsrps691.png?width=728&amp;format=png&amp;auto=webp&amp;s=46c68ba26aced9011605341b7fa0791e1590b144)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Then I stepped up to $SPY puts.](https://preview.redd.it/k3djtgjsqs691.png?width=712&amp;format=png&amp;auto=webp&amp;s=9722b4c68aec496161d586530813f2a4a891eba1)\n\n[They doubled in value in a couple hours so I sold half to get my money back.](https://preview.redd.it/8oefxz0uqs691.png?width=730&amp;format=png&amp;auto=webp&amp;s=a189114a62e5cf920aed0c1e3fc70264c0d08b38)\n\n[Then I sold the rest the next day and made a total of about $5,500 profit.](https://preview.redd.it/t0ck6omzqs691.png?width=732&amp;format=png&amp;auto=webp&amp;s=47522482adc7574d9eda5469dce11abaf915c5b8)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Don't forget to buy the dip! Too early but whatever, at least there's something in the account I won't gamble away.](https://preview.redd.it/j053dtdfrs691.png?width=739&amp;format=png&amp;auto=webp&amp;s=ea0f333d29fe102a0c4139febfb06a4f8f4ab33b)\n\n&amp;#x200B;\n\n[Back to $SPY puts.](https://preview.redd.it/vvi6hlk8ss691.png?width=726&amp;format=png&amp;auto=webp&amp;s=e8fa36c577f60d138d36f03205d9c0f73dddd5aa)\n\nhttps://preview.redd.it/jq0ecj2iss691.png?width=726&amp;format=png&amp;auto=webp&amp;s=ca2e10f9fa5ee56c16989ef15f494ddaec3a98c3\n\n[Sold them all for about $6,000, or $2,500 profit.](https://preview.redd.it/lp9p7jajss691.png?width=716&amp;format=png&amp;auto=webp&amp;s=659f672c103c02688465fb80b9183099d5bef02b)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[$SPY puts again](https://preview.redd.it/kbc8b49vss691.png?width=728&amp;format=png&amp;auto=webp&amp;s=22b1c2296c8fc6f5f6f5454f601270b772c3aaf1)\n\n[Sold them all for about $6,500, or $4,200 profit.](https://preview.redd.it/d5nfnunyss691.png?width=725&amp;format=png&amp;auto=webp&amp;s=1f0411943eacb6bc6d8eb6dda825c6e062c84b0f)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/k5fn1beats691.png?width=955&amp;format=png&amp;auto=webp&amp;s=18fc533ee26e5f03a6985b336b079b2a40e6ca54\n\nWhich brings me to my final positions. Roughly equal parts Cash, $AMZN, and $GOOG. \n\nAnd holding 50 x 6/24 9C ahead of their Polestar vote on Wednesday.\n\n&amp;#x200B;",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vgp0dh/uhoopmbb6279_asked_me_to_post_my_positions_and/",
    "score": 208,
    "author": "stoneman9284",
    "created_utc": 1655741291,
    "num_comments": 123
  },  "vjqhu5": {
    "title": "Not a bad two day gain on a $4k+ OTM GOOG call (+$4725). Slowly dumping more and more VOO along the way for what’s coming next 🌈🐻",
    "selftext": "",
    "url": "https://i.redd.it/7wfzh4xh3l791.jpg",
    "score": 84,
    "author": "spartuh",
    "created_utc": 1656082999,
    "num_comments": 53
  },  "vqo44o": {
    "title": "What are our thoughts on what GOOG might do Pre split? Split happens on the 15th btw.",
    "selftext": "",
    "url": "https://i.redd.it/3cmemtcvee991.png",
    "score": 25,
    "author": "Guysmarket",
    "created_utc": 1656873812,
    "num_comments": 13
  },  "vtqh6q": {
    "title": "$GOOG calls saved my portfolio 🙏",
    "selftext": "",
    "url": "https://www.reddit.com/gallery/vtqh6q",
    "score": 362,
    "author": "Avizeee",
    "created_utc": 1657221207,
    "num_comments": 51
  },  "vu0wzk": {
    "title": "Bearish on $APPL, $MSFT, $GOOG, $TSLA, $AMZN, on Friday.",
    "selftext": "",
    "url": "https://i.redd.it/hnjgc4aoj9a91.jpg",
    "score": 289,
    "author": "franticredditperson",
    "created_utc": 1657250700,
    "num_comments": 69
  },  "vv8spf": {
    "title": "Elon will have sh*t load of lawsuits incoming most likely even from Tesla shareholders",
    "selftext": "Elon really is a Silicon Valley Mafia.  He is bullying the sh*t out of Twitter which Elon will eventually take over by lowering valuation outside the court.\n\nThen there is subordinate relationship\n\nhttps://www.forbes.com/sites/rashishrivastava/2022/07/08/elon-musks-relationship-with-employee-may-have-violated-teslas-ethics-code-experts-say/\n\nWhich will bring Tesla stock price down in turn Tesla shareholders will sue Elon then there are\n\nTwitter shareholders,\nTwitter,\nand maybe SEC if Elon fails to prove twitter’s negligence\n\nOnly real clause Elon can use in court is Twitter not providing adequate information about daily users.\n\nNo, bot count is not in play because if Twitter doesn’t know exact bot numbers then Elon can only speculate.  \n\nBUT Elon wants Twitter baaaaaaaaddd because Twitter is a huge benefit to Tesla by using Twitter platform as an alpha testing platform.  Whenever Tesla announces new features/update, Twitter users provide feedback, there is not a single platform better than Twitter when thinking about user (Tesla) engagement.  \n\nLets be real, nobody uses company website to provide feedback.\n\nGrab some popcorn 🍿 and enjoy the show\n\nUPDATE: I have NO position in Tesla but I do enjoy watching Elon as he is making history(revolutionizing energy and space travel).  \n\nElon will be one of the most controversial Genius/inventor your kids/grandchildren will learn and discuss at school.  Hence enjoy it.\n\nMy portfolio == Coke, Apple, MSFT, GOOG",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vv8spf/elon_will_have_sht_load_of_lawsuits_incoming_most/",
    "score": 0,
    "author": "dohtem213",
    "created_utc": 1657393886,
    "num_comments": 23
  },  "vuur23": {
    "title": "Unsolicited Technicals Week ending 7/8/22, Bank Earnings Edition",
    "selftext": "Alright dickheads, I'm back.  A lot of you told me I was retarded last weekend when I called out the divergences that led into this rally, so to them I say Fuck You \n\nFor everyone else, here's what I'm seeing in the charts, if you're into that sorta thing.\n\n**SPY:**\n\nhttps://preview.redd.it/xp44b7g01ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=44f2b518fbe0f3da341b79eebe6a61892e2f6a49\n\nStill have some work to do if we're going to fill that $400 gap.  Rejecting $390 this week may have some of you concerned but checkout the Weekly chart\n\nhttps://preview.redd.it/kr4hpb092ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=f328e839d8338c56b295d2fb5eaad9475b20bca9\n\nThis weekly chart just further outlines the trend reversal that the daily divergences have been showing leading into this rally.\n\n&amp;#x200B;\n\n**QQQ:**\n\nhttps://preview.redd.it/7xigs6v63ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=b21aa5cff8d8d35acb8c7c6c382e2146a93c5dee\n\nGoing to use QQQ this week because some of you are so smooth-brained that you didn't know there were any other NASDAQ ETF's and were so proud of yourselves trying to call me out about it.\n\nAnyway, looks like we've officially broken out of this falling wedge thanks to the big guys waking up (AAPL, GOOG, MSFT), the others are close behind.  I'd be looking for the $300 gap to fill leading into CPI, then a pullback because it's fucked, possibly down to around $285 support, maybe lower.  Ideally I'd be looking for re-entry / entry / adding to longs at a completed back-test of the trendline we just broke this week.  Regardless of what the Fed does this month, this rally has some legs and will continue for a while, or so the technicals are indicating...\n\nFor context of the reversal manifesting in the Weekly charts, QQQ's look just like SPY \n\nhttps://preview.redd.it/s1hg8thp2ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=4ff23ad7fe76267e16139bdc1f522c1b3dda2932\n\n**CPC**\n\nhttps://preview.redd.it/8ps3gi8w4ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=cc85e8cf9c1704b2233e1b62c3e7c18bff8134f0\n\nHere's a quick look at the put/call ratio, focus on the blue line (9-day MA).  Notice how June 14th we put in a lower high which coincides with the higher low in the indices this week, then crossing down below the 0.95 line breaking trend and confirming that people are becoming more bullish on the market.\n\n&amp;#x200B;\n\n**10Y**\n\nhttps://preview.redd.it/s10fttq16ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=86d685f1cc31199945aca3240ca54df8d0acc62b\n\nStill inside this rising wedge pattern on bearish divergence in the PPO and somewhat in the RSI.  Will still need to wait it out but it looks like a reversal is coming in both the 10 and 2 year, keeping in mind, we're STILL inverted since like Thursday of last week.\n\nLet's talk BANKS since we're coming up on earnings next week!\n\n**BAC:  Earnings 7/18**\n\nhttps://preview.redd.it/58ma3p1f8ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=fc928df6038897136505e52b56ce61ed524752a4\n\nBank of America has been in this falling wedge for a while and has recently started to show some bullish divergence in the RSI, not so much in the PPO though.  I think we have a pretty solid floor under us at around $31 which was resistance back in 2019.  We have a gap just above some potential resistance around $34 which I think we hit easily, will deal with the gap when we get there.\n\n**JPM:  Earnings 7/14**\n\nhttps://preview.redd.it/lsz06oej9ha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=6ab06934305b15c42978ca614eaf8f5808cfddb7\n\nJP Morgan Chase!  \nJP Morgan Chase!  \nJP Morgan Chase!  \nJPM has also been inside this falling wedge for a while with a bit better defined bullish divergence.  Again a solid floor under us with a nice rejection off of a previous gap left open since Nov. 2020.  Overhead resistance at $117.50-ish I think will be pushed through pretty easily and likely won't see much push back from the bears until the $125 gap.\n\n**GS:  Earnings 7/18**\n\nhttps://preview.redd.it/r68xe8pnaha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=ac0192b4927c8aa6793a16e89c8c6d94c5b29dd6\n\nI think I'm less confident in this one.  The falling broadening wedge is bullish but I'm not seeing as solid footing as the others at this point, we're kind of in the middle of support/resistance right now and the divergences in the RSI and PPO aren't really as convincing as JPM.\n\n**VIX**\n\nhttps://preview.redd.it/85h8p64abha91.png?width=5744&amp;format=png&amp;auto=webp&amp;s=5767b1fb31bcea6b4c71c31b66f28aa58f36e553\n\nYah, so what, i do TA on the VIX, wanna fight about it?\n\nShowing the 1-hr chart on this one to keep everyone on their toes.  Today we fell out the bottom of this falling wedge with bullish divergence still intact on the RSI, BUT burned through on the PPO, hopefully that trend continues into the PPO.  Lately the money glitch has been buy puts at VIX $25, buy calls at VIX $35 and I'm here to tell you that didn't work today.\n\nKeep an eye on this bastard though, if it claws its way back into this wedge then look for a big fat stinky dump shortly there after.\n\n**Conclusion:**\n\nI think Bond investors are flooding into equities right now so we're likely going to see continuation of this rally much to the perma-bear's chagrin.  I wouldn't get too comfortable though if you're long because at any moment they could decide to flood back into bonds as a safe haven, it really depends on that the Fed does at the July FOMC, till then however, I'll be buying the dip.\n\n&amp;#x200B;\n\nAny other tickers you retards wanna see, let me know.  I'm planning to do big tech next weekend.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vuur23/unsolicited_technicals_week_ending_7822_bank/",
    "score": 13,
    "author": "floppy_panoos",
    "created_utc": 1657345315,
    "num_comments": 9
  },  "vw9io7": {
    "title": "Expected Moves TSLA, AAPL, SPY, QQQ, IWM, GOOG, MSFT, AMZN for Week of July 11-July 15",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/falf8ssx6va91.png",
    "score": 13,
    "author": "[deleted]",
    "created_utc": 1657512777,
    "num_comments": 14
  },  "vw9dcd": {
    "title": "Expected Moves TSLA/AAPL/SPY/QQQ/IWM/GOOG/MSFT/AMZN July 11-July 15",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/00l3k45d5va91.png",
    "score": 2,
    "author": "[deleted]",
    "created_utc": 1657512263,
    "num_comments": 4
  },  "vw97o7": {
    "title": "Advice on the following stocks",
    "selftext": "I’ve been trading stocks for about a year now and would like to gather some opinons on the following stocks to hold in the long run. I’m thinking of holding for at least 5 years and hope to gain at least 10-15% yearly on my portfolio. Thanks!\nTSM \nGOOG \nAMZN \nAMD  \nBRK.B \nETSY \nMETA \nMU \nPYPL",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vw97o7/advice_on_the_following_stocks/",
    "score": 0,
    "author": "Prudent_Finding5479",
    "created_utc": 1657511737,
    "num_comments": 23
  },  "vx0pfc": {
    "title": "If S&amp;P drops to 3000 level, how much lower do you expect NVDA and AMD to go (already -55%)",
    "selftext": "I'm 60k invested in NVDA, 16k in MSFT, and 14k in GOOG. My worst-case scenario is S&amp;P dropping to the 2800-3100 range. Considering that AMD and NVDA stocks are already down around 55%, how much further do you expect them to go if it really happens? Just curious...",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vx0pfc/if_sp_drops_to_3000_level_how_much_lower_do_you/",
    "score": 12,
    "author": "RainieY",
    "created_utc": 1657594741,
    "num_comments": 23
  },  "vy7d42": {
    "title": "GOOG TO THE MOON",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vy7d42/goog_to_the_moon/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1657729593,
    "num_comments": 2
  },  "vz14c2": {
    "title": "GooG PUT PUT PUT PUT PUT PUT PUT PUT ~~~~~",
    "selftext": "",
    "url": "https://i.redd.it/g8yxe9jahkb91.jpg",
    "score": 22,
    "author": "Fine-Fault1901",
    "created_utc": 1657818965,
    "num_comments": 20
  },  "vzz7j9": {
    "title": "7-15-22 SPY/ ES Futures, VIX/ UVXY and AMD weekly TA",
    "selftext": "What a great week.. even with CPI day being a bust.. I had one of my best weeks in a while. So lets get to a few market things first before I touch on charts. I saw a really interesting chart today that shows the UMICH consumer sentiment vs the Russel 1000 that shows they are severely diverted from eachother. \n\nWhat does this mean? Well this is the furtherest they have ever been from eachother in the last 30 years. There is still a lot of people out there that thinks despite how far the market has come down that there is still a very long way to go. I would have thought CPI woulda started the next leg down but that is not the case… lets get into that a little bit. \n\nhttps://preview.redd.it/ntef185ersb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=205de0ab1f8401b1fea3bfa422dcde6a13c58da9\n\nYesterday the fed went from “we will not be doing a 100bps hike” to wow yeah man we really just might do a 100bps hike back today where now its down to a 17% chance of 100bps hike. The craziest thing about this all is if you look at the last CPI it jumped from 8.3% to 8.6% from April to May and JPOW shit himself and the markets did too with a massive 75bps hike that was not expected… now CPI is up 0.5% HIGHER than previous CPI (more than last time which was only 0.3%) and all of a sudden it doesn’t matter what we do rate hike wise and markets don’t care about 75 vs. 100bps hike? \n\nConfused? Me too… I touch on this a little below as to what I suspect is the true thing going on. \n\nhttps://preview.redd.it/t339fnversb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=79712e9d1e204460a4cb516d7c50ff700396a6fa\n\nhttps://preview.redd.it/ywwl1rffrsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=0a66c885ba69022317171ecd97d889ae0a25e885\n\nI mentioned on the CPI night that I think we are experiencing some psyops in the market… the media is fueling this rollercoaster and we are being led astray for now. It is even more evident by the VIX that the “fear” is being contained right now… \n\nhttps://preview.redd.it/86mdud1grsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=6863b2f55ecccf654fd87d8426b4d53b6f5ff82e\n\nThe VIX daily chart is very telling of current sentiment and that is that nothings going to take us down. After spy had 4 days of red this week and closed out today green for this week SPY is only down $0.72 cents on the week. They were close to closing this week out as a green week. \n\nThis is the lowest close on the VIX since June 8th. Interestingly enough June 8th was the top of the last trend before we crashed. Looking at the vix there is a case that we could see a bounce Monday around 23.9 on the VIX at that support level which would let SPY truly top before we start our next leg down. \n\nI am also now if we break through that 23.9 level under the impression that the markets are going to completely unwind the VIX down to 18-20 level before tesla earnings hit on Wednesday night. Tesla will be the first notable earnings that could move the markets and then the week after that is massive with MSFT, GOOG, APPLE, and META. Not only that but we also have FOMC on Wednesday the 27th and then GDP is on July 28th the next day. That GDP should confirm a recession. \n\nMany of you red my UVXY/ VIX calls post and I do believe I was correct. The one thing I am wondering is if I was wrong on the timing. I suspect markets to panic from CPI to FOMC like previously but I am wondering if markets are going to rally from CPI to FOMC and then once that week of earnings and FOMC and GDP happen markets then panic till the next CPI and FOMC. At this point I think watching for the VIX to hit 18-20 and UVXY to hit 11.5 again to go long on some 30-60dte calls is the way to go. This is the lowest close for UVXY since April 21st interestingly enough. UVXY also has not closed under 11.5 since January. So that will be a key level to watch for next week. \n\nhttps://preview.redd.it/hvek7kpgrsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=c236e9f122d5c176259d7aee8a1584d9aa7862f2\n\nThe one thing im really watching on the daily is the close of this candle. It is a hanging man LIKE candle but the wick is not long enough. So this could end up like a continuation candle similar to June 23rd instead of a reversal candle like May 17th. \n\nhttps://preview.redd.it/om58fu6hrsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=ee04dd25917171850484aaea0cbd89b3863abb7a\n\nThings to note here for a bull vs. bear case on daily and weekly chart. \n\nBull case- despite a bearish catalyst week we managed to close it with a dragonfly doji. Despite all the craziness we saw this week we saw a bullish finish to the week. We got our weekly 372 channel support test/ bounce. On the daily we broke through the red dotted resistance line which means we made a high high. We also close above the daily 8ema AND the daily 20ema for the first time since last Friday.  \n\nBear case- on the weekly we saw a new lower low for the third week in a row and that was also followed by the third lower high too. While we did not confirm resistance there is a VERY large descending wedge forming on the weekly chart. We have enough of the triangle left that there is a case we see a rejection next week followed by a descent below. Despite the bullish close today one could assume the last three days of bullish volume came from OPEX and how much downward OI there was. We now have a daily gap of $1.54 on the daily (note- this gap is actually closer to $2 as the daily movement of SPY never actually hit $379.05 on Thursday despite what the candles say). While historically gaps always fill we still have a 402 gap above unfilled so that is not something you can say anymore. \n\nDaily supports to watch- 382 à 379 (gap fill) à 375 à 370 (channel support) \n\nWeekly supports to watch- 372 (channel support) à 364 (weekly 200ema)\n\nDaily resistance to watch- 388 à 390 (downward channel support AND sideways channel support) à 393 à 398 à 402 (gap fill)\n\nWeekly resistance to watch- 388 (ascending wedge resistance) à 413 (downward channel resistance)\n\nWhat I am watching for is whether we are going to attempt to back fill this gap Monday or Tuesday or whether we are going to break through 390. 390 is a HUGE level for Monday. IF that level is broken then we are actually hella bullish. With no major earnings to really effect the market and no real economic data to effect it either till Thursday at open we just might see a hell of a ripper early next week. \n\nhttps://preview.redd.it/5zggc0vhrsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=9804cfbd004521003749725d4227a650c72d2392\n\nES daily actually looks a little different than SPYs. I mentioned yesterday that it looked like futures was turning bullish and it appears Thursday might be the temp bottom again. We did see a rejection of that blue dotted support line at 3867 EOD today though but it closed over the daily 8 AND 20 ema for the first time since July 8th (which ironically was top). \n\nI am watching on the daily for Mondays open if we see a red open and we hold resistance at 3850 we will most likely be headed for a back test of that key 3744 support. Sundays night open will be very very important to watch. Anything over 3850 Sunday is bullish for the week. \n\nDaily supports to watch- 3793 à 3744 à 3672 (channel support) \n\nDaily resistance to watch- 3850 à 3915 (channel support) à 4020\n\nhttps://preview.redd.it/305c46dirsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=946d2343961418ae9a82028e7630a4d59e9e8239\n\nFutures weekly chart is probably the most bearish of anything I have talked about yet. So it will be curious to see which one plays out. \n\nThe weekly chart actually confirmed the resistance of the descending triangle on Monday and closed with a true hanging man candle. This true hanging man candle has me suspect that we are going to see a retrace come Monday that takes us back down to that 3675 area. The futures charts are more skeptical and bearish then SPY itself. \n\nIf we were to have a mega bull week next week we could see not only the descending wedge broken (any open over 3875 breaks it) we could see the overall downward channel and the overall sideways channel broken. It would take an impressive 7.7% move to do it but with the way the markets are running its not impossible. Or we could see a retest of that channel and rejection which could confirm further downside in two weeks for FOMC/ earnings/ GDP.\n\nWeekly supports- 3830 à 3675\n\nWeekly resistance- 3875 à 4136 à 4165\n\nOverall SPY/ ES I would say I am bullish next week and will be looking to position to be bearish the following week. \n\nhttps://preview.redd.it/dwvgt6xirsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=2140f0ae9ed8cec493e005e038ff089b4b17dbcf\n\nAMD actually had a hell of a great day and week this week. AMD looks to on the daily have established a V shaped recovery at 71.6. My pre-market plan was to go long on AMD after it back tested 79.5 support and then go long with 7dte calls for next week looking for 87 range. I should have done it but I decided to wait. I am hesitant only that the markets are a little irrational right now. Most likely will regret that next week. \n\nDaily supports- 79.5 à 76.6 à 71.6\n\nDaily resistance- 83.8 à 87\n\nhttps://preview.redd.it/t7em8pjjrsb91.png?width=975&amp;format=png&amp;auto=webp&amp;s=a546f501675e7732e435ba25a37d583fd9868007\n\nAMD weekly is in a nice descending wedge too. The weekly candle is a hanging man so that worries me but it should be able to push through if it keeps up the same momentum. Overall we are looking for 87 resistance to be tested next week and to hold that v shaped support line. If we break through 87… 95-98 is on the table for sure. But any retracement below 77 would be noted as bearish omen. \n\n10% challenge-\n\nI had a great but boring day today. I did not like the open today as we dumped then ripped and had some wild candles. With the massively green open and UMICH sentiment I knew I was not going to go in until closer to 1030-11. By them we were already at the probable high of day IV wise and I was not going to play anything above that. My strategy is very strict about not going long/ short when SPY hits those levels. I also noticed that IV on SPY and AMD were hella high today and my mid day we got crushed. I watched 384.6 resistance hold all day long and EOD played a nice SPX (my first one) 0dte put scalp off the breakdown and then played a SPY 0dte call once biden was done talking and the volume came pumping in. Overall GREAT day and GREAT week. \n\nThis is actually the highest weekly WIN RATE year to date for me. This week I was EXTRA patient and really waited for my plays and waited for the chart to come to me. It made all the difference.\n\nhttps://preview.redd.it/kyjmp56krsb91.png?width=767&amp;format=png&amp;auto=webp&amp;s=4d897c2a6bc72def7c56986b3035d3b978e6594f\n\nI look forward to a good weekend to rest. I am sitting cash gang over the weekend. I was tempted to go long on SPY calls but decided to stick to what it old myself at the beginning of the month and do no swings. The biggest loss this week came from CPI day. It came from ANTICIPATING a play AND it came from trading while SPY was at the probable IV range. I did not stick to my guns that day and I did not let the chart come to me. I also double down on that loser which became 2x as big of a loser. Doubling down can work when tactfully done… but most of the time like I have said before don’t add to a loser to make it a bigger loser… I also took a loss on Monday due to TOS not filling my order completely which is a logistical issue I could not avoid and is part of the risk of 0dtes in the last 15minutes. \n\nOverall great week for me mentally and trading wise. Look forward to the weekend with the fam and seeing you guys back on Monday!",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/vzz7j9/71522_spy_es_futures_vix_uvxy_and_amd_weekly_ta/",
    "score": 65,
    "author": "DaddyDersch",
    "created_utc": 1657919235,
    "num_comments": 56
  },  "vznpbj": {
    "title": "Iceberg of GOOG investing. 20-1 split today after close",
    "selftext": "",
    "url": "https://i.redd.it/uwcn2ynq8qb91.jpg",
    "score": 74,
    "author": "kegzilla",
    "created_utc": 1657888704,
    "num_comments": 23
  },  "vznd65": {
    "title": "The GOOG investing iceberg. 20-1 split after close today",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/f98lsffg5qb91.png",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1657887665,
    "num_comments": 2
  },  "w1az08": {
    "title": "Almost freaked out.. but it’s just GOOG split and it didn’t readjust $ per share yet. :’)",
    "selftext": "",
    "url": "https://i.redd.it/mw69x9dbl5c91.jpg",
    "score": 38,
    "author": "Only_BlackTShirt_Guy",
    "created_utc": 1658074521,
    "num_comments": 8
  },  "w276ga": {
    "title": "$GOOG is cheap today 😀",
    "selftext": "",
    "url": "https://i.redd.it/3o2zy4ubjdc91.jpg",
    "score": 0,
    "author": "NNIICCEEE",
    "created_utc": 1658170709,
    "num_comments": 10
  },  "w1z05m": {
    "title": "CRIME and FUCKERY after GOOG splitvidend",
    "selftext": "Those pesky hedgies did again!\n\nHow many times do we have to witness OPEN CRIME?\n\nFor the last 2 years I have been communicating with Mr. John Leroy Henessy, founder and CEO of Google, through his cryptic tweets. After using advanced means of gathering data I realized all his tweets were exactly at 20:01.\n\nCouldnt just be a coincidence.\n\nI spent weeks analyzing his tweets as soon as they were posted, and came to the conclusion that this man was fighting against the big money and giving the little guy a chance of making generational money.\n\nAnd there was the announcement. A split through dividend. A… “splitvidend”, if you will. You guys don’t understand how genius this move was. \n\nSome of you may argue that this is a simple move to lower the price per share while literally changing nothing. You are dumbasses. See, let me repeat it again, it isnt a simple split. It is a SPLIT THROUGH MEANS OF A DIVIDEND.\n\nYeah, you read that right. We would receive 20 times our sharecount. My portfolio would literally 20x through the night. Nothing like these shitty 4x at the dying JPEG retailer. No, we are talking 20x, baby. Genius, absolutely genius.\n\nBut then, today I opened my ComputerShare app, tits absolutely jacked, ready to be a millionaire. I had received the 20x shares… **BUT THE PRICE FELL FOR THE SAME AMOUNT!**\n\n\nAt first I thought it was an error from ComputerShare (honestly, their site is kinda shitty). But then I googled the price and analysing the price I realized… they did it again… SHORT LADDER ATTACKS CELLARBOXING. And, as it *”CONVENIENTLY”* was the weeknd, THEY had an excuse to remove the buy button.\n\nTHEY cant keep getting away with this. I WILL be emailing the stock market manager and ask you do the same.\n\nIn the mean time, I keep buying, hodling and DRSing. The longer THEY keep doing it, the higher the floor.\n\nWe WILL be quadriollionaires. This is a war.\n\nLFG!!! (Lets fucking GOOGLE!).",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w1z05m/crime_and_fuckery_after_goog_splitvidend/",
    "score": 0,
    "author": "p0mphius",
    "created_utc": 1658149825,
    "num_comments": 25
  },  "w1ylr3": {
    "title": "Dear friends, I hope someone can explain this to me since I have no idea what is going on. I only have 1 GOOG and today is the stock split 20 for 1. The market is not open en today I saw this on my DEGIRO portfolio. Did Degiro crash or did a lot of people buy GOOG before the stock split?",
    "selftext": "",
    "url": "https://i.redd.it/1bwwsjuypbc91.jpg",
    "score": 1,
    "author": "yologangster801",
    "created_utc": 1658148728,
    "num_comments": 1
  },  "w444xs": {
    "title": "GOOG Freezes all hiring 1 week before earnings…",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w444xs/goog_freezes_all_hiring_1_week_before_earnings/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1658368630,
    "num_comments": 1
  },  "w6yqam": {
    "title": "YOLO: $GOOG co-founder Sergey Brin filed for divorce after his wife began cuckolding him with $TSLA's Elon Musk. Brin refused his wife's proposal of a 1-way polyamorous relationship. Brin is reportedly angry with Musk for not consulting him prior to having sex with his wife. Sell $GOOG? Buy $TSLA?",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w6yqam/yolo_goog_cofounder_sergey_brin_filed_for_divorce/",
    "score": 1,
    "author": "ReviewEquivalent1266",
    "created_utc": 1658677945,
    "num_comments": 0
  },  "w8xdp8": {
    "title": "$msft $meta $goog $coin lower ESTs priced in already?",
    "selftext": "What do y’all think? Bad news are priced in already and we’re witnessing a major bear trap? Or are we tanking again?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w8xdp8/msft_meta_goog_coin_lower_ests_priced_in_already/",
    "score": 1,
    "author": "adamzito1",
    "created_utc": 1658875120,
    "num_comments": 10
  },  "w8xao4": {
    "title": "Lower est already priced in. Bear trap across the board. $msft $meta $goog $coin",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w8xao4/lower_est_already_priced_in_bear_trap_across_the/",
    "score": 1,
    "author": "adamzito1",
    "created_utc": 1658874903,
    "num_comments": 2
  },  "w8wo8g": {
    "title": "Just to be clear:. GOOG numbers were dogshit, despite earnings expectations being toilet level. they missed A LOT",
    "selftext": "",
    "url": "https://i.redd.it/9mz5gxonkzd91.jpg",
    "score": 766,
    "author": "Dick_Goblair",
    "created_utc": 1658873355,
    "num_comments": 558
  },  "w8wet3": {
    "title": "Just be be clear — GOOG numbers were dog shit despite having toilet level earnings expectations",
    "selftext": "[deleted]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w8wet3/just_be_be_clear_goog_numbers_were_dog_shit/",
    "score": 0,
    "author": "[deleted]",
    "created_utc": 1658872738,
    "num_comments": 1
  },  "w8vzz9": {
    "title": "GOOG revenue in at $69.69b!!🚀🌙",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w8vzz9/goog_revenue_in_at_6969b/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1658871711,
    "num_comments": 1
  },  "w8vyew": {
    "title": "GOOG revenue in at $69.69!! 🚀🌙",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w8vyew/goog_revenue_in_at_6969/",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1658871610,
    "num_comments": 1
  },  "w8vxg2": {
    "title": "GOOG revenue $69.69 billion! 🚀 🌙",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/xywzurw5fzd91.jpg",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1658871544,
    "num_comments": 1
  },  "w8vs4o": {
    "title": "to be clear — GOOG numbers were ass despite the toilet level earnings expectations",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/dyz08cb6ezd91.jpg",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1658871179,
    "num_comments": 2
  },  "w8vp7u": {
    "title": "Just to be clear — GOOG numbers are horrendous despite toilet level earning expectations",
    "selftext": "[deleted]",
    "url": "https://i.redd.it/a5pn0pkmdzd91.jpg",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1658870990,
    "num_comments": 2
  },  "w880n1": {
    "title": "Why Goog is such a powerhouse",
    "selftext": "",
    "url": "https://www.reddit.com/gallery/w880n1",
    "score": 13,
    "author": "Guysmarket",
    "created_utc": 1658803579,
    "num_comments": 16
  },  "w87yfz": {
    "title": "Why Goog is such a powerhouse",
    "selftext": "[deleted]",
    "url": "https://www.reddit.com/gallery/w87yfz",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1658803407,
    "num_comments": 1
  },  "w9sama": {
    "title": "AAPL EPS regression",
    "selftext": "Hi tardos,\n\n&amp;#x200B;\n\nbased on EPS historical data of some companies (GOOG,MSFT,META) i have easily calculated a linear regression model for AAPL EPS:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4r66yldbm6e91.png?width=1300&amp;format=png&amp;auto=webp&amp;s=891e2c01badfd580144fb69f2eec4c490f6dce15\n\ndatasource [https://tradingeconomics.com/](https://tradingeconomics.com/):\n\n&amp;#x200B;\n\nthe linear regression analysis gave me a 0.8 R\\^2 function (not bad) with a 0.3 standard error\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h88uqnagm6e91.png?width=321&amp;format=png&amp;auto=webp&amp;s=9a3d87286907b8905191230e122640000e6b79f4\n\nEstimated EPS is 1.15 while regression EPS is 1.34 +-0.3.\n\nSo, why such a big difference? \n\nIDK",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w9sama/aapl_eps_regression/",
    "score": 6,
    "author": "Actual_Mycologist859",
    "created_utc": 1658961514,
    "num_comments": 5
  },  "w961zr": {
    "title": "I am not uncertain about GOOG and MSFT puts tomorrow. #inverseCramer",
    "selftext": "",
    "url": "https://i.redd.it/5p7kip5zp1e91.jpg",
    "score": 26,
    "author": "safaria2",
    "created_utc": 1658899357,
    "num_comments": 6
  },  "w90gk6": {
    "title": "Can you trust the data? $GOOG P/E valuation looks much better of what it really is.",
    "selftext": "Quick question? What is Google (Alphabet) Forward P/E? If you answer something below 20 then you have been cheated.\n\nThe usual websites to show this data that are free are Yahoo Finance and Finviz.\n\nWell, both commit the same mistake:\n\n* [Forward P/E of $GOOG on Finviz: 16.30](https://finviz.com/quote.ashx?t=GOOG)\n* [Forward P/E OF $GOOGL on Finviz: 16.41](https://finviz.com/quote.ashx?t=GOOGL)\n* [Forward P/E of $GOOG on Finviz: 19.01](https://finance.yahoo.com/quote/GOOG/key-statistics?p=GOOG)\n* [Forward P/E of $GOOGL on Finviz: 18.90](https://finance.yahoo.com/quote/GOOGL/key-statistics?p=GOOGL)\n\nGuess what? The real number is bigger than those! Because this websites are taking the earnings of Google as a whole but then they are splitting that earnings between half of the shares (half for $GOOG and half for $GOOGL as if those were independent companies!)\n\nIf that is not a pro-trick that deserves twice the valuation I don't know what it is. Hats off to Google!\n\nThe right number can be calculated from [their last earnings report](https://abc.xyz/investor/static/pdf/2022Q2_alphabet_earnings_release.pdf):\n\n* Outstanding shares (Class A,B,C) =&gt; 64,402 Millions\n* Total income on 2022-Q2 =&gt; 69,685 Millions\n* Forward P/E at $110 the share = (64,402 \\* 110) / (69,685 \\* 4) =&gt; **25.41**\n\nAnother way to  verify this is by checking that the float (or outstanding shares) reported on this websites is much less than the declared 64 Billions they declare on their earnings reports.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/w90gk6/can_you_trust_the_data_goog_pe_valuation_looks/",
    "score": 11,
    "author": "polloponzi",
    "created_utc": 1658883193,
    "num_comments": 13
  },  "wc8j9v": {
    "title": "Rate My Portfolio",
    "selftext": "Not exact percentages of portfolio but close. I plan on continually investing money across all my holdings.\n\nVOO 25%\n\nAAPL 13%\n\nMSFT 13%\n\nNVDA 8%\n\nQQQ 7%\n\nVUG 6%\n\nVTV 5%\n\nFTEC 5%\n\nVDC 4%\n\nVYM 2%\n\nKO 2%\n\nAMZN 1%\n\nVHT &lt;1%\n\nPG &lt;1%\n\nWMT &lt;1%\n\nTSLA &lt;1%\n\nUNH &lt;1%\n\nGOOG &lt;1%\n\n6% Cash",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wc8j9v/rate_my_portfolio/",
    "score": 0,
    "author": "Inner_Astronaut_7137",
    "created_utc": 1659218323,
    "num_comments": 29
  },  "wdrux9": {
    "title": "Bear market has been canceled?",
    "selftext": "Individual Investors Ramp Up Bets on [\\#TechStocks](https://twitter.com/hashtag/TechStocks?src=hashtag_click) Shares of [$AMZN](https://twitter.com/search?q=%24AMZN&amp;src=cashtag_click), [$GOOG](https://twitter.com/search?q=%24GOOG&amp;src=cashtag_click), [$META](https://twitter.com/search?q=%24META&amp;src=cashtag_click) and others have suffered double-digit declines, but believers say they expect a rebound.\n\nOr this is the largest bull trap ever?\n\nhttps://preview.redd.it/8mpizrx1y5f91.png?width=1200&amp;format=png&amp;auto=webp&amp;s=c1b4f7aa7f5e45986f006a34f7125341e6ca8591",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wdrux9/bear_market_has_been_canceled/",
    "score": 29,
    "author": "Delicious_Reporter21",
    "created_utc": 1659386367,
    "num_comments": 51
  },  "wivboi": {
    "title": "Headed to the moon, but gotta stop at Wendy’s first….🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
    "selftext": "$goog (every kid has a chrome book)  $ttd (they know what you want and also what you just bought) $maxr (seen a scene from space lately?)  $rivn and $fsr (ev vehicles)  $chpt (ev charging stations, crucial!)  $nvda (robots teaching robots)  $pypl (Venmo) $rblx (Nike backpacks in the metaverse) and finally  $pltr (Peter thiel bonks)   See you all in Tahiti this winter!",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wivboi/headed_to_the_moon_but_gotta_stop_at_wendys_first/",
    "score": 11,
    "author": "sickter6",
    "created_utc": 1659920522,
    "num_comments": 9
  },  "wkezc7": {
    "title": "Bbby🚀",
    "selftext": "Sold my way otm leap calls on goog,Apple and Amazon for bbby. I was already on my bbby 8/19 45c and now I re enter with a better position 🤡🤡 smooth braen 🦍!!",
    "url": "https://www.reddit.com/gallery/wkezc7",
    "score": 1,
    "author": "rclr-",
    "created_utc": 1660079890,
    "num_comments": 1
  },  "wjy583": {
    "title": "AVYA$ is a goog buy?",
    "selftext": "Hey apes, i have follow this stock and it reached it all time low last month.\nThey will have a bad ER today but i think this can only go up from now.\nWhat do you think?\nAlso this is not a financial advise i can barely write.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wjy583/avya_is_a_goog_buy/",
    "score": 9,
    "author": "xCAOSx",
    "created_utc": 1660034732,
    "num_comments": 16
  },  "wjy0aa": {
    "title": "Look, forget your TA, fundamentals ultimately matter in this Environmnet",
    "selftext": "Boys, \n\nI know why you're bullish. Bears are repeating what they've heard from their favorite Tiktok analyst about QE, how our economy can't handle 3%+, etc. When the shoe shine boy says the doom is here, inverse that fucker. But look, I looked. I looked at Alphabet, Meta, Amazon, Nvidia, and your mom. I've got mom fetishes like I got 10-Q fetishes, and the generals--the kings of the Nasdaq? They're getting old. They had their best years. What do you think covid represented? The peak of technology. You think it gets better from here? AWS gonna keep breaking records? Think advertsing in Google and Meta are going to go up when we have TikTok, the new advertising king? If your dumbass company hasn't already switched its marketing budgeting and accruals to tiktok spend, your company is lagging. Only boomers use facebook now. Google hasn't done anything innovated in 10 years. AND **TSLA??????** REALLY???????? Do you know Elon just bought the idea from the real innovate guys from his  Paypal equity? That doesn't really matter, but look. I learned literally probably five important things pursuing a useless ass Economics degree. One of those is that **CAPITAL INTENSIVE COMPANIES ARE LITERALLY THE WORST COMPANIES TO INVEST IN. The one thing that separates TSLA from its competitors is not its innovation-- fucking everyone's got the same shit as them.** ***Elon has been promising FSD tech for a 2.625 years. He's been telling you lies and financing everything from equity investment.. Why raise capital through debt, when there's a limited liability through equity financing? But in the end,*** **Man's been overpromising and undelivering. Always, and forever. Someone once told me \"the chicken comes home to roost.\" He was talking about CMG when I told him it was a good investment after its salmonella poisoning, so he was wrong. But that quote has stuck with me. Elon isn't really Steve Jobs, its all a façade. He's a fraud, whose been able to get away with it because he figured out equity financing is always better than debt financing. What a fucking genius. If you rely on equity financing you don't have any real liabilities. You just need to convince people you're fucking reputable. Man's worth 222+ billion now, so it's more likely I die before my man Elon gets exposed. But fuck em. I'll tell you something. Elon's company, just like AAPL, just like NVDA, AMD, AMZN, etc., -- we're fucking fucked. Why? The dream is never as good as reality.** \n\n&amp;#x200B;\n\nEnough yelling. Let me tell you something about human nature. **We count our chickens before they roost; we rest on our laurels.** God damn you see you that ring true in America. Fucking  Fucking Americans have so much security BEING American. We have Americans claiming they're so damn good when Elon has skewed average income to levels average persons never reached. We got bulls celebrating commodities peaking from UNSUSTANAIBLE LEVELS. Man, chill, that's the 1% carrying our relatively average country. **American Exceptionalism, \"but that's another topic\" - drake. You think you're really something special? Only a few really do anything imaginative.**  I'm tryna tell you guys, we're built on a house of cards. Most money is allocated in the aforementioned companies( 401k's passive investing) ...The USDhas been rising when only about 40% of the big companies receive their revenue in foreign currency, before needing to exchange to strong USD (NEGATIVE BTW) . **Negative because our revenue and bottom line is negatively impacted by foreign exchange impact (you'll hear this a lot moving forward in earnings calls when google, msft miss).**\n\n&amp;#x200B;\n\n**I've been thinking about this for awhile, done the fucking numbers and will go out on a limb now that we're in this short squeeze rally. Google, MSFT, AMZN, CMG, KO, AND (POSSIBLY) APPLE, WILL NEVER GENERATE THE FCF, OPERATING INCOME, EARNINGS, etc. -- PER SHARE, THAT WE EXPECT. They will trade like BUD, MO, T. VZ, BA, etc in the future. Looks like a general market squeeze going on right now because the shoe shine boy is hollering dooom and gloom, but soon, he'll sing song of good times when the market goes green as it has. That is the time, from now to about 13.8k on Nasdaq, 430 on SPY, when the squeeze has squoze and you'll see. You'll see the chicken come home to roost. All the liquidity be sucked up, fed fund at 125 bps higher than today, and maturities of bonds without reinvestment**\n\n&amp;#x200B;\n\n **You'll see, and it'll probably be after you do anything about it.**\n\n&amp;#x200B;\n\n**Wish you all the best, but only a few end up with the bread in the end.**\n\n&amp;#x200B;\n\nPositions: DCA'ing debit put spreads biweekly in AMZN, TSLA, GOOG, SPY, TQQQ, 60-180 days exp.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wjy0aa/look_forget_your_ta_fundamentals_ultimately/",
    "score": 2,
    "author": "1xndsu",
    "created_utc": 1660034216,
    "num_comments": 14
  },  "wmv29w": {
    "title": "GOOG and DVN Going to blow up next week for sure !!! Both will increase 15-30 percent Don’t miss it . 🦈📈💲",
    "selftext": "[deleted]",
    "url": null,
    "score": 3,
    "author": "[deleted]",
    "created_utc": 1660335976,
    "num_comments": 6
  },  "wmuzyb": {
    "title": "GOOG and DVN Going to blow up next week for sure !!! Both will increase 15-30 percent Don't miss it . 🦈📈💲",
    "selftext": "[deleted]",
    "url": null,
    "score": 0,
    "author": "[deleted]",
    "created_utc": 1660335805,
    "num_comments": 2
  },  "wpsn7m": {
    "title": "Saudi Arabia's Public Investment Fund (PIF) purchased 213,000 shares Alphabet Inc (NASDAQ:GOOG), and Microsoft Corporation (NASDAQ:MSFT).",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wpsn7m/saudi_arabias_public_investment_fund_pif/",
    "score": 1,
    "author": "Neodymium32",
    "created_utc": 1660651747,
    "num_comments": 0
  },  "wsj257": {
    "title": "STOCK MARKET MAGIC",
    "selftext": "Put money in and watch it disappear. There are no goog holdings today, or most days. Memes, good earning. Bad earnings doesn't matter hedges. Cohens, will finCohen, to fuck you. After 5 years playing I wish I'd never met Trading! \nCould have had a better time throwing $ into firepit and roasting marshmallows at least the cash would serve a purpose. F U Cohen, F U Hedgies, F U Fed.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wsj257/stock_market_magic/",
    "score": 13,
    "author": "TJCapital",
    "created_utc": 1660928382,
    "num_comments": 3
  },  "wvbse0": {
    "title": "Zoom is struggling to convince consumers to pay, and the stock is sliding",
    "selftext": "https://www.marketwatch.com/story/zoom-video-cuts-earnings-and-revenue-outlook-for-the-year-stock-falls-11661199597?mod=mw_latestnews\n\nZoom Video Communications Inc. is struggling to convince people to pay for its videoconferencing service in the third year of the COVID-19 pandemic, contributing to a trimmed forecast and falling stock price Monday.\n\nZoom ZM, -2.07% executives reduced their earnings and revenue guidance for the fiscal year Monday afternoon, and Zoom Chief Financial Officer Kelly Steckelberg blamed a stronger U.S. dollar — a problem many global tech companies have called out in recent earnings reports — but also a decline in “the online business,” or the more casual Zoom user.\n\n“Our revenue was impacted by the strengthening of the U.S. dollar, performance of the online business, and to a lesser extent sales weighted to the back end of the quarter,” Steckelberg said in a statement included with the results.\n\nIn an interview with MarketWatch and a conference call Monday afternoon, Steckelberg acknowledged that individuals and small businesses have changed their habits. Many aren’t flocking to the service as often or for as long as they did during the peak of the pandemic, when many Americans were working almost exclusively from home and socializing with friends over the service. An increase in one-on-one meetups, vacations and hybrid work schedules have altered the post-pandemic business cycle for Zoom, executives acknowledge, and getting users to pay is harder.\n\n“The big challenge is new customer additions,” she said.\n\nZoom recently installed a 40-minute limit on users with a Basic, or free, subscription, which Mizuho Securities analyst Siti Panigrahi said could be a way to push more users to become paying subscribers. Steckelberg told MarketWatch that the time cap has had a “significantly positive impact” so far, but admitted in the conference call it was “not enough to overcome the macro dynamics.”\n\nThe news wasn’t all bad — Zoom’s enterprise business, which sells subscriptions to larger organizations, grew 27% to $599 million. Enterprise customers improved 18% to 204,100 over the past year through contracts with UCLA, Warner Bros. Discovery Inc. WBD, -7.43% and others, as well as longer deals. Zoom Phone licenses hit a record of nearly 4 million, up more than 100% year-over-year.\n\n“It was a mixed quarter, with enterprise proving to be strong,” Steckelberg told MarketWatch.\n\nThe ongoing friction between employees who wish to continue to work from home and employers like Apple Inc. AAPL, -2.30%, Alphabet Inc.’s GOOGL, -2.53% GOOG, -2.58% Google and Facebook parent company Meta Platforms Inc. META, -2.92% — all of whom are sitting on acres of unused commercial real estate and asking workers to come in at least twice a week — could have a profound impact on Zoom. A group of Apple employees on Monday launched a petition asking CEO Tim Cook for a more flexible work policy.\n\nThe company also faces stiff competition from Microsoft Corp. MSFT, -2.94%, Cisco Systems Inc. CSCO, -2.03%, Google and many other corners.\n\nM Science’s software analyst Charles Rogers believes users aren’t jumping to other platforms, but cutting the service because of inflation and more relaxed pandemic guidelines. He also saw more worrisome results internationally than in the U.S., with a second consecutive quarterly decline in the European region and sequentially flat sales in the Asia Pacific quadrant.\n\nRead more: Zoom faces a threat from Microsoft Teams, but how great is the risk?\n\nZoom posted fiscal second-quarter net income of $45.7 million, or 15 cents a share, on revenue of $1.1 billion, up from $1.02 billion a year ago. After adjusting for stock compensation and other effects, Zoom reported earnings of $1.05 a share, down from $1.36 a share last year. Analysts surveyed by FactSet had expected adjusted net income of 94 cents a share on revenue of $1.12 billion.\n\nZoom executives said they now expect full-year adjusted earnings of $3.66 to $3.69 a share on revenue of roughly $4.39 billion, down from $3.70 to $3.77 a share on sales of $4.53 billion to $4.55 billion. For the third quarter, they expect 82 to 83 cents a share on revenue of about $1.1 billion, while analysts on average had been projecting 92 cents a share on sales of $1.15 billion, according to FactSet.\n\nZoom shares declined nearly 9% in after-hours trading following release of the results, after closing with a 2.1% decline at $97.44. Zoom’s stock is down 47% so far in 2022. The broader S&amp;P 500 index  SPX, -2.14%  has slid 13% this year.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wvbse0/zoom_is_struggling_to_convince_consumers_to_pay/",
    "score": 8,
    "author": "Guilty-Ham",
    "created_utc": 1661219325,
    "num_comments": 15
  },  "wyvvml": {
    "title": "today i am buying $2m $tsla",
    "selftext": "and, \n$600k in coins\n$800k in goog.\n$500k in bbby\ni have contacted my business loan bank and ask all of that because i know it will give me back all that i am spenting with X500%. What you will do for your future, your kids ?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/wyvvml/today_i_am_buying_2m_tsla/",
    "score": 0,
    "author": "Separate-Split-7741",
    "created_utc": 1661582756,
    "num_comments": 8
  },  "x0p3eg": {
    "title": "City of Vienna blows ~10 billion in option speculation",
    "selftext": "Statement by the finance ministry:\n\nOriginal German: [https://www.top-news.at/2022/08/29/stellungnahme-des-finanzministeriums-zur-wien-energie/](https://www.top-news.at/2022/08/29/stellungnahme-des-finanzministeriums-zur-wien-energie/)\n\nTranslated: [https://www-top--news-at.translate.goog/2022/08/29/stellungnahme-des-finanzministeriums-zur-wien-energie/?\\_x\\_tr\\_sl=auto&amp;\\_x\\_tr\\_tl=en&amp;\\_x\\_tr\\_hl=en&amp;\\_x\\_tr\\_pto=wapp](https://www.bmf.gv.at/presse/pressemeldungen.html)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/x0p3eg/city_of_vienna_blows_10_billion_in_option/",
    "score": 52,
    "author": "moden_",
    "created_utc": 1661780515,
    "num_comments": 26
  },  "x1y7dp": {
    "title": "To all the Shills out there saying GME can't happen again. You're welcome",
    "selftext": "I'm assuming you were too young at the time or maybe forgot since humans clearly forget shit all the time, especially when it goes against their thinking.\n\nDo you all not remember the famous **Volkswagen** (**VW**) squeeze of 2008? Shit went ballistic and **gained like 400%+ in 2 days**. VW became the world's #1 most valuable company for a short time during the squeeze. ***(Estimations shorts lost almost $40 billion.)***\n\n**-** **HerbalLife** **(HLF)** got squeezed when Ackman and Icahn duked it out....Icahn won and walked away +$1billion, ***Ackman covered for double his entry, so figure out that loss*** LMAO.\n\n**-** **Tesla** **(TSLA)** ***(Estimations of short losses of $40 Billion in 2020)*** \\- *I don't need to hear about how great TSLA is*. TSLA was **THE MOST** heavily shorted stock in the world in mid 2020. How do you think it's so fucking high in value and went ballistic and 10x in less than 1 year? Now its gone literally nowhere for almost 2 years. The shorts getting fucked hard had a LOT to do with TSLA epic 2020 run. Cherry picking here, from Jan '21 to now, TSLA is about even, maybe slightly down -2%. 600 days later, a shit ton of sales and growth, new models, new factories, etc and other good shit, and its gone nowhere because people learned to fear shorting TSLA.\n\n**-** **Gamestop** **(GME)** ***(Estimations of short losses of $20 billion)*** needs no introduction but it was $4 pre-split and in pre-split terms went to $400+ and still sitting at pre-split $120 and about pre-split $200 a month ago. You're telling me GME went from $4 to $120-$200 range because RC is turning it around with NFTs no one gives a fuck about anytime soon? What's his play, sell video games online? Platforms already do that. Or let me guess, going to offer everyone 1 penny for their trade-ins instead of 2 pennies? LMFAO...What moat does GME have that any Megacap like GOOG, META, AMZN, MSFT, etc etc can't copy or do better? Fuck it, Netflix probably has more customers and a better chance selling NFTs than GME LMFAO. Even dare I say Robinhood could probably do it better.\n\n**Shit does not need to make sense nor be rational.** If your argument against BBBY going to $30, $50, $100, or $500 is the \"value\" of BBBY isn't worth that much and that is an irrational price target, then you are completely mistaken and don't understand how the market works. BBBY could become the world's most valuable company this week if there were enough shorts getting their nuts squeezed off. Of course, this is completely irrational and beyond unrealistic but you get my point.\n\nNow I know everyone is expecting some epic news release tomorrow and the price to rip to $30 but that isn't going to happen. Stop being dumb and unrealistic. Strategic news is not some magical saving grace and automatic doubling of revenue everyone dreams about. The news will 100% give the shorts a reason to attack the fuck out of the stock and since everyone is impatient and a little paper-handed bitch, BBBY WILL drop like a MOFO tomorrow. Stop being little bitches and hold your panties up with those diamond hands. Don't drop 'em for the hedgies. **Stop Losses are for losers!**\n\nShills, let's see you change my mind...\n\n&amp;#x200B;\n\n**TLDR: Stocks have been squeezed crazy high for ages. Let me repeat to you extra regarded apes in the back. SQUEEZED FOR FUCKING AGES with billllllions in losses. It CAN happen again and will continue to happen over and over and over forever until shorting a stock is illegal.BBBY to the MOON mothfuckas! GODSPEED**\n\n*Disclaimer:\\*This is not financial advice. The stock market casino IS gambling and you SHOULD expect to lose money. Please gamble at your own risk. Call 1-800-GAMBLER if you need help with a gambling problem.I am long BBBY with 2000 shares and will be holding for WHEN it hits $100 and beyond.*\n\n&amp;#x200B;\n\n\\*\\*\\*\\*\\* EDIT FOR ALL THE EXTRA SHILLY ONES OUT THERE WHO ARE 100% CONFIDENT BBBY = DEATH: \\*\\*\\*\\*\\**Please excuse my rounding below. The numbers are perfect but fairly close to make my point.*\n\n**GME RECAP** of all the times it **\"died\"** like **BBBY** lol\\*\\*:\\*\\*  \n$4 --&gt; $160      *(+3800% or so)*  \n$160 --&gt; $60   **(-62%. It's definitely dead and done. Was fun while it lasted)**  \n*But wait, there's more!*  \n$60 --&gt; $500    *(another +700-800% or so run)*  \n$500 --&gt; $39   **(-92%. Okay, NOW it's safe to say it, definitely 100% without a doubt D.E.A.D. Nothing can come back from -92%)**  \n*Think again mothafuckas!*  \n$40 --&gt; $180    *(yet ANOTHER +400% rip over 2 days. That was quick)*  \n$180 --&gt; $85    **(-56%, 3rd time is a charm. Never again will this shit see a price above $100 or I'll eat a monkey dick. That last one was a fluke.)**  \n$85 --&gt; $340    *(ANNNNNND ANOTHER +300% moonshot. Thank you sir, may a have another?)*  \n*etcetera...*\n\n**TLDR #2: No one knows shit. So stop acting like everyone knows this is mooning or tanking tomorrow or the next day or any day after that. Stocks are gambling. LFG! LMFAO**\n\nEDIT #3 : BBBY needs to keep interest/announcements/catalysts coming. THAT is what squeezed TSLA and THAT is what squeezed GME. BBBY has a solid shot just like anything else if the positive news can keep flowing regardless of what it is exactly.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/x1y7dp/to_all_the_shills_out_there_saying_gme_cant/",
    "score": 704,
    "author": "skeletor00",
    "created_utc": 1661902839,
    "num_comments": 175
  },  "x4u36r": {
    "title": "GOOG Failure-to-Deliver In-The-Millions",
    "selftext": "",
    "url": "https://i.redd.it/ovs6oelndkl91.jpg",
    "score": 1,
    "author": "Neodymium32",
    "created_utc": 1662210620,
    "num_comments": 0
  },  "x6j8mi": {
    "title": "What do you think of MATANA? Is this a new market indicator? Is it fair to drop META and NETFLIX, and welcome TESLA?",
    "selftext": "[MATANA](https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/tech-stocks-matana-is-the-new-faang-analyst-says-145511543.html)\n\nWang argued that MATANA — Microsoft (MSFT), Apple (AAPL), Tesla (TSLA), Alphabet (GOOG, GOOGL), Nvidia (NVDA), and Amazon (AMZN) – is an upgrade to FAANG by dropping Meta (META) and Netflix (NFLX) while adding Microsoft, Tesla, and Nvidia.\n\nAny opinion on MATANA?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/x6j8mi/what_do_you_think_of_matana_is_this_a_new_market/",
    "score": 1,
    "author": "Any_Hedgehog_7065",
    "created_utc": 1662392448,
    "num_comments": 11
  },  "x9pmpk": {
    "title": "GOOG Technical Analysis",
    "selftext": "https://ibb.co/WNXMg57\n\nBat formation has developed in Google. For month of September stock traded in tight range consolidating coiling for next move. Formation has target of $113 . However if price starts to move up no major resistance level until $122. Microsoft and Amazon have similar set ups. For all three mega caps to move will indicate short term bear rally it’s about to take place. Price pattern invalidated at $102.\n\nUpdate 9/17\n\nOn 9/12 price hit 112.75 and than CPI data released. There is a gap to 97.50 if 100 fails than next support will be 92. Will all depend on FOMC.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/x9pmpk/goog_technical_analysis/",
    "score": 4,
    "author": "JMichael12T",
    "created_utc": 1662711004,
    "num_comments": 4
  },  "xc9ztp": {
    "title": "9/9 P&amp;L Webull $62,000 profit from SPX, TSLA, GOOG, AMZN, BA, AMD Calls all 7D spreads!",
    "selftext": "",
    "url": "https://i.redd.it/enu1fhp3ven91.jpg",
    "score": 1,
    "author": "OptionsGuruDiscord",
    "created_utc": 1662981107,
    "num_comments": 0
  },  "xfe9e5": {
    "title": "This is what we have come to, when trillion dollar companies ask employees to share a bagel at meetings $amzn $goog let's beat earnings by a penny!",
    "selftext": "",
    "url": "https://i.redd.it/b4xacfzem4o91.jpg",
    "score": 394,
    "author": "UltimateTraders",
    "created_utc": 1663292961,
    "num_comments": 190
  },  "xfe6gi": {
    "title": "This is what we have come to, when trillion dollar companies ask employees to share a bagel at meetings $amzn $goog let's beat earnings by a penny!",
    "selftext": "[deleted]",
    "url": "",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1663292720,
    "num_comments": 2
  },  "xptgqs": {
    "title": "Over 20% of the S&amp;P 500 is made up of 5 stocks, let's look into each! [My thoughts on each with a short DD on all]",
    "selftext": "Warren Buffett, the 4th richest American (worth $100 Billion) recommends investing in an S&amp;P 500 Index Fund.  Over 20% of the S&amp;P 500 is made up of 5 stocks:\n\n* 7.3% Apple [$AAPL](https://twitter.com/search?q=%24AAPL&amp;src=cashtag_click)\n* 5.7% Microsoft [$MSFT](https://twitter.com/search?q=%24MSFT&amp;src=cashtag_click)\n* 3.6% Google [$GOOG](https://twitter.com/search?q=%24GOOG&amp;src=cashtag_click) [$GOOGL](https://twitter.com/search?q=%24GOOGL&amp;src=cashtag_click)\n* 3.3% Amazon [$AMZN](https://twitter.com/search?q=%24AMZN&amp;src=cashtag_click)\n* 2.5% Tesla [$TSLA](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click)\n\nAlso, the S&amp;P 500 is America's largest companies, and returned \\~11% each year on average, over the last 96 years. (Since 1926 the S&amp;P 500 has increased about 1,300,000%). Let’s also look at other popular holdings:\n\n* 1%- NVidia [$NVDA](https://twitter.com/search?q=%24NVDA&amp;src=cashtag_click)\n* 1% JPMorgan [$JPM](https://twitter.com/search?q=%24JPM&amp;src=cashtag_click)\n* 1% Mastercard [$MA](https://twitter.com/search?q=%24MA&amp;src=cashtag_click)\n* 1% Costco [$COST](https://twitter.com/search?q=%24COST&amp;src=cashtag_click)\n* 1% Walmart [$WMT](https://twitter.com/search?q=%24WMT&amp;src=cashtag_click)\n* 1% Disney [$DIS](https://twitter.com/search?q=%24DIS&amp;src=cashtag_click)\n\n&amp;#x200B;\n\nNow let's also talk about these:\n\n&amp;#x200B;\n\n**Apple** [**$AAPL**](https://twitter.com/search?q=%24AAPL&amp;src=cashtag_click)**:**\n\n* Apple iCar &amp; Augmented Reality products in the pipeline\n* Apple Pay is #1 mobile payment system in US\n* 1.5 billion+ active devices in ecosystem, with devices to be replaced every few years\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\nhttps://preview.redd.it/xx44sw9hygq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=bf2c8fe9da3ec897ffca6151b2849003dc99b81b\n\n[source: prospero.ai](https://preview.redd.it/i6kxf6i8zgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=b7a9a9110d4a8c1e013c1987f1dd4b7cad9e5a85)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Microsoft** [**$MSFT**](https://twitter.com/search?q=%24MSFT&amp;src=cashtag_click)**:**\n\n* Dominance in cloud computing space\n* Azure is growing faster than Amazon's AWS\n* Azure has a large and constantly growing market share for the Cloud Computing market\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Social Sentiment\n* Institutional Flow\n\nhttps://preview.redd.it/qckz6nz8zgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=5d949958156851a74ba43604b3340e0f46307610\n\n[prospero.ai](https://preview.redd.it/2x1a6dz9zgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=42dbc35550c6ee43cc4b76be99000b69846c6f40)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Alphabet/ Google** [**$GOOG**](https://twitter.com/search?q=%24GOOG&amp;src=cashtag_click) [**$GOOGL**](https://twitter.com/search?q=%24GOOGL&amp;src=cashtag_click)**:**\n\n* MOAT on the online ad market\n* Leader in quantum computing\n* Strong balance sheet\n* Healthy cash flow\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\nhttps://preview.redd.it/lkg8s3tazgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=cdc4fc49e58589d69c5c1f5b0f07cde6b84d057b\n\n[prospero.ai](https://preview.redd.it/ynuhserbzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=ab026c28d3267c697839957338f86d7ce522b8a0)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Amazon** [**$AMZN**](https://twitter.com/search?q=%24AMZN&amp;src=cashtag_click)**:**\n\n* Largest in cloud infrastructure space\n* Health care services growth (health care spending accounts for \\~20% of the economy)\n\n**Data shows great:**\n\n* Upside Breakout\n* Social Sentiment\n* Institutional Flow\n\nhttps://preview.redd.it/zqzsd6bczgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=34494a38ae4438e15515056a7fd527b873e654f2\n\n[prospero.ai](https://preview.redd.it/k8ld3b9dzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=114bcc96c1de00dcb84976084b489aa43e083863)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Tesla** [**$TSLA**](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click)**:**\n\n* Low battery costs, self-designed A.I. chips &amp; data it has collected from billions of miles of real-world driving from its customers gives [\\#TSLA](https://twitter.com/hashtag/TSLA?src=hashtag_click) a huge competitive advantage other EV's\n\n**Data shows great:**\n\n* Growth\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\nhttps://preview.redd.it/oqqaavtdzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=0087e0b090da7737106808f9b007aa6b5b71cfff\n\n[prospero.ai](https://preview.redd.it/3jc9b82fzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=408a11d21efa69f5de923945bd8abe3b6ab827e6)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Nvidia** [**$NVDA**](https://twitter.com/search?q=%24NVDA&amp;src=cashtag_click)**:**\n\n* Makes the best graphics chips\n* Huge player in artificial intelligence, machine learning, metaverse, digital biology, robotics, autonomous vehicles, cloud computing space, IoT &amp; 6G space\n\n**Data shows great:**\n\n* Dark Pools\n* Upside Breakout\n* Institutional Flow\n\nhttps://preview.redd.it/pkik7yjfzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=5bd092381302bda0de83bf521d5d35d168ca6b23\n\n[prospero.ai](https://preview.redd.it/mrfmurdgzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=5e4b99ef986c7d617581207b5284d82cb457986a)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**JPMorgan** [**$JPM**](https://twitter.com/search?q=%24JPM&amp;src=cashtag_click)**:**\n\n* America's biggest credit card issuer\n* Higher interest rates is a positive\n* Friendlier banking regulations is a positive\n* Around half of all US households do business with Chase\n\n**Data shows great:**\n\n* Profitability\n* Institutional Flow\n\nhttps://preview.redd.it/pnf96k3hzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=29986f46af60c92cce2c35b7201997d5c61678f1\n\n[prospero.ai](https://preview.redd.it/akjn1f5izgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=ac04f6939e8a72ebd622928f3645163073a27d87)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Mastercard** [**$MA**](https://twitter.com/search?q=%24MA&amp;src=cashtag_click)**:**\n\n* Very well managed company\n* Increasing use of its networks due to unrelenting sector growth in e-commerce &amp; mobile payments (electronic transactions will continue to grow tenfold)\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\nhttps://preview.redd.it/xharvclizgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=fbf1a7f5a94102e8fe81d8652ab15221a1e566d8\n\n[prospero.ai](https://preview.redd.it/7wy1gbmjzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=ff6d19b94dbeb48e9671558e06024f9a65c94047)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Costco** [**$COST**](https://twitter.com/search?q=%24COST&amp;src=cashtag_click)**:**\n\n* One of the strongest balance sheets\n* Consistently ahead of earnings estimates\n* One of the most loyal customer bases (90%+ membership renewal rate in North America)\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\nhttps://preview.redd.it/22tmdf3kzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=1497241400069bc206be6a042a0bb39119da9061\n\n[prospero.ai](https://preview.redd.it/gtxw05vkzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=cd187576e0250080dbc9374e5ea06d314caa556a)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Walmart** [**$WMT**](https://twitter.com/search?q=%24WMT&amp;src=cashtag_click)**:**\n\n* 47-years of dividend hikes\n* Only American retailer that can complete with Amazon\n* Many retailers won't survive this recession, and their losses will be Walmart's gain\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n* Options sentiment\n\nhttps://preview.redd.it/bz5lkj9lzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=29ee0918367385d61c2a222fce3bfa7d26301436\n\n[prospero.ai](https://preview.redd.it/jhlulr7mzgq91.png?width=360&amp;format=png&amp;auto=webp&amp;s=c9b9fb938d4b518b648719d749ef9ab8b1a5d4d8)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Disney** [**$DIS**](https://twitter.com/search?q=%24DIS&amp;src=cashtag_click)**:**\n\n* Disney has a lot more great content in their pipeline\n* Pandemic has ended and travel restrictions are being lifted + holiday &amp; travel season may be the busiest season for Disney parks\n\n**Data shows great:**\n\n* Upside Breakout\n* Institutional Flow\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nData and images are from the [Prospero.ai](https://Prospero.ai) app.\n\n&amp;#x200B;\n\nMy 3 favorite long-term metrics on the app are:\n\n1. Growth Rating- How likely a company is to grow in revenue and/or size in the next 1-2 years\n2. Profitability Rating- How likely a company is to be profitable in the next few years\n3. Upside Breakout - Higher scores indicate a larger chance of a sharp move upwards in price, any time within the next 1-2 years\n\n&amp;#x200B;\n\nMy 3 favorite short-term metrics on the app are:\n\n1. Net Institutional Flow- Tracks if institutions are buying up or selling off a stock, or options\n2. Net Options Sentiment- Provides information on how long or short the market is on short duration options\n3. Net Social Sentiment- Gauges positive &amp; negative sentiment from social media, as well as the difference between them\n\n&amp;#x200B;\n\nDefinitions:\n\n* Dark Pools are exchanges that institutions use to make trades without immediately moving the markets\n* Net Institutional Flow is tracked using 13F &amp; 13G SEC filings\n* Profitability is based on current financials &amp; estimates\n* Growth is based on forecasted financials",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/xptgqs/over_20_of_the_sp_500_is_made_up_of_5_stocks_lets/",
    "score": 17,
    "author": "TonyLiberty",
    "created_utc": 1664314566,
    "num_comments": 10
  },  "xq2hqf": {
    "title": "I know you Tards have tunnel vision for GME and AMC but you really need to zoom out and consider loading the ever living hell out of this stock...",
    "selftext": "Guys, just take a minute and zoom out your vision from stocks like $GME and $AMC and realize that $GOOG $GOOGL is at an extremely rare valuation right now. Even if it drops more from here you are getting a great price for it, I wouldn't pass this up...\n\nGoogle is now trading for a 16x forward earnings and 11x EBITDA. Its not as sensitive to supply chain issues and inflation as other companies are. Google is literally the internet and not going anywhere and is a huge monopoly with no competitors even dreaming of coming close. It is also extremely oversold with an RSI below 30 and at 52 week lows. This is one of those All-In opportunities that you can feel proud of and brag to your dads boyfriend about.\n\nAgain... We are talking about freaking Google here, everyone uses Google and Google uses everyone. I  have been loading shares under $100. Anyways this is my opinion and not my financial advise yada yada\n\nhttps://preview.redd.it/f2i6licg1jq91.jpg?width=254&amp;format=pjpg&amp;auto=webp&amp;s=7b9581249ecc72cebcea498e74946a95854186c6",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/xq2hqf/i_know_you_tards_have_tunnel_vision_for_gme_and/",
    "score": 0,
    "author": "midblade",
    "created_utc": 1664338613,
    "num_comments": 55
  },  "xrbwzm": {
    "title": "Do I use margin to buy more shares?",
    "selftext": "I’m not selling. BABA, ATVI, GOOG &amp; BRK are my top holdings. Tempted to leverage more and buy the dip",
    "url": "https://i.redd.it/jr153umsotq91.jpg",
    "score": 1,
    "author": "Jshbone12",
    "created_utc": 1664468130,
    "num_comments": 2
  },  "xs8uw0": {
    "title": "$TTD short thesis. Poke Holes.",
    "selftext": "$TTD short thesis.\n\n[Ad spending in $billions timeline](https://preview.redd.it/77ngyrd7i1r91.png?width=753&amp;format=png&amp;auto=webp&amp;s=698c4cd1f7ab5cad3efdfd7779157317fac0da37)\n\nHistorically speaking, money spent on advertising dollars has taken a hit after a recession. From the table above you can see money spent on ads dropped after the dot com bubble burst, the 08’ housing market burst, and then most recently 2020 covid crash.\n\nI believe this recession is going to be nasty as it’s the first of it’s kind in which the FED’s are raising rates, inflation is still high, and housing is…. well, stupidly high – rent and cost.\n\n[Weekly $TTD chart](https://preview.redd.it/dwlefsmbi1r91.png?width=1461&amp;format=png&amp;auto=webp&amp;s=36cf5e57073a27f7919202936c305704efec5da9)\n\nAbove is a $TTD weekly chart. You can notice that from March 2020 – December 2020 the stock continues to climb an amazingly 525%.. \n\n[Measuring the 525&amp;#37; climb since \\\\\"Rescue Plan\\\\\"](https://preview.redd.it/wsquslwli1r91.png?width=1461&amp;format=png&amp;auto=webp&amp;s=421a30253af9af66f38121dfa951250debf7e5e7)\n\nWhat else was introduced in March? A $1.9 trillion stimulus package called the “American Rescue Plan”. Business’s got relief and spent money on advertising to try to attract more business, as anyone in that situation would have done. \n\nWith rising rates, a strong dollar which affects international spending, inflation, and companies left and right lowering guidance. I can’t help but think that $TTD has yet to be hit from some reduced spending. The charts also indicate that $TTD is in a downtrend. \n\n$TTD also trades at a stupid high P/E compared to the other publicly traded ad business’s ($CCO, $OMC, $GOOG, $IPG) \n\nThey do have an investor day October 4th, so I expect a little bit of a bounce after that, so good opportunity to add to my current position. \n\nWould like to hear opinions or reasons why I am thinking incorrectly about this. I have strong conviction and will be adding more.\n\n&amp;#x200B;\n\n\\-twoiaido",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/xs8uw0/ttd_short_thesis_poke_holes/",
    "score": 5,
    "author": "twoiaido",
    "created_utc": 1664562948,
    "num_comments": 4
  },  "xuohex": {
    "title": "Peacock froze on YouTube tv…puts on GOOG lol",
    "selftext": "[removed]",
    "url": "https://i.redd.it/ibsdnuapcmr91.jpg",
    "score": 1,
    "author": "worknplay28",
    "created_utc": 1664815163,
    "num_comments": 2
  },  "xw6snr": {
    "title": "$GOOG buy or goog bye?",
    "selftext": "",
    "url": "https://i.redd.it/r67rse5bryr91.jpg",
    "score": 53,
    "author": "500Bullion",
    "created_utc": 1664965359,
    "num_comments": 61
  },  "xw6b2g": {
    "title": "$GOOG buy or goog bye?",
    "selftext": "[removed]",
    "url": "",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1664963723,
    "num_comments": 2
  },  "xx1qwx": {
    "title": "Stonks. Only. Go. Up.",
    "selftext": "I watched all of us get f*cked in 2019-2020, all these brave 🌈 🐻 soldiers falling, I’m not falling for your doomsday predictions again.\n\nOf course, all the “silliness” needs to go: funny internet money and ape jpegs, hydrogen startups that need more electricity to compress it than needed for an electric car, and all other bs running on debt and VC craziness since years ago.\n\nHowever, what the f do you all think you’re doing selling MSFT, GOOG and big pharma ? At the current levels a meteorite on the US is priced in, if they go down you’ll have other problems than making money, all these are f*cking systemic by now mark. my. words.\n\nSo fuck you, I’m buying again, and hedging against nuclear war the only way I can which is cocaine and hookers.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/xx1qwx/stonks_only_go_up/",
    "score": 16,
    "author": "Foufou190",
    "created_utc": 1665051608,
    "num_comments": 29
  },  "xxkaql": {
    "title": "40% of $QQQ (the Nasdaq-100) is made up of 5 stocks, let's look into each! [My thoughts on the upside of each]",
    "selftext": " **$QQQ is the 2nd most traded ETF in the U.S., it tracks the Nasdaq-100 Index &amp; contains some of the most innovative companies.**\n\n**40% of $QQQ is made up of 5 stocks:**\n\n* 13.5% Apple $AAPL\n* 10.5% Microsoft $MSFT\n* 7% Amazon $AMZN\n* 7% Google $GOOG\n* 4.5% Tesla $TSLA\n\n**$QQQ includes the 100 largest non-financial companies on the Nasdaq. Let’s also look at other popular holdings:**\n\n* 3% $META\n* 2.5% $NVDA\n* 2% Costco $COST\n* 2% Broadcom $AVGO\n* 1.5% Cisco $CSCO\n* 1% Qualcomm $QCOM\n* 1% Paypal $PYPL\n* 1% $AMD\n* &amp;#x200B;\n\n**Now let's look at these:**\n\n**Apple** **$AAPL**:\n\n* Apple iCar &amp; Augmented Reality products in the pipeline\n* Apple Pay is #1 mobile payment system in US\n* 1.5 billion+ active devices in ecosystem, with devices to be replaced every few years\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/oxvy1n7hx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=4059dbdabc67996f454cd889d44fed457705a03e)\n\n&amp;#x200B;\n\n**Microsoft** **$MSFT**:\n\n* Dominance in cloud computing space\n* Azure is growing faster than Amazon's AWS\n* Azure has a large and constantly growing market share for the Cloud Computing market\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n* Options Sentiment\n\n[source: prospero.ai](https://preview.redd.it/80yel42ix9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=a36b6eef0dd803816c043a8bb93cfca4d485e2e3)\n\n&amp;#x200B;\n\n**Amazon** **$AMZN**:\n\n* Largest in cloud infrastructure space\n* Health care services growth (health care spending accounts for \\~20% of the economy)\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/tw40hprjx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=eb65bbb57547479dfd81d40a66a7d32bbb8aae55)\n\n&amp;#x200B;\n\n**Alphabet/ Google** **$GOOG** **$GOOGL**:\n\n* MOAT on the online ad market\n* Leader in quantum computing\n* Strong balance sheet\n* Healthy cash flow\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/c28xaxikx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=0f519c7ab6b77add4243e1e4efe08ed02005f0cf)\n\n&amp;#x200B;\n\n**Tesla** **$TSLA**:\n\n* Low battery costs, self-designed A.I. chips &amp; data it has collected from billions of miles of real-world driving from its customers gives TSLA a huge competitive advantage other EV's\n\n**Data shows great:**\n\n* Growth\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/bunbd6amx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=324d7ce12f9967d808a88bcbde8b49d2b20b370d)\n\n&amp;#x200B;\n\n**Meta** **$META**:\n\n* There are \\~5 billion active internet users and $META has \\~4 billion monthly active users using its products (Facebook, Instagram, Messenger &amp; WhatsApp). That's \\~80% of the World!\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n* Options Sentiment\n\n[source: prospero.ai](https://preview.redd.it/7khr26xmx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=5244ae93289f91ac6dcbc252018bb6bb72c05719)\n\n&amp;#x200B;\n\n**Nvidia** **$NVDA**:\n\n* Makes the best graphics chips\n* Huge player in artificial intelligence, machine learning, metaverse, digital biology, robotics, autonomous vehicles, cloud computing space, IoT &amp; 6G space\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n* Options Sentiment\n\n[source: prospero.ai](https://preview.redd.it/jvw8b2aox9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=ea4c3c2db4974ff87e1dead6798d07270bb47f11)\n\n&amp;#x200B;\n\n**Costco** **$COST**:\n\n* One of the strongest balance sheets\n* Consistently ahead of earnings estimates\n* One of the most loyal customer bases (90%+ membership renewal rate in North America)\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/9z74puvox9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=4fa39063f511cb74699b547a087a11515e0c182c)\n\n&amp;#x200B;\n\n**Broadcom** **$AVGO**:\n\n* Dominates Radio frequency (RF) chips market\n* Exposed to many secular themes such as semiconductors, cloud computing, AI, 5G/6G, and gaming\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/xvupp1oqx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=3db9e23b03b87a2208590213be42f138039dcade)\n\n&amp;#x200B;\n\n**Cisco** **$CSCO**:\n\n* Well positioned to capitalize on cyber security, 5G/6G &amp; IoT trends\n* Huge portfolio of products &amp; patents in networking equipment &amp; security\n\n**Data shows great:**\n\n* Social Sentiment\n* Institutional Flow\n* Options Sentiment\n\n[source: prospero.ai](https://preview.redd.it/lwcwnqbrx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=97c4e1381fd53d183fdee1bc79a42e75601a5d36)\n\n&amp;#x200B;\n\n**Qualcomm** **$QCOM**:\n\n* Involved in about every facet of 5G, and it holds \\~15% of all 5G patents\n* 2.5% Yield!\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Social Sentiment\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/jr0q82rsx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=32a48a2ef6222d60d90999ee8da13771ca6825c6)\n\n&amp;#x200B;\n\n**Paypal** **$PYPL**:\n\n* Accepted by more than 75% of the top 500 U.S. Internet retailers. No other company is better equipped to serve the digital payments boom.\n\n**Data shows great:**\n\n* Profitability\n* Upside Breakout\n* Institutional Flow\n* Options Sentiment\n\n[source: prospero.ai](https://preview.redd.it/xqhowx8tx9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=913ea163b4636f8659806fc2b544e9fd80d84898)\n\n&amp;#x200B;\n\n**Advanced Micro Devices $AMD:**\n\n* Makes great graphics chips, which are transforming the World (big data, cloud computing, machine learning, AI, autonomous vehicles, 5G/ 6G, IoT)\n\n**Data shows great:**\n\n* Growth\n* Dark Pools\n* Upside Breakout\n* Social Sentiment\n* Institutional Flow\n\n[source: prospero.ai](https://preview.redd.it/z252hhdux9s91.png?width=680&amp;format=png&amp;auto=webp&amp;s=50de41fef53ab64b079c9975b47be1dbeee79d1e)\n\n&amp;#x200B;\n\nData and images are from the [Prospero.ai](https://prospero.ai/) app.\n\n&amp;#x200B;\n\n3 great long-term metrics on the [Prospero.ai](https://prospero.ai/) app are:\n\n1. Growth Rating- How likely a company is to grow in revenue and/or size in the next 1-2 years\n2. Profitability Rating- How likely a company is to be profitable in the next few years\n3. Upside Breakout - Higher scores indicate a larger chance of a sharp move upwards in price, any time within the next 1-2 years\n\n3 great short-term metrics on the [Prospero.ai](https://prospero.ai/) app are:\n\n1. Net Institutional Flow- Tracks if institutions are buying up or selling off a stock, or options\n2. Net Options Sentiment- Provides information on how long or short the market is on short duration options\n3. Net Social Sentiment- Gauges positive &amp; negative sentiment from social media, as well as the difference between them\n\n&amp;#x200B;\n\nDefinitions:\n\n* Dark Pools are exchanges that institutions use to make trades without immediately moving the markets\n* Net Institutional Flow is tracked using 13F &amp; 13G SEC filings\n* Profitability is based on current financials &amp; estimates\n* Growth is based on forecasted financials",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/xxkaql/40_of_qqq_the_nasdaq100_is_made_up_of_5_stocks/",
    "score": 3,
    "author": "TonyLiberty",
    "created_utc": 1665101013,
    "num_comments": 9
  },  "y12gg1": {
    "title": "Easy money",
    "selftext": "This is the time to start your stocks shopping IMO, Goog, TSLA, NFLX are low risk and big upside for the next 2 years from now",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/y12gg1/easy_money/",
    "score": 7,
    "author": "Emanuelsil",
    "created_utc": 1665472734,
    "num_comments": 35
  },  "y3kw3g": {
    "title": "The Regulators of Facebook, Google and Amazon Also Invest in the Companies’ Stocks -- WSJ",
    "selftext": " \n\nhttps://preview.redd.it/wwie2m9zgpt91.jpg?width=968&amp;format=pjpg&amp;auto=webp&amp;s=294de48ef5bdc7efb1dfdddf3d4c3ac5564fd31c\n\nThe top watchdog of American business is also home to Washington’s most active Wall Street investors.\n\nThe Federal Trade Commission in recent years has opened investigations into nearly every major industry. It has launched antitrust probes into technology companies, examined credit card firms and moved to restrict drug, energy and defense-company mergers.\n\nAt the same time, senior officials at the FTC disclosed more trades of stocks, bonds and funds, on average, than officials at any other major agency in [a Wall Street Journal review of financial disclosures at 50 federal agencies ](https://www.wsj.com/articles/government-officials-invest-in-companies-their-agencies-oversee-11665489653?mod=article_inline)from 2016 to 2021.\n\nMany of the investments overlapped with the FTC’s work.\n\nA third of its 90 senior officials owned or traded stock in companies that were undergoing an FTC merger review or investigation, based on actions the agency has made public.\n\nFTC officials owned stock in 22 of the roughly 60 large companies the FTC brought cases against in the period reviewed.\n\nThe officials were most heavily invested in technology, an industry that has come under increasing scrutiny by the agency. Nearly one in four top FTC officials owned or traded individual stocks of tech companies such as [Amazon](https://www.wsj.com/market-data/quotes/AMZN).com Inc., [Meta Platforms](https://www.wsj.com/market-data/quotes/META) Inc.’s Facebook, [Alphabet](https://www.wsj.com/market-data/quotes/GOOG) Inc.’s Google, [Microsoft](https://www.wsj.com/market-data/quotes/MSFT) Corp. and [Oracle](https://www.wsj.com/market-data/quotes/ORCL) Corp.\n\n&amp;#x200B;\n\nhere is the [FULL LINK](https://www.wsj.com/articles/the-regulators-of-facebook-google-and-amazon-also-invest-in-the-companies-stocks-11665670207)",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/y3kw3g/the_regulators_of_facebook_google_and_amazon_also/",
    "score": 25,
    "author": "dysto666",
    "created_utc": 1665724628,
    "num_comments": 9
  },  "y7cjzn": {
    "title": "Earnings Season (50 Major Company Earnings This Month + EPS/Rev + Expected move + Unsual Activity)",
    "selftext": "Hello ladies and gentlemen\n\nI'm ash and write detailed DD on stocks and events, and my analysis usually does fairly well (check my post history for proof)\n\nSome of you know me from my weekly watchlists threads, I havent posted those in a couple of weeks because i was working on a project of mine, but ill be posting them again next, and all my plays for all these earnings.\n\nTill then i have collected for all important earnings, expected EPS and revenue, options implied move, and what the option activity looks like so far.\n\nEnjoy and see you next week with the watchlist\n\n# Monday 17 Oct\n\n**Before Open - Bank of America Corp ($BAC)**\n\n* Banking Services\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $0.77 &amp; Revenue $23.54B\n* Options Activity ($100k+ Prem - 1 Month Out): Mostly bullish activity with the most active chain being 11/18 30p (Sell Side)\n* Options pricing in a 7.9% move on earnings\n\n# Tue 18 Oct\n\n**Before Open - Goldman Sachs ($GS)**\n\n* Consumer Retail\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $7.7 &amp; Revenue $11.4B\n* Options Activity ($100k+ Prem - 1 Month Out): Mixed almost even split between bearish and bullish but the Bearish premium was a lot higher than bullish at 62%\n* Options pricing in a 7.9% move on earnings\n\n**Before Open - Johnson &amp; Johnson ($JNJ)**\n\n* Pharmaceuticals\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $2.48 &amp; Revenue $23.35B\n* Options Activity: ($100K+ Premium - 1 Month Out): It’s quite mixed with a little too bearish activity. Bullish premium, however, has a healthy lead with 57%.\n* Options pricing in a 4.6% move on earnings\n\n**After Close - Netflix ($NFLX)**\n\n* Production Company/Streaming Service\n* Estimate Earnings Call Time: 4:00 PM EST\n* Estimates: EPS $2.13 &amp; Revenue $7.83B\n* Options Activity: ($100K+ Premium - 1 Month Out): It’s another 50/50 split between the bulls and the bears. The bearish premium is just above 50% - 53.6%\n* Options pricing in a 14.6% move on earnings\n\n# Wed 19 Oct\n\n**Before Open - Procter &amp; Gamble ($PG)**\n\n* Consumer Staples\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $1.55 &amp; Revenue $20.33B\n* Options Activity ($100K+ Premium - 1 Month Out): It’s safe to say the activity is overwhelmingly bearish,with the most active looking to sell options with expiry dates on the 21st of October. Bearish premium at 62.16%\n* Options pricing in a 5.8% move on earnings\n\n**After Close - International Business Machines ($IBM)**\n\n* Technology\n* Estimate Earnings Call Time: 4:00 am EST\n* Estimate: EPS $1.79 &amp; Revenue $13.52\n* Options Activity ($100K+ Premium - 1 Month Out): It’s looking very bearish, with the most active being on the selling side with 18th of November expiry dates. The bearish premium is at 54.67%\n* Option pricing in a 7.3% move on earnings\n\n**After Close - Tesla ($TSLA)**\n\n* Electric Vehicles\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $1.008 &amp; Revenue $22.14B\n* Options Activity ($100K+ Premium - 1 Month Out): It’s a mixed bag, although leaning more on the bearish side. The 21st of October seeing a lot of activity. The bearish premium has a lead at 49.94%, but there’s also a premium for neutrals of 3.19%\n* Options pricing in a 14.1% move on earnings\n\n# Thu 20 Oct\n\n**Before Open - AT&amp;T ($T)**\n\n* Telecommunications\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $0.66 &amp; Revenue $29.83B\n* Options Activity ($100K+ Premium - 1 Month Out): Mostly neutral with most of the activity being bearish selling on the 21st of October and the 18th of November.\n* Options pricing in a 6.5% move on earnings\n\n**Before Open - Blackstone ($BX)**\n\n* Financial Services\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $0.98 &amp; Revenue $2.34B\n* Options Activity ($100K+ Premium - 1 Month Out): A combination of bulls and bears, with a lot of bullish and bearish selling. The bearish premium is at 60%.\n* Options pricing in a 10.3% move on earnings\n\n**Before Open - Philip Morris International ($PM)**\n\n* Tobacco\n* Estimate Earning Call Time: 8:00 am EST\n* Estimates: EPS $1.35 &amp; Revenue $7.25\n* Options Activity ($100K+ Premium - 1 Month Out): It’s looking very bearish with lots of bearish buying on the 18th of November. The bearish premium is an eyewatering 81%\n* Options pricing in a 5.9% move on earnings\n\n**After Close - Snap Inc A ($SNAP)**\n\n* Social Media\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS -$0.24 &amp; Revenue $1.12B\n* Options Activity ($100K+ Premium - 1 Month Out): Another mixed bag, although slightly more bearish. Plenty of bearish selling on the 21st of October. The bullish premium barely over the 50% - 50.99%\n* Options pricing in a 20.4% move on earnings\n\n# Fri 21 Oct\n\n**Before Open - American Express ($AXP)**\n\n* Financial Services\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $2.40 &amp; Revenue $13.50B\n* Options Activity (100K+ Premium - 1 Month Out): It’s a bit of a split between the bulls and bears with slightly more bearish activity - mostly calling. The bearish premium is at 56.50%\n* Options pricing in a 8.4% move on earnings\n\n**Before Open - Schlumberger Ltd ($SLB)**\n\n* Oilfield Services\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $0.55 &amp; Revenue $7.10B\n* Options Activity ($100K+ Premium - 1 Month Out): It’s looking pretty bullish with a few neutrals and even less bears. The bearish premium has a lead at 45.83% and there’s a neutral premium of 17.95%\n* Options pricing in a 10% move on earnings\n\n**Before Open - Verizon Communications ($VZ)**\n\n* Telecommunications\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $1.28 &amp; Revenue $33.77B\n* Options Activity ($100K+ Premium - 1 Month Out): Overwhelmingly bearish activity with neutrals coming in second place . There’s barely any bulls - no pun intended. The premiums for this one are like no other. The neutral premium is in the lead with 35.40%, and the bullish premium is in second place with a 33.26%\n* Options pricing in a 6.3% move on earnings\n\n# Tue 25 Oct\n\n**3M Co ($MMM)**\n\n* Industrial\n* Estimate Earnings Call Time:\n* Estimates: EPS $2.61 &amp; Revenue $8.74B\n* Options Activity ($100K+ Premium - 1 Month Out): It’s a tight race but the bulls are just a tad more dominant. The bullish premium is 54.44%\n* Options pricing in a 7.2% move on earnings\n\n**Before Open - Coca-Cola Co ($KO)**\n\n* Consumer Staples\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $0.63 &amp; Revenue $10.52\n* Options Activity ($100K+ Premium - 1 Month Out): Worryingly bearish activity with lots of bullish puts. The bullish premium, however, is in the lead with a 61%\n* Options pricing in a 5.2% move on earnings\n\n**Before Open - General Electric ($GE)**\n\n* Industrial\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $0.48 &amp; Revenue $18.49\n* Options Activity ($100K+ Premium - 1 Month Out): It’s safe to say that most of the activity is bearish,and the bearish premium is in the lead with an ominous 66.66%\n* Options pricing in a 8.8% move on earnings\n\n**Before Open - General Motors ($GM)**\n\n* Automotive\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $1.89 &amp; Revenue $42B\n* Options Activity ($100K+ Premium - 1 Month Out): Another assorted selection, but it’s just slightly more bullish than bearish. The bullish premium is in the lead with a 56.49%\n* Options pricing in a 10.7% move on earnings\n\n**After Close - Advanced Micro Devices ($AMD)**\n\n* Technology/Semiconductors\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $0.57 &amp; Revenue $6.7B\n* Options Activity ($100K+ Premium - 1 Month Out): Extremely bearish activity for this company’s options. The bearish premium is at 51.23%\n* Options pricing in a 12.1% move on earnings\n\n**After Close - Alphabet Inc ($GOOG)**\n\n* Communication Services\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $1.27 &amp; Revenue $71.28\n* Options Activity ($100K+ Premium - 1 Month Out): It might seem like it’s neck and neck at first glance, but it’s definitely more bullish. The bearish premium, however, is in the lead with a 54.60%\n* Options pricing in a 8.7% move on earnings\n\n**After Close - Microsoft Corp ($MSFT)**\n\n* Information Technology\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $2.32 &amp; Revenue $49.81B\n* Options Activity ($100K+ Premium - 1 Month Out): It’s another situation of 52/48 here, with the bulls just edging over the line. The bullish premium also has the lead in the premium race with a 50.75%\n* Options pricing in a 7.6% move on earnings\n\n**After Close - Spotify Technology SA ($SPOT)**\n\n* Broadcasting\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS -$0.86 &amp; Revenue $2.95B\n* Options Activity ($100K+ Premium - 1 Month Out): This one is even tighter than the infamous 52/48 race. The bullish premium is ahead at 53.62%\n* Options pricing in a 14.7% move on earnings\n\n**After Close - Visa Inc Class A ($V)**\n\n* Financial Services\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $1.87 &amp; Revenue $7.56B\n* Options Activity ($100K+ Premium - 1 Month Out): Might seem like a tight race until you scroll down to witness the severity of the bearishness.\n* Options pricing in a 7.2% move on earnings\n\n# Wed 26 Oct\n\n**Before Open - Boeing ($BA)**\n\n* Aerospace\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $0.17 &amp; Revenue $18.24B\n* Options Activity ($100K+ Premium - 1 Month Out): Another heavily bearish one with lots of bulls and bears looking to sell. The bearish premium is at 55%\n* Options pricing in a 10.7% move on earnings\n\n**Before Open - McDonald's Corp ($MCD)**\n\n* Restaurants\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $2.58 &amp; Revenue $5.71B\n* Options Activity ($100K+ Premium - 1 Month Out): Quite a bearish scene with ample amounts of puts from both bulls and bears. The bearish premium is also in the lead with a 52.08%\n* Options pricing in a 5.3% move on earnings\n\n**After Close - Ford Motor Co ($F)**\n\n* Automotive\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $0.32 &amp; Revenue $37.57B\n* Options Activity ($100K+ Premium - 1 Month Out): Almost all options are out there by bulls seeking to put. The bearish premium is in the lead with a 53.94%\n* Options pricing in a 11.3% move on earnings\n\n**After Close - Meta Platforms ($META)**\n\n* Internet and Information Services\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $1.90 &amp; Revenue $27.50B\n* Options Activity ($100K+ Premium - 1 Month Out): One of the few to see obvious bullish activity with ample amounts looking to buy. The bearish premium just made it over the line with a 50.48%\n* Options pricing in a 13.6% move on earnings\n\n**After Close - Teladoc Health ($TDOC)**\n\n* Health Care\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS -$0.56 &amp; Revenue $608.76M\n* Options Activity ($100K+ Premium - 1 Month Out): As is the case with most companies, the activity seems to be mixed. The bullish premium, however, is in the lead with 67.19%\n* Options pricing in a 20.7% move on earnings\n\n**After Close - Twilio ($TWLO)**\n\n* Industrial Machinery/Components\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS:-$0.393 &amp; Revenue 972.71M\n* Options Activity ($100K+ Premium - 1 Month Out): You can easily tell it’s just a bit bullish with just a shufti. The bullish premium is at 59.52%\n* Options pricing in a 17% move on earnings\n\n# Thu 27 Oct\n\n**Before Open - Caterpillar Inc ($CAT)**\n\n* Construction/Agricultural Equipment and Trucks\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $3.12 &amp; Revenue $14.21B\n* Options Activity ($100K+ Premium - 1 Month Out): Another almost neck and neck race between the bulls and bears. The bearish premium is in the lead with 66.37%\n* Options pricing in a 7.6% move on earnings\n\n**Before Open - Mastercard ($MA)**\n\n* Business Services\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $2.56 &amp; Revenue $5.64B\n* Options Activity ($100K+ Premium - 1 Month Out): Possibly slightly more bearish, but very clearly a mixed bag. The bearish premium is in the lead with 51.88%\n* Options pricing in a 7.3% move on earnings\n\n**Before Open - Merck &amp; Co ($MRK)**\n\n* Health Care\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $1.72 &amp; Revenue $14.07B\n* Options Activity ($100K+ Premium - 1 Month Out): Slightly less mixed bag with this company’s options with slightly more bullish activity. The bullish premium is also 56.35%\n* Options pricing in a 4.9% move on earnings\n\n**Before Open - Shopify ($SHOP)**\n\n* Information Technology\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS -$0.06 &amp; Revenue $1.34B\n* Options Activity ($100K+ Premium - 1 Month Out): Scrolling down, you can easily tell the activity is quite bearish despite the deceiving look of the few bullish options at the top of the list. The bullish premium, however, is at 54.58%\n* Options pricing in a 16.5% move on earnings\n\n**After Open - Amazon.com ($AMZN)**\n\n* Catalogue/Specialty Distribution\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $0.21 &amp; Revenue $127.68B\n* Options Activity ($100K+ Premium - 1 Month Out): Scrolling down this one’s options list is a bit of a rollercoaster, but it seems to be more bearish. The bullish premium is at 52.88%\n* Options pricing in a 10.3% move on earnings\n\n**After Open - Apple Inc ($AAPL)**\n\n* Computer Manufacturing\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $1.26 &amp; Revenue $88.68B\n* Options Activity ($100K+ Premium - 1 Month Out): Another overwhelmingly bearish options list. The premium race winner is the bearish one with a rate of 51.63%\n* Options pricing in a 7.8% move on earnings\n\n**After Close - Intel Corp ($INTC)**\n\n* Technology\n* Estimate Earnings Call Time: 4:00pm EST\n* Estimates: EPS $0.33 &amp; Revenue $15.37B\n* Options Activity ($100K+ Premium - 1 Month Out): Rather bearish with a few neutrals. Most activity is bearish selling. Bearish premium is at 46.17% and the neutral premium is at 15.90%\n* Options pricing in a 10.8% move on earnings\n\n# Fri 28 Oct\n\n**Before Open - Chevron ($CVX)**\n\n* Energy\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $4.80 &amp; Revenue $57.02B\n* Options Activity ($100K+ Premium - 1 Month Out): Surprisingly bearish activity despite recent good performance and high hopes with rise in oil prices and increase in demand for their natural gas in Europe. A lot of these options are looking to call. The bullish premium is in the lead with 53.42%\n* Options pricing in a 7.2% move on earnings\n\n**Before Open - Exxon Mobil ($XOM)**\n\n* Energy\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $3.68 &amp; Revenue $107.23B\n* Options Activity ($100K+ Premium - 1 Month Out): Slightly more balanced activity than in the case of Chevron. The bullish premium is 53.53%\n* Options pricing in a 7.6% move on earnings\n\n# Tue 1 Nov\n\n**Before Open - Eli Lilly and Co ($LLY)**\n\n* Health Care/Biotechnology\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $1.88 &amp; Revenue $6.90B\n* Options Activity ($100K+ Premium - 1 Month Out): Another balanced list, with a hint of bullish activity. The bullish premium is also at quite a healthy lead - 68.97%\n* Options pricing in a 6.4% move on earnings\n\n**Before Open - Pfizer ($PFE)**\n\n* Health Care/Biotechnology\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS $1.42 &amp; Revenue $21.32B\n* Options Activity ($100K+ Premium - 1 Month Out): A tad more bearish than bullish with a few neutrals. The bullish premium is at 58.79%\n* Options pricing in a 6% move on earnings\n\n**- Activision Blizzard ($ATVI)**\n\n* Recreational Games/Products\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $0.50 &amp; Revenue $1.71B\n* Options Activity ($100K+ Premium - 1 Month Out): Balanced activity between the bulls and the bears. The bearish premium, however, is at quite a high - 81.46%\n* Options pricing in a 5.5% move on earnings\n\n**Uber Technologies ($UBER)**\n\n* EDP Services\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS -$0.176 &amp; Revenue $8.12B\n* Options Activity ($100K+ Premium - 1 Month Out): It’s a neck-and-neck race for this options list. The bullish premium is in the lead, however, with 65.38%\n* Options pricing in a 13.8% move on earnings\n\n# Wed 2 Nov\n\n**Etsy Inc ($ETSY)**\n\n* Catalogue/Specialty Distribution\n* Estimate Earnings Call Time:\n* Estimates: EPS $.36 &amp; Revenue $563.7 million\n* Options Activity ($100K+ Premium - 1 Month Out): No clear side dominating the options list, but the bullish premium is at 57.10%\n* Options pricing in a 16.3% move on earnings\n\n**Qualcomm Inc ($QCOM)**\n\n* Semiconductors &amp; Software\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $3.14 &amp; Revenue $11.33 billion\n* Options Activity ($100K+ Premium - 1 Month Out): A mixed bag of bulls and bears with most of them seeking put options. The bullish premium is at 53.79%\n* Options pricing in a 10.2% move on earnings\n\n**Roku Inc ($ROKU)**\n\n* Telecommunications/Cable and Other Pay Television Services\n* Estimate Earnings Call Time:\n* Estimates: EPS -$1.28 &amp; Revenue $702.46M\n* Options Activity ($100K+ Premium - 1 Month Out): The bearish activity seems to be dominating this options list. The bullish premium is standing on thin ground with a premium of 50.35%\n* Options pricing in a 19.1% move on earnings\n\n# Thu 3 Nov\n\n**Moderna ($MRNA)**\n\n* Health Care/Biotechnology\n* Estimate Earnings Call Time: 8:00 am EST\n* Estimates: EPS 4.10 &amp; Revenue $410 billion\n* Options Activity ($100K+ Premium - 1 Month Out): A mixed list, although the big bullish bulk seeking to put on the 21st of October make it seem to be more bullish. The bullish premium is at 52.75%\n* Options pricing in a 13.7% move on earnings\n\n**Airbnb ($ABNB)**\n\n* Hotel/Resorts\n* Estimate Earnings Call Time:\n* Estimates: EPS $1.44 &amp; Revenue $2.83B\n* Options Activity ($100K+ Premium - 1 Month Out): Just like Moderna, there seems to be a deceiving bulk of bulls, but the activity is definitely more bearish. The bullish premium, however, is at 57.15%\n* Options pricing in a 12.7% move on earnings\n\n**Block Inc ($SQ)**\n\n* Technology/Computer Software\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $.23 &amp; Revenue $4.49B\n* Options Activity ($100K+ Premium - 1 Month Out): You couldn’t really whose activity was dominating the list unless you counted them. The bullish activity, however, is in the lead with a 55.11%\n* Options pricing in a 16.2% move on earnings\n\n**Pinterest ($PINS)**\n\n* Technology/Interactive Media\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $0.06 &amp; Revenue $666.6M\n* Options Activity ($100K+ Premium - 1 Month Out): The list is almost equally split between the bulls, the bears and the neutrals. The bearish premium is 55.47%\n* Options pricing in a 18.2% move on earnings\n\n**Starbucks Corp ($SBUX)**\n\n* Beverages - Non-Alcoholic\n* Estimate Earnings Call Time: 4:00 pm EST\n* Estimates: EPS $0.72 &amp; Revenue $8.33B\n* Options Activity ($100K+ Premium - 1 Month Out): Like most companies covered, the options list doesn’t indicate a clear dominating side, although the bearish side could be said to be outperforming the bullish one. The bullish premium is still winning the premium rate race with a rate of 55.04%\n* Options pricing in a 7.7% move on earnings\n\nHope you enjoyed this took me a minute to get it together, so let me knowif you found it helpful, see you next week with the weekly watchlist.",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/y7cjzn/earnings_season_50_major_company_earnings_this/",
    "score": 24,
    "author": "Flimsy-Willow-3086",
    "created_utc": 1666112473,
    "num_comments": 19
  },  "y8az7k": {
    "title": "Increase $VOO Positions or Keep Other Positions?",
    "selftext": "Hi Everyone, \n\nI have over 55+ shares in $VOO (Vanguards S&amp;P 500 ETF) and other positions in $AMZN, $TSLA, &amp; $GOOG along with many others. I was wondering since the $VOO follows the S&amp;P 500 which includes a majority of the company's positions I have invested in separately, should I sell some of them to add to my $VOO positions?\n\n(Definitely holding onto $TSLA since I got lucky during the March 20' bear market with that position)\n\nThanks,",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/y8az7k/increase_voo_positions_or_keep_other_positions/",
    "score": 0,
    "author": "givenchymarcus",
    "created_utc": 1666205697,
    "num_comments": 10
  },  "yb156k": {
    "title": "Although far from a company focused on patent trolling, it makes the most sense to address the three large legal cases currently facing Netlist. These are against Samsung (OTCPK:SSNLF, OTCPK:SSNNF), Google (GOOG, GOOGL), and Micron (MU), all for infringement of various parents.",
    "selftext": "",
    "url": "https://i.redd.it/cftnpjhssfv91.jpg",
    "score": 1,
    "author": "Mammoth-Nail-5484",
    "created_utc": 1666479217,
    "num_comments": 1
  },  "yaqfl6": {
    "title": "🕵️‍♂️ I SPY TA - Monday October 24, 2022 - 0DTE Scalpers Delight",
    "selftext": "# Oct. 21 Recap\n\nhttps://preview.redd.it/0ejobhnhidv91.png?width=1176&amp;format=png&amp;auto=webp&amp;s=72fdede7fb6e0e21c340b537a0a763fd3dcffd64\n\nVolume picked back up. Good for bulls going into Monday. Need to follow through.\n\nhttps://preview.redd.it/cm1vgkcjidv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=f5ad3b308bea6de552bbe5f435aa7750ee653cb1\n\nSPY broke-out of three-day downtrend. It traded in a nice parallel uptrend.\n\nhttps://preview.redd.it/hkzh42xkidv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=76ceee0d5e0f57132be70c2ea273e544e9e04d28\n\nSPY nearing rectangle resistance.\n\nhttps://preview.redd.it/n4lyt5fnidv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=9d77e621d80373c9b6652315cef58a21c3274641\n\nSPY bounced at the 20 MA (currently at 366.00) on the daily.\n\nhttps://preview.redd.it/c5nukcvoidv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=66a1c8b91acf539e8fef08ef650177ae08ff1b2a\n\nSPY opened and bounce at PMH and PDL and exceeded 368.05 on scalping chart. SPY traded in a falling wedge for the next hour and half or so. It broke out 9:20 UTC-6 and retested. It hit 372.30 full measured move at around 11:47 UTC-6. SPY traded in a flat-top triangle and broke-out with a double bottom. It hit 374.30 full measured move EOD. We closed slightly under the 375.08 price on scalping chart.\n\nhttps://preview.redd.it/c0bqrukqidv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=52a3cc423931303da9f3ce5e6a4c23f2a5523f0d\n\nI made one trade today and called it a day. Played the wedge and scaled out on way to resistance. Left some runners that I got stopped out on.\n\nhttps://preview.redd.it/5j2qoqvsidv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=1f405afbd2e33a6e92dd72e1039fbde4ac2e575d\n\nhttps://preview.redd.it/2xc27krvidv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=ce022fa3207fd877d616f996c4a49df4c0b02ab3\n\n# US Market Wrap - Financial Juice\n\n&gt;Another day of big reversals on Wall Street, with stocks posting their best week since June after a treasury rout stalled. The yen rose after reports that Japan may have intervened once more to support the currency.  \n&gt;  \n&gt;It's no surprise that all the drama in the world's largest bond market would dictate sentiment at a time when traders have been obsessed with the outlook for interest rates. After being all over the place in early trading, stocks rose sharply as bond yields fell from multiyear highs.  \n&gt;  \n&gt;The next step in the US central bank's anti-inflation campaign will be to debate how high to raise interest rates and when to slow the pace of increases. St. Louis Fed President James Bullard and his San Francisco counterpart Mary Daly both stated that they expect the discussion to be on the table at the November meeting, while emphasizing the importance of continuing to tighten.\n\n# Need to know market risk - Financial Juice\n\n&gt;**\\[12:10 ET\\]**  Japan intervenes in the FX market to support the yen - Nikkei.  \n&gt;  \n&gt;**\\[11:56 ET\\]**  Fed's Daly: We will do a step-down, not to pause, but to 50 or 25 BPS increments.  \n&gt;  \n&gt;**\\[11:48 ET\\]**  Fed's Daly: According to projections, policy will be tightened to 4.5%-5% next year.  \n&gt;  \n&gt;**\\[08:52 ET\\]**  Fed set to raise rates by 0.75 point and debate the size of future hikes - WSJ. \n\n# Economic Calendar\n\nhttps://preview.redd.it/4ko57t91jdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=9b50a1caca38ecaa66ed3d0d2ad7515a1775adb1\n\n# Earnings\n\nhttps://preview.redd.it/1dar0im4jdv91.png?width=640&amp;format=png&amp;auto=webp&amp;s=755ac7086cefaa29f543c207b0928c7b77164296\n\n# 🕵️‍♂️ I SPY TA\n\nFib. Levels\n\n* Downside targets:\n   * 368.42\n   * 362.18\n   * 350.38\n   * 341.65\n   * 330.11\n* Upside targets:\n   * 377.69\n   * 384.96\n   * 390.08\n\nhttps://preview.redd.it/0der5h08jdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=bdd283e378d8985553374ab1babe044b281af882\n\nBulls closed well above the 20 MA. The 20 MA currently sits at 366.00. It’s important for bulls to follow through. If we can trade out of this smaller rectangle -highlighted in blue, I believe that we will see 380 and then decide from there. It’s do or die here IMO as GOOG, AAPL, MSFT, META, and AMZN report next week. Beats and FED talk about pivoting could give us the Nov. midterm rally to 390 - 400+.\n\nhttps://preview.redd.it/cpm35qe9jdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=3d3e243df69ad84c78c567ebbadda36276be1268\n\n## 30 min. Rectangle\n\n* Resistance: 375.45\n* Middle: 368.12\n* Support: 361.48\n* Bullish half measure: 382.55\n* Bullish full measure: 389.79\n* Bearish half measure: 354.41\n* Bearish full measure: 347.39\n\nhttps://preview.redd.it/33m1sz4bjdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=e35b43e3c5b52bdae63deecb258558946344d8cd\n\n## 4 hr. Rectangle\n\n*Update: Nearing Resistance*\n\n* Rectangle top: 379.46\n* Middle: 367.62\n* Rectangle bottom: 355.81\n* Bearish half measure: 345.75\n* Bearish full measure: 335.60\n* Bullish half measure: 389.55\n* Bullish full measure: 399.75\n\nhttps://preview.redd.it/th3yxredjdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=e1b96a09251472552eb5b9d65cfe01122a6c3164\n\n# Scalping Chart - Best on 2 or 3 min. Timeframe\n\n* Break 375.08 and look for 377.99 - 381.41\n* Break 381.41 and look for 384.51\n* Break 384.51 and look for 387.41 - 389.34\n* Break 389.34 and look for 391.73\n* Lose 374.30 and look for 372.26\n* Lose 372.26 and look for 369.41\n* Lose 369.41 and look for 365.95 - 364.53\n* Lose 364.53 and look for 362.17 - 361.37\n* Lose 361.37 and look for 359.17\n\nhttps://preview.redd.it/1dvi93ggjdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=ebada533b60341c6e271b0c3219c8b26dfe6c04b\n\nNotes:\n\n* Key for bulls to hold 369 - 370 resistance breakout level if we backtest on Monday.\n* Eye on 375.08; 377.99; 374.30; 372.26, 370\n* 15 min RSI: 76.62 (overbought)\n* 65 min RSI: 67.55 (near overbought)\n* 4 hr. RSI: 61.58 (bullish)\n* Day RSI: 51.11 (neutral)\n* 2 min. RSI bearish divergence printed EOD.\n\nhttps://preview.redd.it/cdh9fexhjdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=c651082af3be99e1fd673ddcba0beca275693c3d\n\n* 2 and 5 min. MACD bearish divergence printed EOD\n\nhttps://preview.redd.it/kad82qmjjdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=8fe1f2d8587996112be80d07d59aed24e0fff8b5\n\nhttps://preview.redd.it/fx6yxkxkjdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=d8be408ded0a1cb729e33cfaf1537e3e9fb35d4d\n\n* Netflow - 1 Day - Puts and calls decreased. Puts more so than call.\n\nhttps://preview.redd.it/qwabrrjmjdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=3f657cba88af292f9f8618aa91041cbc0fc95a52\n\n* Netflow - 5 Day - Puts and calls decreased\n\nhttps://preview.redd.it/ufcd1bcojdv91.png?width=1456&amp;format=png&amp;auto=webp&amp;s=f297810c3bcbe2fe0c828987854d4eabc0ec13d7",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yaqfl6/i_spy_ta_monday_october_24_2022_0dte_scalpers/",
    "score": 40,
    "author": "jjd1226",
    "created_utc": 1666451966,
    "num_comments": 14
  },  "yb6f6e": {
    "title": "In my early 20s, need some advice",
    "selftext": "I've just recently finished university and working full time now. In 2021 to early part of 2022, I had around 10k saved from the previous 4 years working internships and summer jobs, and I started investing during that time and as many others, I lost legit all of it.   \n\n\nFor a long time, almost all of 2022, I just didn't even want to look at any of this anymore, was so burnt out. But now I've started work full time and I have money I should be looking to invest, and I think it's a good time to do so for my future.  \n\n\nCurrently, I have around 15k I can invest and per month I can squeeze out around 500 to continuously invest.  \n\n\nI want to have a fresh start, and this time make some more smarter decisions. I've spent some time to compile a list of companies from different sectors I could star to look into which maybe good opportunities:\n\n**TECH**:  \nGOOG  \nFB  \nMSFT  \nAPPL  \nTSLA  \nNVDA  \nAmd  \nShop  \nSnap\n\n**Consumer Goods**  \nPG  \nWMT  \nACI  \nMCD  \nJNJ  \nNKE\n\n**Finance and Banking**  \nV  \nMA  \nTD / BMO / RY (Canadian Banks)\n\n**ETFs**  \nQQQ  \nFNGU  \nARKF  \nXEQT  \n\n\n**Others**  \nBRK-B  \nTSM  \nNio  \nSofi  \nUpst  \nAfrm  \nTDOC  \n\n\nNow, I'm still young in my early 20s, so I can still tolerate some risk. I want to set aside a few selected choices from the above for long term (10-15 years) but more so look to take more risks with the next 3-5 years in mind.\n\nI'd really appreciate advice you guys would have as to how I should allocate my money, and from the above what should I choose and focus on (and anything else you may think is better, I know I'm totally missing any Energy, don't much about it)  \n\n\n**how should I get started?**",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yb6f6e/in_my_early_20s_need_some_advice/",
    "score": 0,
    "author": "JonSnow_123",
    "created_utc": 1666494426,
    "num_comments": 59
  },  "ycqgkr": {
    "title": "MSFT or GOOG Strangle",
    "selftext": "We all know how important these earnings are going to be to signal to investors how tech is performing in this high inflation, recessionary environment. I’ve scoped out the IV’s and it’s pretty low imo for such bellwether enterprises (60-80% IV, as compared to facebook’s 170%, for example). I wanted to open up a discussion in this community about what do you guys think of their earnings, and if a strangle on either one of them or both may be a viable option to take us to Tendie Town. 💰🎢",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ycqgkr/msft_or_goog_strangle/",
    "score": 13,
    "author": "audyntarek",
    "created_utc": 1666655689,
    "num_comments": 28
  },  "yc8u1n": {
    "title": "TO WATCH THIS WEEK",
    "selftext": " American indices around parity while the profits of the big players in the market are anxiously awaited. \n\nWe will in fact have the earnings data for [$GOOG (Alphabet)](https://www.etoro.com/it/markets/goog) [$V (Visa)](https://www.etoro.com/it/markets/v) and [$KO (Coca-Cola)](https://www.etoro.com/it/markets/ko) (tuesday) [$MSFT (Microsoft)](https://www.etoro.com/it/markets/msft) and [$META (Meta Platforms Inc)](https://www.etoro.com/it/markets/meta) (wednesday) [$AAPL (Apple)](https://www.etoro.com/it/markets/aapl) , [$AMZN (Amazon.com Inc)](https://www.etoro.com/it/markets/amzn) , [$MA (Mastercard)](https://www.etoro.com/it/markets/ma) , [$INTC (Intel)](https://www.etoro.com/it/markets/intc) and [$MCD (McDonald's)](https://www.etoro.com/it/markets/mcd) (friday). \n\nIn Europe, on the other hand, another hike in ECB interest rates of 0.75 points (Thursday) is expected, while the Dutch TTF ( european [$NATGAS](https://www.etoro.com/it/markets/natgas) ) drops 10%, reaching -70% from its highs. If we have good news it is likely that the technical rebound that started last week can continue but until we have some encouraging inflation data we will continue to be in a bear market. \n\nThe most important thing is to reduce core inflation which is heavily influenced by the housing market. It is usually always the last to surrender. \n\n[GO TO MY PROFILE](https://etoro.tw/2DGv45L)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hg4raa6xoqv91.png?width=696&amp;format=png&amp;auto=webp&amp;s=759714d680b0ee727ba8f606fcf6a66ee0e4a93d",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yc8u1n/to_watch_this_week/",
    "score": 13,
    "author": "Massive_Release_6110",
    "created_utc": 1666611115,
    "num_comments": 11
  },  "ydhg11": {
    "title": "Waiting on QQQ and GOOG open tomorrow (Oct 26)",
    "selftext": "",
    "url": "https://www.reddit.com/gallery/ydhg11",
    "score": 38,
    "author": "maddy405",
    "created_utc": 1666736357,
    "num_comments": 18
  },  "yda9lv": {
    "title": "$GOOG calls time 🚀🚀",
    "selftext": "",
    "url": "https://i.redd.it/yo2lgvxijzv91.jpg",
    "score": 29,
    "author": "NNIICCEEE",
    "created_utc": 1666718239,
    "num_comments": 28
  },  "yda7si": {
    "title": "$GOOG puts time 🤗",
    "selftext": "[removed]",
    "url": "",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1666718117,
    "num_comments": 2
  },  "yd8auu": {
    "title": "GOOG",
    "selftext": "Is the voting season and political war ads just the shot in the arm that GOOG's earnings needs.  Will there be a BIG pop after earnings announcement today?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yd8auu/goog/",
    "score": 5,
    "author": "AngryOldGland",
    "created_utc": 1666713506,
    "num_comments": 6
  },  "yd83jm": {
    "title": "GOOG earnings guess. These are 3 dte with $6 3 day straddle. Way up or way down? Thinking $110",
    "selftext": "[deleted]",
    "url": "",
    "score": 7,
    "author": "[deleted]",
    "created_utc": 1666712965,
    "num_comments": 3
  },  "yeasba": {
    "title": "10-26-22 SPY/ ES Futures, Apple and Tesla Daily Market Analysis",
    "selftext": "Well today was one wild day that’s for sure. From the $3 green candle at 10am in less than one minute to the followed up $4 drop over 2 hours this day was full of volatility and extreme hard technical to trade. I actually only made four scalps today which is extreme low for me considering most days I make 8-10. However, with the movement of SPY, Tesla and Apple today I was able to make some successful level to level plays. Thankfully even when stocks are moving irrationally they still have a way of respecting the overall TA and key levels. \n\nI have had a LOT of questions about what a “level to level” play is so im going to post an example of what I call out and then I will explain what it is and why I play it to clear up the confusion. I have started to play a lot more of these as the charts respect the technical better and this allows everyone to get in on the play when its hard for everyone to eat on scalps. Also theta has been eating extra good lately and after the first 15minutes we have had such choppy movements but have been making larger overall plays that a longer dte from level to level has been able to overcome those negatives. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/hy9itsil68w91.png?width=792&amp;format=png&amp;auto=webp&amp;s=ea756099c1fb1e847b6a6bbc748dc30117732cad\n\nOkay this morning at open I called out this play on Tesla. You can see in the below picture that was the daily chart. What I had seen that despite MSFT and GOOG missing and dumping and even SPY was very red at open we had a pretty bullish open. We had held over 215 support overnight and we had held the daily 8ema support at open. This was a sign of bullishness and the 15min chart was looking bullish along with the DMI stoch. We were at a key level having broken over 223 resistance at the time of call out. \n\nThe way a LEVEL TO LEVEL play as I call it works is that we are finding a major resistance that was turned into support. So Tesla had broken through previous 223 resistance. We now look for the next major resistance which at the time would have been 230 followed by 234. This will be our take profit target. We then look for a key support that if that breaks would signal down side. The trick to this it to find a soft enough support that you aren’t stopping out too soon (this is why I didn’t chose 223 because a back test could have occurred) but we are not having such a far away support that by time it hits our position is extreme red. We are eyeing a support and also a DTE that gives us room to be right and win but also gives us room to be wrong and avoid theta without ending up overly red. \n\nI played this breakout with a 2dte call for 50% then followed it up with a 30% 2dte win and a 9dte 26% win using this. The 2dtes went on to well over 100% and the 9dte hit 50% plus when I had looked before it reached my target of 230. \n\nNow you noticed my target was 230 however I had sold early when it had stopped at an intraday resistance. The key here is that while we fully expect it to hit the take profit once we have secured a large enough profit and the overall momentum appears to have slowed down we take profits and secure our win. This is not a diamond hand be greedy play. Essentially we are playing a longer DTE and bigger move from level to level (or support to resistance/ resistance to support). Hope that explains that better! \n\n&amp;#x200B;\n\nhttps://preview.redd.it/sriqbh5m68w91.png?width=975&amp;format=png&amp;auto=webp&amp;s=48078874afaf12dd694dffb79a5b62516666b1d0\n\nKey support- 381.6 -&gt; 378.9 -&gt; 378 -&gt; 374.3\n\nKey resistance- 385 -&gt; 388.6 -&gt; 390.1\n\nI am bearish short term on Spy. I had mentioned last week and this week that my initial thoughts if we broke through 378.2 was that we could touch that 388.5 to 390 range. We fell just short of that today. With the massive green candle being put in followed by this impressive gravestone doji with this really tight rising wedge inside the red bear channel I am expecting a retrace and retest of support down near 378.2 to 378.8 tomorrow. Now I am not sure if that support will hold or if we are going to see a drill. With MSFT, GOOG and now META getting wrecked on earnings really everything relies on Apple…. And let me tell you APPLE got wrecked intraday today relatively speaking. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/m8vo4ipm68w91.png?width=975&amp;format=png&amp;auto=webp&amp;s=6f5c2338cf936f05d3078fded0dc6a483c555d14\n\nSomething else to keep in mind for tomorrow is that GDP and jobs release at 830am. Overall today if you noticed that huge red dump that came out of no where it was directly correlated to the time the Atlanta Fed updated its GDP forecast to be even higher then expected. Wait but why is a good GDP bad? Well in the simplest of terms if the GDP is good that means the economy is still strong and means we are out of the technical recession that we were never technically in (lol yeah it be like that). So this means the FED could realistically be even more hawkish thinking inflation is not going to slow enough. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ncrnug5n68w91.png?width=975&amp;format=png&amp;auto=webp&amp;s=bf95fba0118ebdf0005446324132cf850c708848\n\nHere is a little excerpt to kinda help explain it. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/0bowchjn68w91.png?width=975&amp;format=png&amp;auto=webp&amp;s=a2c39316cd1e6b2cdd678135245fa4cb5de0f3b7\n\nYou know those little maps that say “you are here” when you are lost at the mall? Well this is your guide right here on futures. I believe we could be seeing a similar movement, rejection with a doji followed by a sell off (data/ macro driven) after a bear market rally just like we saw back in the first week of October. \n\nAs you can see on Futures we are in a similar rising wedge pattern inside of a bull channel that should result in a pullback. Important think to note is that Futures attempted to break through that blue dotted bear channel resistance (this is the resistance that dates back to the august 4300 peak… apple and spy have broken theirs but futures have not). I actually had an upside target today of 3925 and we looked like we were going to fully test that bear channel resistance but were smacked down hard by that GDP news and never was able to recover… its almost like markets for the last week have forgotten the full macro bear picture and were promptly reminded today. \n\nKey support- 3840 -&gt; 3805 -&gt; 3770\n\nKey resistance- 3875 -&gt; 3925\n\n&amp;#x200B;\n\nhttps://preview.redd.it/khdd3q1o68w91.png?width=975&amp;format=png&amp;auto=webp&amp;s=294783afc532d3880c7fbea998d610a3294c2acc\n\nThat rising wedge I reference on SPY and futures today well Apple had that formed already and we saw that support fail today. With that support failing today we are going to be looking for a true test of this red bull channel support tomorrow. This will also bring a test of the daily 8ema and possibly the daily 20ema. With earnings reporting tomorrow night after hours we should see the sentiment be priced in during the day tomorrow. Todays price action on Apple looked like someone knew something and that something wasn’t very bullish… \n\nWith MSFT, GOOG, and META now all missing… technically Tesla beat but missed revenue… its really left up to Apple and Amazon tomorrow. Apple has put the market on its back once before… But overall I would be shocked to see Amazon beat. I really don’t know if Apple does or not. My thoughts are they have had a lot of slow downs and stuff but im not sure if we see the total effect this quarter or next quarter. \n\nKey support- 149.3 -&gt; 147.3 -&gt; 145.5\n\nKey resistance- 150.9 -&gt; 152.4\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fo4v4uko68w91.png?width=975&amp;format=png&amp;auto=webp&amp;s=cae8d6b2d072cf760081166a815be378b969eb3a\n\nWho loves a busy chart? Lol well lets take a look here lots to breakdown on Tesla today… So we actually broke out of the red/ blue diamond. This means I would expect further upside from Tesla. However, as you can see we hard rejected the daily 20ema on the breakout today. Usually the 20ema is about the last resort before we see a bearish move. Its either breakout or breakdown at the daily 20ema. However, we are holding the daily 8ema and we are also see a pretty intense black rising wedge and there is actually another rising wedge formed with the red bull channel and the black 3 day support line. \n\nOverall unless Tesla open over 225 tomorrow we break through support of this rising wedge and that should open up some downside. If we open under 225 tomorrow I will be looking for a retest of the daily 8ema and 219.3 support. Once we lose 219.3 I fully expect a move back to 215. \n\nSomething I have noticed is that Tesla really has formed a nice sideways channel from about 205 to 225. It seems the closer we get to 225 we reject and drop and anything near 205 is a call opportunity. I will look for this to play out tomorrow and consider some puts at open on Tesla. \n\nKey support- 219.3 -&gt; 214.4 -&gt; 209.9 -&gt; 205.6\n\nKey resistance- 225 -&gt; 229.5 -&gt; 234\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n3t8eesp68w91.png?width=616&amp;format=png&amp;auto=webp&amp;s=e9f254fdcf97f3a345399b90ad6a06737c32de66\n\nAs if the VIX couldn’t become anymore detached from reality… we have SPY rip from -1% to green and back to -.75% and the VIX did what? It actually unwound more. Makes 100% sense right? \n\nWell I do have a theory on this. Todays price action if you watched it intraday was absolutely bonkers… however, my thoughts about the price action was that we were seeing OTM puts be unwound today. I think people had hedged so aggressively bearish for CPI and with this rally I feel that perhaps (and this is just a theory) that people finally accepted the feds gonna slow hikes in December narrative and before FOMC next week people wanted to drop those puts. That’s really the only explanation I have as to why we would see the VIX unwind so much when on a red day like this. Outside of that besides the VIX is detached from reality I have nothing for you. \n\n10% challenge- \n\nAs I explained on my level to level plays at the top today was a tough day to trade. Seemed like things were so beyond erratic I just played some safer level to level longer DTE plays with tight stops and tight take profits. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/u6pyzwbq68w91.png?width=606&amp;format=png&amp;auto=webp&amp;s=c34d32dfbab4ca5bd9d2f3bf31a37fb338518bd6\n\nI had mentioned how I really thought FORD, and META would miss bigly on earnings. I was beyond right on META. I hadn’t planned to play it but figured last second why not since ive had a great week and it’s a small position.. but I also grabbed a SPX put for tomorrow for the GDP reading. I actually am a little surprised to see Futures green after hours after the META miss. I would have expected a more negative reaction overall market wise. But with GDP and jobs tomorrow I do expect a reaction there. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/0dkmofsq68w91.png?width=327&amp;format=png&amp;auto=webp&amp;s=3125de1eff1dfd432c241c6824ed39354e3c931d\n\nWish me luck…. Im hoping im not remind why I don’t do overnight swings and why I don’t play earnings at open tomorrow…. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/a4woo38r68w91.png?width=766&amp;format=png&amp;auto=webp&amp;s=abaafefce87b6d1831a3e0441c9dca6802614ef1\n\n&amp;#x200B;\n\nhttps://preview.redd.it/515srqpr68w91.png?width=738&amp;format=png&amp;auto=webp&amp;s=e06371a7308cf8a59d859691c3e910af22a3bfa4",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yeasba/102622_spy_es_futures_apple_and_tesla_daily/",
    "score": 38,
    "author": "DaddyDersch",
    "created_utc": 1666822917,
    "num_comments": 19
  },  "ydygbb": {
    "title": "FAANG + Microsoft are all still a genuinely attractive buy to me",
    "selftext": "Long story short I’m finding these 6 stocks to be very attractive currently for the following reasons: \n\n1. Generating monstrous free cash flow each with their own future potential growth areas. All of these companies have proven highly innovative with very solid managements, especially AAPL, AMZN, GOOG, and MSFT, who are sort of in their own little tier.\n\n2. Still have massive user bases, pricing power and most of us use their services daily. This is really the crux of the appeal to me. I don’t get how people compare these to Pets.com or even Yahoo. From what I see, they’re practically inescapable and on avg each person reading this thread probably contributes hundreds of dollars to each of their top lines yearly, either directly or indirectly.\n\n3. For the ones that are less “gold plated” when it comes to the core of their business aka Meta and Netflix, they are currently trading at much much saner multiples than before, especially Meta, and still are solid businesses with moats and tons of FCF. \n\nI feel Netflix still offers the best service amongst the streaming platforms and is an innovative enough company to maintain its profitability and growth. It also has streaming as its core bread and butter business unlike AMZN and arguably Disney. \n\nRe: Meta, Metaverse may look like a weird bet but the VR/AR tech they’re investing in is absolutely industry leading and FB ads still have a massive moat in digital advertising thanks to Insta. Current valuation is a bargain when you consider their profits and growth. \n\nHence, I feel there’s a decent rational logic to buying these stocks over the next year or so keeping a 10 year + horizon in mind. They might get killed over the next 1-2-3 whatever years but I find them to offer solid and reliable value. Thoughts?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/ydygbb/faang_microsoft_are_all_still_a_genuinely/",
    "score": 5,
    "author": "StrengthChoice1734",
    "created_utc": 1666791748,
    "num_comments": 13
  },  "ydozz4": {
    "title": "Wednesday is the unscheduled White House press conference. Expect a mid-day pivot in the stock market in response. SPY will go up, because this means new rounds of stimmies coming. Market opening lower due to MSFT/GOOG earnings. Buy 0DTE SPY Calls 2% OTM to capitalize on the pivot.",
    "selftext": "",
    "url": "https://i.redd.it/z3f1sklgw2w91.png",
    "score": 0,
    "author": "NoMoreLandBro",
    "created_utc": 1666758916,
    "num_comments": 2
  },  "ydozfw": {
    "title": "Wednesday is an unscheduled White House press conference. Expect a mid-day pivot in the stock market in response. SPY will go up, because this means new rounds of stimmies coming. Market opening lower due to MSFT/GOOG earnings. Buy 0DTE QQQ or SPY Calls 2% OTM to capitalize on the pivot.",
    "selftext": "",
    "url": "https://i.redd.it/dg2yva77w2w91.png",
    "score": 1,
    "author": "NoMoreLandBro",
    "created_utc": 1666758866,
    "num_comments": 1
  },  "ydoykp": {
    "title": "Wednesday is the unscheduled White House press conference. Expect a mid-day pivot in the stock market in response. SPY will go up, because this means new rounds of stimmies coming. Market opening lower due to MSFT/GOOG earnings. Buy 0DTE SPY Calls 2% OTM to capitalize on the pivot.",
    "selftext": "[removed]",
    "url": "",
    "score": 1,
    "author": "[deleted]",
    "created_utc": 1666758786,
    "num_comments": 1
  },  "ydoxh5": {
    "title": "Wednesday is the unscheduled White House press conference. Expect a mid-day pivot in the stock market in response. SPY will go up, because this means new rounds of stimmies coming. Market opening lower due to MSFT/GOOG earnings. Buy 0DTE SPY Calls 2% OTM to capitalize on the pivot.",
    "selftext": "[removed]",
    "url": "",
    "score": 2,
    "author": "[deleted]",
    "created_utc": 1666758682,
    "num_comments": 2
  },  "yez5hs": {
    "title": "AAPL EARNINGS",
    "selftext": "Best Regards,   \n\n\nfirst thing first, Position: AAPL DEC'22 $145 PUTS\n\nAAPL is set to release earings AM today. According to corning glass, aapl sells are down. According to all other Big tech, ERs will miss.   \n\n\nLook at all the other tech earning table drops. (META, GOOG, MSFT, all dropped)  \n\n\nPlus there is this piece.\n\nhttps://preview.redd.it/439ph8x83ew91.png?width=607&amp;format=png&amp;auto=webp&amp;s=715eebbdce3312bb15b8f5742556e28930486c27",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yez5hs/aapl_earnings/",
    "score": 4,
    "author": "theGr8Alexander",
    "created_utc": 1666894559,
    "num_comments": 10
  },  "yeslre": {
    "title": "Thought this was hilarious and wanted to share it $goog $snap $Meta $pins and positive $twtr",
    "selftext": "I saw this and wanted to share it, its indeed hilarious 😂 😃",
    "url": "https://i.redd.it/pvy9tmysaew91.jpg",
    "score": 289,
    "author": "UltimateTraders",
    "created_utc": 1666878909,
    "num_comments": 18
  },  "yen8jc": {
    "title": "META FALLS DOWN OF 20% IN PRE MARKET",
    "selftext": "After [$GOOG (Alphabet)](https://www.etoro.com/markets/goog) even [$META (Meta Platforms Inc)](https://www.etoro.com/markets/meta) releases yet another disappointing figure that shows a drop in profits equal to 52% compared to a year ago.\n\nIn after hours it even drops 20%, taking to the prices it traded in January 2016. According to data from GuruFocus, the company is considered significantly undervalued as can be seen from the graph below.\n\nIn general, growth companies at this time suffer greatly from both a lack of liquidity and the fact that they are priced in relation to future cash flows.\n\nWith bond yields skyrocketing, it's more profitable to pocket the coupon of a bond than invest in a stock that hardly pays dividends. \n\nOn the macro front, GDP data will be released today: hopefully the umpteenth bad news is that the GDP is worse than expected to avoid further tightening by the FED. \n\n90% of analysts expect a 75 basis point hike in rates at the next meeting\n\n[GO TO MY PROFILE TO SEE MY INVESTIMENTS](https://etoro.tw/3zknuY1)\n\nhttps://preview.redd.it/mb6m488xfbw91.png?width=432&amp;format=png&amp;auto=webp&amp;s=f61c31b1d43c5db145e2eea31a190c485cb76d27",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yen8jc/meta_falls_down_of_20_in_pre_market/",
    "score": 35,
    "author": "Massive_Release_6110",
    "created_utc": 1666862344,
    "num_comments": 19
  },  "yfnrdg": {
    "title": "$GOOG @$92 squeeze ready to $200?",
    "selftext": "[removed]",
    "url": "",
    "score": 0,
    "author": "[deleted]",
    "created_utc": 1666962558,
    "num_comments": 7
  },  "yfng0q": {
    "title": "Now I learnt true meaning of FANG.. Darn you META, AMZN, GOOG even NFLX!",
    "selftext": "",
    "url": "https://i.redd.it/i0tfp9u25lw91.jpg",
    "score": 31,
    "author": "dogelonian",
    "created_utc": 1666961732,
    "num_comments": 17
  },  "yfgren": {
    "title": "We bring this back for those in $snap $amzn $meta $msft and $goog",
    "selftext": "[removed]",
    "url": "",
    "score": 0,
    "author": "[deleted]",
    "created_utc": 1666939743,
    "num_comments": 2
  },  "yiawgp": {
    "title": "$GOOG Chart breakout!",
    "selftext": "  \nLove the technical breakout up the chart on this one..cross the 50 day MA @ $104 and could really spark a rally…  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/v2qkx11gz4x91.png?width=700&amp;format=png&amp;auto=webp&amp;s=eb9634b1a6b99dc6060a6dfbeed97a701ee413e5",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yiawgp/goog_chart_breakout/",
    "score": 0,
    "author": "Tommyboytrader123",
    "created_utc": 1667220058,
    "num_comments": 8
  },  "yjnquw": {
    "title": "When do you back up the truck and load on $GOOG $GOOGL?",
    "selftext": "",
    "url": "https://twitter.com/SuperStickman2/status/1587574435292356608?t=bqZdnU-KDcuxy1G2m10crw&amp;s=19",
    "score": 4,
    "author": "Super_Stickman13",
    "created_utc": 1667342409,
    "num_comments": 7
  },  "yv311s": {
    "title": "YOLO’d $185k in GOOG calls over the next 3 weeks",
    "selftext": "",
    "url": "https://i.redd.it/8eglm9s9sxz91.jpg",
    "score": 1,
    "author": "atrain1189",
    "created_utc": 1668440359,
    "num_comments": 2
  },  "ywwveo": {
    "title": "MSFT and GOOG backs hurting today",
    "selftext": "",
    "url": "https://i.redd.it/vhgaonuckd0a1.jpg",
    "score": 1,
    "author": "_404_error_404",
    "created_utc": 1668613410,
    "num_comments": 0
  },  "yywv2o": {
    "title": "Goog stock. I am watching and waiting for the big rebound. I am all in, so I will keep my fingers crossed. Come on Google",
    "selftext": "",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/yywv2o/goog_stock_i_am_watching_and_waiting_for_the_big/",
    "score": 1,
    "author": "BGSJC",
    "created_utc": 1668811555,
    "num_comments": 2
  },  "z9sla1": {
    "title": "So much to learn about that it makes you wanna shout BLIPPI! 🤓GOOG puts",
    "selftext": "",
    "url": "https://i.redd.it/yyfmpyktwc3a1.jpg",
    "score": 1,
    "author": "seejarrick1",
    "created_utc": 1669913036,
    "num_comments": 2
  },  "zfqi3c": {
    "title": "GOOG Call?",
    "selftext": "[removed]",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/zfqi3c/goog_call/",
    "score": 1,
    "author": "Reasonable_Bank9931",
    "created_utc": 1670478445,
    "num_comments": 1
  },  "zfmt2k": {
    "title": "Amazon, only FAANG stock that hasn't bounced back yet.",
    "selftext": "Everything owned by Amazon, Stock is way oversold and due for a run to $120. \n\nOut of FAANG stocks, $META $NFLX $AAPL $GOOG all bounced back while Amazon is still trading at pre pandemic levels.",
    "url": "https://i.redd.it/7a28wkzfrm4a1.jpg",
    "score": 1,
    "author": "Value1991",
    "created_utc": 1670468146,
    "num_comments": 1
  },  "zgnsm5": {
    "title": "how'd I do y'all? GOOG calls boned me this April that's the last leg down. CCJ calls gonna bring me back baby! ☢️",
    "selftext": "[removed]",
    "url": "",
    "score": 2,
    "author": "[deleted]",
    "created_utc": 1670563061,
    "num_comments": 2
  },  "zjmio4": {
    "title": "Thoughts on any of these positions? New to trading. Bag holding ASTS and SOUN. Hoping to offload GOOG call.",
    "selftext": "",
    "url": "https://i.redd.it/f877v8jdof5a1.png",
    "score": 1,
    "author": "poorschoolteacher",
    "created_utc": 1670818213,
    "num_comments": 2
  },  "zjmg5m": {
    "title": "Thoughts on any of these positions? New to trading and bag holding ASTS and SOUN. Hoping to offload GOOG call",
    "selftext": "",
    "url": "https://i.redd.it/ff04n5jwnf5a1.png",
    "score": 1,
    "author": "poorschoolteacher",
    "created_utc": 1670818054,
    "num_comments": 1
  },  "zpuxwl": {
    "title": "GOOGL is lower than GOOG",
    "selftext": "I’m theory Google Class A shares should be trading to a premium to Google Class C shares because they are the same except google class a has voting rights. Is there a reason why GOOGL is trading lower than GOOG?\n\nI can think it’s volume. Otherwise is this an arbitrage opportunity albeit a small one?",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/zpuxwl/googl_is_lower_than_goog/",
    "score": 1,
    "author": "RavenMatha",
    "created_utc": 1671464600,
    "num_comments": 1
  },  "zte2k2": {
    "title": "Moving Tickers of Interest",
    "selftext": "|CALLS|\n\n:--|\n\n|GOOG 1/13/23 95C .81|\n\n|COST 1/6/23 485C 1.50|\n\n|IQ 1/6/23  4C  .75|\n\n|JPM 1/13/23 135C 1.66|\n\n|NKLA 1/6/23 2C  .56|\n\n|CNC 1/20/23 8.5C .80|\n\n|HTZ 1/20/23 15C  .63|\n\n|\\*\\*Trading Thesis: Tracking the float along with daily volume along with company financials helps to narrow down moving tickers\\*\\*Fundamental and technical analysis is often used to find growth tickers and information about them. Fundamental analysis looks to see whether an investment is overvalued or undervalued based on underlying economic conditions, as well as the finances of the company or other organization that issued a stock or bond. Technical analysis instead looks at patterns in the price of an investment to predict future movements in that investment’s price.\\*I look for tickers that are trading at least 2 million in volume a day, with a market-cap of no less than 500 million.\\*\\*The shares traded are compared to the average volume to determine how much of the float is used (Or shares traded). That information is compiled with data on how profitable the company is and how much cash do they have compared to what is expected.\\*|\n\n|\\*\\*Things to consider when finding the plays-\\*\\*· If the stock volume has traded 1 million or more in volume premarket, I will use that and calculate a rough estimate on what the stock will trade for the day.· If the ticker looks to be trading more volume than the day before, I will consider it for a long play. If trading less than the movement of the ticker, I would consider a short or put play. (If all the other factors previously mentioned checks out.)· The trades are researched afternoon daily to find possible tickers making a big move. Some of the prices may be less depending on day and time trade is executed.\\&amp;nbsp;\n\n|\n\n|Have a Happy Holiday!|",
    "url": "https://www.reddit.com/r/wallstreetbets/comments/zte2k2/moving_tickers_of_interest/",
    "score": 1,
    "author": "Badboyardie",
    "created_utc": 1671798440,
    "num_comments": 1
  }
}